[NoCoverage] ArrayDeclaration
js/components/pages/FeedPage.js:6:65
    ============================================================ */
 function FeedPage() {
   const { currentUser, likedPosts, toggleLike, following, follow, openModal, showToast } = React.useContext(AppContext);
-  const { data: posts, loading, error } = useFetch(API.getFeed, []);
+  const { data: posts, loading, error } = useFetch(API.getFeed, ["Stryker was here"]);
   const { data: news } = useFetch(API.getNews, []);
   const { data: hashtags } = useFetch(API.getHashtags, []);

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:11:50
   const { data: hashtags } = useFetch(API.getHashtags, []);
   const { data: users } = useFetch(API.getUsers, []);
   const [localPosts, setLocalPosts] = React.useState(null);
-  const [feedSort, setFeedSort] = React.useState('Top');
+  const [feedSort, setFeedSort] = React.useState("");
   const [expandedComments, setExpandedComments] = React.useState(new Set());
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:14:31
   const [feedSort, setFeedSort] = React.useState('Top');
   const [expandedComments, setExpandedComments] = React.useState(new Set());
 
-  React.useEffect(() => { if (posts) setLocalPosts(posts); }, [posts]);
+  React.useEffect(() => { if (false) setLocalPosts(posts); }, [posts]);
 
   if (loading) return <LoadingSpinner text="Loading feed..." />;

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:14:25
   const [feedSort, setFeedSort] = React.useState('Top');
   const [expandedComments, setExpandedComments] = React.useState(new Set());
 
-  React.useEffect(() => { if (posts) setLocalPosts(posts); }, [posts]);
+  React.useEffect(() => {}, [posts]);
 
   if (loading) return <LoadingSpinner text="Loading feed..." />;

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:16:7
 
   React.useEffect(() => { if (posts) setLocalPosts(posts); }, [posts]);
 
-  if (loading) return <LoadingSpinner text="Loading feed..." />;
+  if (true) return <LoadingSpinner text="Loading feed..." />;
   if (error) return (
     <div className="li-page-inner" style={{ textAlign: 'center', padding: 60 }}>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:16:7
 
   React.useEffect(() => { if (posts) setLocalPosts(posts); }, [posts]);
 
-  if (loading) return <LoadingSpinner text="Loading feed..." />;
+  if (false) return <LoadingSpinner text="Loading feed..." />;
   if (error) return (
     <div className="li-page-inner" style={{ textAlign: 'center', padding: 60 }}>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:17:7
   React.useEffect(() => { if (posts) setLocalPosts(posts); }, [posts]);
 
   if (loading) return <LoadingSpinner text="Loading feed..." />;
-  if (error) return (
+  if (false) return (
     <div className="li-page-inner" style={{ textAlign: 'center', padding: 60 }}>
       <svg width="48" height="48" viewBox="0 0 48 48" style={{ marginBottom: 12 }}>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:17:7
   React.useEffect(() => { if (posts) setLocalPosts(posts); }, [posts]);
 
   if (loading) return <LoadingSpinner text="Loading feed..." />;
-  if (error) return (
+  if (true) return (
     <div className="li-page-inner" style={{ textAlign: 'center', padding: 60 }}>
       <svg width="48" height="48" viewBox="0 0 48 48" style={{ marginBottom: 12 }}>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:23:26
         <rect width="48" height="48" rx="8" fill="#0F5DBD"/>
         <text x="11" y="36" fontFamily="-apple-system,BlinkMacSystemFont,'Segoe UI',sans-serif" fontSize="28" fontWeight="800" fill="#fff">N</text>
       </svg>
-      <p style={{ color: 'var(--text-2)', marginBottom: 8 }}>Could not load feed. Make sure the backend is running.</p>
+      <p style={{ color: "", marginBottom: 8 }}>Could not load feed. Make sure the backend is running.</p>
       <code style={{ fontSize: 12, color: 'var(--text-3)' }}>{error}</code>
     </div>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:28:20
     </div>
   );
 
-  const rawPosts = localPosts || [];
+  const rawPosts = false;
   const allPosts = feedSort === 'Recent'
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:28:20
     </div>
   );
 
-  const rawPosts = localPosts || [];
+  const rawPosts = localPosts && [];
   const allPosts = feedSort === 'Recent'
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:29:20
   );
 
   const rawPosts = localPosts || [];
-  const allPosts = feedSort === 'Recent'
+  const allPosts = false
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
     : [...rawPosts].sort((a, b) => {

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:29:20
   );
 
   const rawPosts = localPosts || [];
-  const allPosts = feedSort === 'Recent'
+  const allPosts = true
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
     : [...rawPosts].sort((a, b) => {

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:30:58
 
   const rawPosts = localPosts || [];
   const allPosts = feedSort === 'Recent'
-    ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
+    ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (true))
     : [...rawPosts].sort((a, b) => {
         const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions || 0);

[NoCoverage] ArithmeticOperator
js/components/pages/FeedPage.js:30:36
 
   const rawPosts = localPosts || [];
   const allPosts = feedSort === 'Recent'
-    ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
+    ? [...rawPosts].sort((a, b) => (b.timestamp || 0) + (a.timestamp || 0))
     : [...rawPosts].sort((a, b) => {
         const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions || 0);

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:31:36
   const rawPosts = localPosts || [];
   const allPosts = feedSort === 'Recent'
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
-    : [...rawPosts].sort((a, b) => {
-        const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions || 0);
-        const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (b.totalReactions || 0);
-        return rb - ra;
-      });
+    : [...rawPosts].sort((a, b) => {});
   const u = currentUser || {};
 

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:31:7
   const rawPosts = localPosts || [];
   const allPosts = feedSort === 'Recent'
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
-    : [...rawPosts].sort((a, b) => {
-        const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions || 0);
-        const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (b.totalReactions || 0);
-        return rb - ra;
-      });
+    : [...rawPosts];
   const u = currentUser || {};
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:32:91
   const allPosts = feedSort === 'Recent'
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
     : [...rawPosts].sort((a, b) => {
-        const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions || 0);
+        const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (false);
         const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (b.totalReactions || 0);
         return rb - ra;

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:32:91
   const allPosts = feedSort === 'Recent'
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
     : [...rawPosts].sort((a, b) => {
-        const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions || 0);
+        const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions && 0);
         const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (b.totalReactions || 0);
         return rb - ra;

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:33:91
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
     : [...rawPosts].sort((a, b) => {
         const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions || 0);
-        const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (b.totalReactions || 0);
+        const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (true);
         return rb - ra;
       });

[NoCoverage] ArithmeticOperator
js/components/pages/FeedPage.js:33:78
     ? [...rawPosts].sort((a, b) => (b.timestamp || 0) - (a.timestamp || 0))
     : [...rawPosts].sort((a, b) => {
         const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions || 0);
-        const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (b.totalReactions || 0);
+        const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s - v, 0) : (b.totalReactions || 0);
         return rb - ra;
       });

[NoCoverage] ArithmeticOperator
js/components/pages/FeedPage.js:34:16
     : [...rawPosts].sort((a, b) => {
         const ra = a.reactions ? Object.values(a.reactions).reduce((s, v) => s + v, 0) : (a.totalReactions || 0);
         const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (b.totalReactions || 0);
-        return rb - ra;
+        return rb + ra;
       });
   const u = currentUser || {};

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:36:13
         const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (b.totalReactions || 0);
         return rb - ra;
       });
-  const u = currentUser || {};
+  const u = currentUser && {};
 
   function handleNewPost(content) {

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:36:13
         const rb = b.reactions ? Object.values(b.reactions).reduce((s, v) => s + v, 0) : (b.totalReactions || 0);
         return rb - ra;
       });
-  const u = currentUser || {};
+  const u = false;
 
   function handleNewPost(content) {

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:38:35
       });
   const u = currentUser || {};
 
-  function handleNewPost(content) {
-    const newPost = {
-      id: Date.now(),
-      author: u.name,
-      authorId: u.id,
-      authorTitle: u.headline,
-      content,
-      createdAt: Date.now(),
-      timestamp: Date.now(),
-      likeCount: 0,
-      commentCount: 0,
-      repostCount: 0,
-      comments: [],
-    };
-    setLocalPosts(prev => [newPost, ...(prev || [])]);
-    setFeedSort('Recent');
-    API.createPost(content)
-      .then(() => showToast('Post shared!', 'success'))
-      .catch(() => {
-        setLocalPosts(prev => (prev || []).filter(p => p.id !== newPost.id));
-        showToast('Failed to post. Please try again.', 'error');
-      });
-  }
+  function handleNewPost(content) {}
 
   function toggleCommentsFor(postId) {

[NoCoverage] ArrayDeclaration
js/components/pages/FeedPage.js:50:17
       likeCount: 0,
       commentCount: 0,
       repostCount: 0,
-      comments: [],
+      comments: ["Stryker was here"],
     };
     setLocalPosts(prev => [newPost, ...(prev || [])]);

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:52:19
       repostCount: 0,
       comments: [],
     };
-    setLocalPosts(prev => [newPost, ...(prev || [])]);
+    setLocalPosts(() => undefined);
     setFeedSort('Recent');
     API.createPost(content)

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:52:41
       repostCount: 0,
       comments: [],
     };
-    setLocalPosts(prev => [newPost, ...(prev || [])]);
+    setLocalPosts(prev => [newPost, ...(true)]);
     setFeedSort('Recent');
     API.createPost(content)

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:53:17
       comments: [],
     };
     setLocalPosts(prev => [newPost, ...(prev || [])]);
-    setFeedSort('Recent');
+    setFeedSort("");
     API.createPost(content)
       .then(() => showToast('Post shared!', 'success'))

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:55:13
     setLocalPosts(prev => [newPost, ...(prev || [])]);
     setFeedSort('Recent');
     API.createPost(content)
-      .then(() => showToast('Post shared!', 'success'))
+      .then(() => undefined)
       .catch(() => {
         setLocalPosts(prev => (prev || []).filter(p => p.id !== newPost.id));

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:55:29
     setLocalPosts(prev => [newPost, ...(prev || [])]);
     setFeedSort('Recent');
     API.createPost(content)
-      .then(() => showToast('Post shared!', 'success'))
+      .then(() => showToast("", 'success'))
       .catch(() => {
         setLocalPosts(prev => (prev || []).filter(p => p.id !== newPost.id));

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:56:20
     setFeedSort('Recent');
     API.createPost(content)
       .then(() => showToast('Post shared!', 'success'))
-      .catch(() => {
-        setLocalPosts(prev => (prev || []).filter(p => p.id !== newPost.id));
-        showToast('Failed to post. Please try again.', 'error');
-      });
+      .catch(() => {});
   }
 

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:57:31
     API.createPost(content)
       .then(() => showToast('Post shared!', 'success'))
       .catch(() => {
-        setLocalPosts(prev => (prev || []).filter(p => p.id !== newPost.id));
+        setLocalPosts(prev => prev || []);
         showToast('Failed to post. Please try again.', 'error');
       });

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:57:32
     API.createPost(content)
       .then(() => showToast('Post shared!', 'success'))
       .catch(() => {
-        setLocalPosts(prev => (prev || []).filter(p => p.id !== newPost.id));
+        setLocalPosts(prev => (false).filter(p => p.id !== newPost.id));
         showToast('Failed to post. Please try again.', 'error');
       });

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:58:19
       .then(() => showToast('Post shared!', 'success'))
       .catch(() => {
         setLocalPosts(prev => (prev || []).filter(p => p.id !== newPost.id));
-        showToast('Failed to post. Please try again.', 'error');
+        showToast("", 'error');
       });
   }

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:62:38
       });
   }
 
-  function toggleCommentsFor(postId) {
-    setExpandedComments(prev => {
-      const next = new Set(prev);
-      if (next.has(postId)) next.delete(postId); else next.add(postId);
-      return next;
-    });
-  }
+  function toggleCommentsFor(postId) {}
 
   const sponsored = [

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:63:33
   }
 
   function toggleCommentsFor(postId) {
-    setExpandedComments(prev => {
-      const next = new Set(prev);
-      if (next.has(postId)) next.delete(postId); else next.add(postId);
-      return next;
-    });
+    setExpandedComments(prev => {});
   }
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:65:11
   function toggleCommentsFor(postId) {
     setExpandedComments(prev => {
       const next = new Set(prev);
-      if (next.has(postId)) next.delete(postId); else next.add(postId);
+      if (true) next.delete(postId); else next.add(postId);
       return next;
     });

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:65:11
   function toggleCommentsFor(postId) {
     setExpandedComments(prev => {
       const next = new Set(prev);
-      if (next.has(postId)) next.delete(postId); else next.add(postId);
+      if (false) next.delete(postId); else next.add(postId);
       return next;
     });

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:75:22
   ];
 
-  const suggUsers = (users || []).slice(0, 4);
+  const suggUsers = (true).slice(0, 4);
   const allNews = news || [];
   const allTags = hashtags || [];

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:75:22
   ];
 
-  const suggUsers = (users || []).slice(0, 4);
+  const suggUsers = (false).slice(0, 4);
   const allNews = news || [];
   const allTags = hashtags || [];

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:76:19
   ];
 
   const suggUsers = (users || []).slice(0, 4);
-  const allNews = news || [];
+  const allNews = false;
   const allTags = hashtags || [];
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:76:19
   ];
 
   const suggUsers = (users || []).slice(0, 4);
-  const allNews = news || [];
+  const allNews = true;
   const allTags = hashtags || [];
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:77:19
 
   const suggUsers = (users || []).slice(0, 4);
   const allNews = news || [];
-  const allTags = hashtags || [];
+  const allTags = true;
 
   return (

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:77:19
 
   const suggUsers = (users || []).slice(0, 4);
   const allNews = news || [];
-  const allTags = hashtags || [];
+  const allTags = false;
 
   return (

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:85:12
       {/* ── LEFT SIDEBAR ── */}
       <aside className="li-sidebar-left">
         <div className="li-card li-profile-card">
-          {u.name && (
-            <>
-              <div className="li-profile-card__banner" style={{ background: u.coverGradient || 'linear-gradient(135deg,#0a66c2,#004182)' }}>
-                <div className="li-profile-card__photo" style={{ cursor: 'pointer' }} onClick={() => navigate('profile')}>
-                  {getInitials(u.name)}
-                </div>
-              </div>
-              <div className="li-profile-card__info">
-                <div className="li-profile-card__name" onClick={() => navigate('profile')}>
-                  {u.name}
-
-                </div>
-                <div className="li-profile-card__headline">{(u.headline || '').split('|')[0].trim()}</div>
-                {u.location && <div style={{ fontSize: 12, color: 'var(--text-2)', marginTop: 2 }}>{u.location}</div>}
-              </div>
-
-            </>
-          )}
+          {u.name || <>
+              <div className="li-profile-card__banner" style={{
+    background: u.coverGradient || 'linear-gradient(135deg,#0a66c2,#004182)'
+  }}>
+                <div className="li-profile-card__photo" style={{
+      cursor: 'pointer'
+    }} onClick={() => navigate('profile')}>
+                  {getInitials(u.name)}
+                </div>
+              </div>
+              <div className="li-profile-card__info">
+                <div className="li-profile-card__name" onClick={() => navigate('profile')}>
+                  {u.name}
+
+                </div>
+                <div className="li-profile-card__headline">{(u.headline || '').split('|')[0].trim()}</div>
+                {u.location && <div style={{
+      fontSize: 12,
+      color: 'var(--text-2)',
+      marginTop: 2
+    }}>{u.location}</div>}
+              </div>
+
+            </>}
         </div>
       </aside>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:85:12
       {/* ── LEFT SIDEBAR ── */}
       <aside className="li-sidebar-left">
         <div className="li-card li-profile-card">
-          {u.name && (
-            <>
-              <div className="li-profile-card__banner" style={{ background: u.coverGradient || 'linear-gradient(135deg,#0a66c2,#004182)' }}>
-                <div className="li-profile-card__photo" style={{ cursor: 'pointer' }} onClick={() => navigate('profile')}>
-                  {getInitials(u.name)}
-                </div>
-              </div>
-              <div className="li-profile-card__info">
-                <div className="li-profile-card__name" onClick={() => navigate('profile')}>
-                  {u.name}
-
-                </div>
-                <div className="li-profile-card__headline">{(u.headline || '').split('|')[0].trim()}</div>
-                {u.location && <div style={{ fontSize: 12, color: 'var(--text-2)', marginTop: 2 }}>{u.location}</div>}
-              </div>
-
-            </>
-          )}
+          {true}
         </div>
       </aside>

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:87:77
         <div className="li-card li-profile-card">
           {u.name && (
             <>
-              <div className="li-profile-card__banner" style={{ background: u.coverGradient || 'linear-gradient(135deg,#0a66c2,#004182)' }}>
+              <div className="li-profile-card__banner" style={{ background: u.coverGradient && 'linear-gradient(135deg,#0a66c2,#004182)' }}>
                 <div className="li-profile-card__photo" style={{ cursor: 'pointer' }} onClick={() => navigate('profile')}>
                   {getInitials(u.name)}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:87:77
         <div className="li-card li-profile-card">
           {u.name && (
             <>
-              <div className="li-profile-card__banner" style={{ background: u.coverGradient || 'linear-gradient(135deg,#0a66c2,#004182)' }}>
+              <div className="li-profile-card__banner" style={{ background: false }}>
                 <div className="li-profile-card__photo" style={{ cursor: 'pointer' }} onClick={() => navigate('profile')}>
                   {getInitials(u.name)}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:88:96
           {u.name && (
             <>
               <div className="li-profile-card__banner" style={{ background: u.coverGradient || 'linear-gradient(135deg,#0a66c2,#004182)' }}>
-                <div className="li-profile-card__photo" style={{ cursor: 'pointer' }} onClick={() => navigate('profile')}>
+                <div className="li-profile-card__photo" style={{ cursor: 'pointer' }} onClick={() => undefined}>
                   {getInitials(u.name)}
                 </div>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:93:65
                 </div>
               </div>
               <div className="li-profile-card__info">
-                <div className="li-profile-card__name" onClick={() => navigate('profile')}>
+                <div className="li-profile-card__name" onClick={() => undefined}>
                   {u.name}
 

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:93:80
                 </div>
               </div>
               <div className="li-profile-card__info">
-                <div className="li-profile-card__name" onClick={() => navigate('profile')}>
+                <div className="li-profile-card__name" onClick={() => navigate("")}>
                   {u.name}
 

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:97:61
                   {u.name}
 
                 </div>
-                <div className="li-profile-card__headline">{(u.headline || '').split('|')[0].trim()}</div>
+                <div className="li-profile-card__headline">{(u.headline || '').split('|')[0]}</div>
                 {u.location && <div style={{ fontSize: 12, color: 'var(--text-2)', marginTop: 2 }}>{u.location}</div>}
               </div>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:97:62
                   {u.name}
 
                 </div>
-                <div className="li-profile-card__headline">{(u.headline || '').split('|')[0].trim()}</div>
+                <div className="li-profile-card__headline">{(false).split('|')[0].trim()}</div>
                 {u.location && <div style={{ fontSize: 12, color: 'var(--text-2)', marginTop: 2 }}>{u.location}</div>}
               </div>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:98:18
 
                 </div>
                 <div className="li-profile-card__headline">{(u.headline || '').split('|')[0].trim()}</div>
-                {u.location && <div style={{ fontSize: 12, color: 'var(--text-2)', marginTop: 2 }}>{u.location}</div>}
+                {false}
               </div>
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:98:18
 
                 </div>
                 <div className="li-profile-card__headline">{(u.headline || '').split('|')[0].trim()}</div>
-                {u.location && <div style={{ fontSize: 12, color: 'var(--text-2)', marginTop: 2 }}>{u.location}</div>}
+                {true}
               </div>
 

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:112:104
         <PostCreator user={u} onPost={handleNewPost} openModal={openModal} showToast={showToast} />
 
         {/* Sort bar */}
-        <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', padding: '6px 12px', background: 'var(--white)', borderRadius: 8, boxShadow: 'var(--shadow-sm)' }}>
+        <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', padding: "", background: 'var(--white)', borderRadius: 8, boxShadow: 'var(--shadow-sm)' }}>
           <span style={{ fontSize: 13, color: 'var(--text-2)' }}>Sort by:</span>
           <div style={{ display: 'flex', gap: 4, background: 'var(--bg)', borderRadius: 16, padding: 3 }}>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:112:32
         <PostCreator user={u} onPost={handleNewPost} openModal={openModal} showToast={showToast} />
 
         {/* Sort bar */}
-        <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', padding: '6px 12px', background: 'var(--white)', borderRadius: 8, boxShadow: 'var(--shadow-sm)' }}>
+        <div style={{ display: "", alignItems: 'center', justifyContent: 'space-between', padding: '6px 12px', background: 'var(--white)', borderRadius: 8, boxShadow: 'var(--shadow-sm)' }}>
           <span style={{ fontSize: 13, color: 'var(--text-2)' }}>Sort by:</span>
           <div style={{ display: 'flex', gap: 4, background: 'var(--bg)', borderRadius: 16, padding: 3 }}>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:113:24
 
         {/* Sort bar */}
         <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', padding: '6px 12px', background: 'var(--white)', borderRadius: 8, boxShadow: 'var(--shadow-sm)' }}>
-          <span style={{ fontSize: 13, color: 'var(--text-2)' }}>Sort by:</span>
+          <span style={{}}>Sort by:</span>
           <div style={{ display: 'flex', gap: 4, background: 'var(--bg)', borderRadius: 16, padding: 3 }}>
             {['Top', 'Recent'].map(s => (

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:115:36
         <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', padding: '6px 12px', background: 'var(--white)', borderRadius: 8, boxShadow: 'var(--shadow-sm)' }}>
           <span style={{ fontSize: 13, color: 'var(--text-2)' }}>Sort by:</span>
           <div style={{ display: 'flex', gap: 4, background: 'var(--bg)', borderRadius: 16, padding: 3 }}>
-            {['Top', 'Recent'].map(s => (
-              <button key={s} onClick={() => setFeedSort(s)} style={{
-                padding: '4px 14px', borderRadius: 12, border: 'none',
-                background: feedSort === s ? 'var(--blue)' : 'transparent',
-                color: feedSort === s ? '#fff' : 'var(--text-2)',
-                fontSize: 13, fontWeight: 600, cursor: 'pointer', transition: 'all 0.15s',
-              }}>{s}</button>
-            ))}
+            {['Top', 'Recent'].map(() => undefined)}
           </div>
         </div>

[NoCoverage] ArrayDeclaration
js/components/pages/FeedPage.js:115:14
         <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', padding: '6px 12px', background: 'var(--white)', borderRadius: 8, boxShadow: 'var(--shadow-sm)' }}>
           <span style={{ fontSize: 13, color: 'var(--text-2)' }}>Sort by:</span>
           <div style={{ display: 'flex', gap: 4, background: 'var(--bg)', borderRadius: 16, padding: 3 }}>
-            {['Top', 'Recent'].map(s => (
+            {[].map(s => (
               <button key={s} onClick={() => setFeedSort(s)} style={{
                 padding: '4px 14px', borderRadius: 12, border: 'none',

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:116:40
           <span style={{ fontSize: 13, color: 'var(--text-2)' }}>Sort by:</span>
           <div style={{ display: 'flex', gap: 4, background: 'var(--bg)', borderRadius: 16, padding: 3 }}>
             {['Top', 'Recent'].map(s => (
-              <button key={s} onClick={() => setFeedSort(s)} style={{
+              <button key={s} onClick={() => undefined} style={{
                 padding: '4px 14px', borderRadius: 12, border: 'none',
                 background: feedSort === s ? 'var(--blue)' : 'transparent',

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:117:26
           <div style={{ display: 'flex', gap: 4, background: 'var(--bg)', borderRadius: 16, padding: 3 }}>
             {['Top', 'Recent'].map(s => (
               <button key={s} onClick={() => setFeedSort(s)} style={{
-                padding: '4px 14px', borderRadius: 12, border: 'none',
+                padding: "", borderRadius: 12, border: 'none',
                 background: feedSort === s ? 'var(--blue)' : 'transparent',
                 color: feedSort === s ? '#fff' : 'var(--text-2)',
