[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:118:29
             {['Top', 'Recent'].map(s => (
               <button key={s} onClick={() => setFeedSort(s)} style={{
                 padding: '4px 14px', borderRadius: 12, border: 'none',
-                background: feedSort === s ? 'var(--blue)' : 'transparent',
+                background: true ? 'var(--blue)' : 'transparent',
                 color: feedSort === s ? '#fff' : 'var(--text-2)',
                 fontSize: 13, fontWeight: 600, cursor: 'pointer', transition: 'all 0.15s',

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:118:29
             {['Top', 'Recent'].map(s => (
               <button key={s} onClick={() => setFeedSort(s)} style={{
                 padding: '4px 14px', borderRadius: 12, border: 'none',
-                background: feedSort === s ? 'var(--blue)' : 'transparent',
+                background: false ? 'var(--blue)' : 'transparent',
                 color: feedSort === s ? '#fff' : 'var(--text-2)',
                 fontSize: 13, fontWeight: 600, cursor: 'pointer', transition: 'all 0.15s',

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:119:24
               <button key={s} onClick={() => setFeedSort(s)} style={{
                 padding: '4px 14px', borderRadius: 12, border: 'none',
                 background: feedSort === s ? 'var(--blue)' : 'transparent',
-                color: feedSort === s ? '#fff' : 'var(--text-2)',
+                color: true ? '#fff' : 'var(--text-2)',
                 fontSize: 13, fontWeight: 600, cursor: 'pointer', transition: 'all 0.15s',
               }}>{s}</button>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:119:24
               <button key={s} onClick={() => setFeedSort(s)} style={{
                 padding: '4px 14px', borderRadius: 12, border: 'none',
                 background: feedSort === s ? 'var(--blue)' : 'transparent',
-                color: feedSort === s ? '#fff' : 'var(--text-2)',
+                color: false ? '#fff' : 'var(--text-2)',
                 fontSize: 13, fontWeight: 600, cursor: 'pointer', transition: 'all 0.15s',
               }}>{s}</button>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:127:23
         </div>
 
         {/* Posts */}
-        {allPosts.map((post, i) => (
-          <React.Fragment key={post.id}>
-            <FeedPost
-              post={post}
-              liked={likedPosts.has(String(post.id))}
-              onLike={() => { toggleLike(String(post.id)); }}
-              commentsOpen={expandedComments.has(post.id)}
-              onToggleComments={() => toggleCommentsFor(post.id)}
-              following={following}
-              onFollow={follow}
-              openModal={openModal}
-              showToast={showToast}
-              currentUser={u}
-              onDelete={id => setLocalPosts(prev => prev.filter(p => p.id !== id))}
-            />
-            {/* Sponsored posts interspersed */}
-            {(i === 1 || i === 3) && (
-              <SponsoredPost key={`ad-${i}`} ad={sponsored[i === 1 ? 0 : 1]} showToast={showToast} />
-            )}
-          </React.Fragment>
-        ))}
+        {allPosts.map(() => undefined)}
 
         {allPosts.length === 0 && (

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:132:29
             <FeedPost
               post={post}
               liked={likedPosts.has(String(post.id))}
-              onLike={() => { toggleLike(String(post.id)); }}
+              onLike={() => {}}
               commentsOpen={expandedComments.has(post.id)}
               onToggleComments={() => toggleCommentsFor(post.id)}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:134:33
               liked={likedPosts.has(String(post.id))}
               onLike={() => { toggleLike(String(post.id)); }}
               commentsOpen={expandedComments.has(post.id)}
-              onToggleComments={() => toggleCommentsFor(post.id)}
+              onToggleComments={() => undefined}
               following={following}
               onFollow={follow}

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:140:70
               openModal={openModal}
               showToast={showToast}
               currentUser={u}
-              onDelete={id => setLocalPosts(prev => prev.filter(p => p.id !== id))}
+              onDelete={id => setLocalPosts(prev => prev.filter(p => p.id === id))}
             />
             {/* Sponsored posts interspersed */}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:140:45
               openModal={openModal}
               showToast={showToast}
               currentUser={u}
-              onDelete={id => setLocalPosts(prev => prev.filter(p => p.id !== id))}
+              onDelete={id => setLocalPosts(() => undefined)}
             />
             {/* Sponsored posts interspersed */}

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:143:15
               onDelete={id => setLocalPosts(prev => prev.filter(p => p.id !== id))}
             />
             {/* Sponsored posts interspersed */}
-            {(i === 1 || i === 3) && (
+            {(i !== 1 || i === 3) && (
               <SponsoredPost key={`ad-${i}`} ad={sponsored[i === 1 ? 0 : 1]} showToast={showToast} />
             )}

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:143:15
               onDelete={id => setLocalPosts(prev => prev.filter(p => p.id !== id))}
             />
             {/* Sponsored posts interspersed */}
-            {(i === 1 || i === 3) && (
+            {(i === 1 && i === 3) && (
               <SponsoredPost key={`ad-${i}`} ad={sponsored[i === 1 ? 0 : 1]} showToast={showToast} />
             )}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:144:60
             />
             {/* Sponsored posts interspersed */}
             {(i === 1 || i === 3) && (
-              <SponsoredPost key={`ad-${i}`} ad={sponsored[i === 1 ? 0 : 1]} showToast={showToast} />
+              <SponsoredPost key={`ad-${i}`} ad={sponsored[false ? 0 : 1]} showToast={showToast} />
             )}
           </React.Fragment>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:144:60
             />
             {/* Sponsored posts interspersed */}
             {(i === 1 || i === 3) && (
-              <SponsoredPost key={`ad-${i}`} ad={sponsored[i === 1 ? 0 : 1]} showToast={showToast} />
+              <SponsoredPost key={`ad-${i}`} ad={sponsored[true ? 0 : 1]} showToast={showToast} />
             )}
           </React.Fragment>

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:149:10
           </React.Fragment>
         ))}
 
-        {allPosts.length === 0 && (
+        {allPosts.length !== 0 && (
           <div className="li-card" style={{ textAlign: 'center', padding: 40, color: 'var(--text-2)' }}>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:149:10
           </React.Fragment>
         ))}
 
-        {allPosts.length === 0 && (
+        {true && (
           <div className="li-card" style={{ textAlign: 'center', padding: 40, color: 'var(--text-2)' }}>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:150:43
         ))}
 
         {allPosts.length === 0 && (
-          <div className="li-card" style={{ textAlign: 'center', padding: 40, color: 'var(--text-2)' }}>
+          <div className="li-card" style={{}}>
             <div>Your feed is empty. Follow people and companies to see posts here.</div>

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:161:10
       <aside className="li-sidebar-right">
 
         {/* People you may know */}
-        {suggUsers.length > 0 && (
+        {suggUsers.length >= 0 && (
           <div className="li-card" style={{ padding: '12px 0' }}>
             <div style={{ padding: '0 16px 8px', fontWeight: 700, fontSize: 15 }}>People you may know</div>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:161:10
       <aside className="li-sidebar-right">
 
         {/* People you may know */}
-        {suggUsers.length > 0 && (
+        {true && (
           <div className="li-card" style={{ padding: '12px 0' }}>
             <div style={{ padding: '0 16px 8px', fontWeight: 700, fontSize: 15 }}>People you may know</div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:163:36
         {/* People you may know */}
         {suggUsers.length > 0 && (
           <div className="li-card" style={{ padding: '12px 0' }}>
-            <div style={{ padding: '0 16px 8px', fontWeight: 700, fontSize: 15 }}>People you may know</div>
+            <div style={{ padding: "", fontWeight: 700, fontSize: 15 }}>People you may know</div>
             {suggUsers.map(su => {
               const isFollowing = following.has(String(su.id));

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:167:52
             {suggUsers.map(su => {
               const isFollowing = following.has(String(su.id));
               return (
-                <div key={su.id} style={{ display: 'flex', alignItems: 'center', gap: 10, padding: '6px 16px' }}>
+                <div key={su.id} style={{ display: "", alignItems: 'center', gap: 10, padding: '6px 16px' }}>
                   <div style={{ cursor: 'pointer', flexShrink: 0 }} onClick={() => navigate(`profile?id=${su.id}`)}>
                     <Avatar name={su.name} size={36} colorOverride={su.avatarColor} />

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:167:72
             {suggUsers.map(su => {
               const isFollowing = following.has(String(su.id));
               return (
-                <div key={su.id} style={{ display: 'flex', alignItems: 'center', gap: 10, padding: '6px 16px' }}>
+                <div key={su.id} style={{ display: 'flex', alignItems: "", gap: 10, padding: '6px 16px' }}>
                   <div style={{ cursor: 'pointer', flexShrink: 0 }} onClick={() => navigate(`profile?id=${su.id}`)}>
                     <Avatar name={su.name} size={36} colorOverride={su.avatarColor} />

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:168:78
               const isFollowing = following.has(String(su.id));
               return (
                 <div key={su.id} style={{ display: 'flex', alignItems: 'center', gap: 10, padding: '6px 16px' }}>
-                  <div style={{ cursor: 'pointer', flexShrink: 0 }} onClick={() => navigate(`profile?id=${su.id}`)}>
+                  <div style={{ cursor: 'pointer', flexShrink: 0 }} onClick={() => undefined}>
                     <Avatar name={su.name} size={36} colorOverride={su.avatarColor} />
                   </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:168:41
               const isFollowing = following.has(String(su.id));
               return (
                 <div key={su.id} style={{ display: 'flex', alignItems: 'center', gap: 10, padding: '6px 16px' }}>
-                  <div style={{ cursor: 'pointer', flexShrink: 0 }} onClick={() => navigate(`profile?id=${su.id}`)}>
+                  <div style={{ cursor: "", flexShrink: 0 }} onClick={() => navigate(`profile?id=${su.id}`)}>
                     <Avatar name={su.name} size={36} colorOverride={su.avatarColor} />
                   </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:172:142
                     <Avatar name={su.name} size={36} colorOverride={su.avatarColor} />
                   </div>
                   <div style={{ flex: 1, minWidth: 0 }}>
-                    <div style={{ fontSize: 13, fontWeight: 600, overflow: 'hidden', textOverflow: 'ellipsis', whiteSpace: 'nowrap', cursor: 'pointer' }}
+                    <div style={{ fontSize: 13, fontWeight: 600, overflow: 'hidden', textOverflow: 'ellipsis', whiteSpace: 'nowrap', cursor: "" }}
                       onClick={() => navigate(`profile?id=${su.id}`)}>
                       {su.name}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:173:32
                   </div>
                   <div style={{ flex: 1, minWidth: 0 }}>
                     <div style={{ fontSize: 13, fontWeight: 600, overflow: 'hidden', textOverflow: 'ellipsis', whiteSpace: 'nowrap', cursor: 'pointer' }}
-                      onClick={() => navigate(`profile?id=${su.id}`)}>
+                      onClick={() => undefined}>
                       {su.name}
                     </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:176:56
                       onClick={() => navigate(`profile?id=${su.id}`)}>
                       {su.name}
                     </div>
-                    <div style={{ fontSize: 12, color: 'var(--text-2)', overflow: 'hidden', textOverflow: 'ellipsis', whiteSpace: 'nowrap' }}>
+                    <div style={{ fontSize: 12, color: "", overflow: 'hidden', textOverflow: 'ellipsis', whiteSpace: 'nowrap' }}>
                       {(su.headline || '').split('|')[0].trim()}
                     </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:176:131
                       onClick={() => navigate(`profile?id=${su.id}`)}>
                       {su.name}
                     </div>
-                    <div style={{ fontSize: 12, color: 'var(--text-2)', overflow: 'hidden', textOverflow: 'ellipsis', whiteSpace: 'nowrap' }}>
+                    <div style={{ fontSize: 12, color: 'var(--text-2)', overflow: 'hidden', textOverflow: 'ellipsis', whiteSpace: "" }}>
                       {(su.headline || '').split('|')[0].trim()}
                     </div>

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:177:24
                       {su.name}
                     </div>
                     <div style={{ fontSize: 12, color: 'var(--text-2)', overflow: 'hidden', textOverflow: 'ellipsis', whiteSpace: 'nowrap' }}>
-                      {(su.headline || '').split('|')[0].trim()}
+                      {(su.headline || '').split('|')[0]}
                     </div>
                   </div>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:177:25
                       {su.name}
                     </div>
                     <div style={{ fontSize: 12, color: 'var(--text-2)', overflow: 'hidden', textOverflow: 'ellipsis', whiteSpace: 'nowrap' }}>
-                      {(su.headline || '').split('|')[0].trim()}
+                      {(true).split('|')[0].trim()}
                     </div>
                   </div>

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:181:36
                     </div>
                   </div>
                   <button
-                    onClick={() => { follow(su.id); showToast(`Following ${su.name}`); }}
+                    onClick={() => {}}
                     style={{
                       flexShrink: 0, border: `1px solid ${isFollowing ? 'var(--border)' : 'var(--blue)'}`,

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:182:28
                   </div>
                   <button
                     onClick={() => { follow(su.id); showToast(`Following ${su.name}`); }}
-                    style={{
-                      flexShrink: 0, border: `1px solid ${isFollowing ? 'var(--border)' : 'var(--blue)'}`,
-                      color: isFollowing ? 'var(--text-2)' : 'var(--blue)', background: 'none',
-                      borderRadius: 16, padding: '4px 10px', fontSize: 12, fontWeight: 600, cursor: 'pointer',
-                    }}>
+                    style={{}}>
                     {isFollowing ? 'Following' : '+ Follow'}
                   </button>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:183:91
                   <button
                     onClick={() => { follow(su.id); showToast(`Following ${su.name}`); }}
                     style={{
-                      flexShrink: 0, border: `1px solid ${isFollowing ? 'var(--border)' : 'var(--blue)'}`,
+                      flexShrink: 0, border: `1px solid ${isFollowing ? 'var(--border)' : ""}`,
                       color: isFollowing ? 'var(--text-2)' : 'var(--blue)', background: 'none',
                       borderRadius: 16, padding: '4px 10px', fontSize: 12, fontWeight: 600, cursor: 'pointer',

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:183:46
                   <button
                     onClick={() => { follow(su.id); showToast(`Following ${su.name}`); }}
                     style={{
-                      flexShrink: 0, border: `1px solid ${isFollowing ? 'var(--border)' : 'var(--blue)'}`,
+                      flexShrink: 0, border: ``,
                       color: isFollowing ? 'var(--text-2)' : 'var(--blue)', background: 'none',
                       borderRadius: 16, padding: '4px 10px', fontSize: 12, fontWeight: 600, cursor: 'pointer',

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:192:86
                 </div>
               );
             })}
-            <div style={{ padding: '8px 16px', fontSize: 13, fontWeight: 600, color: 'var(--text-2)', cursor: 'pointer', display: 'flex', alignItems: 'center', gap: 4, justifyContent: 'center' }}
+            <div style={{ padding: '8px 16px', fontSize: 13, fontWeight: 600, color: "", cursor: 'pointer', display: 'flex', alignItems: 'center', gap: 4, justifyContent: 'center' }}
               onClick={() => navigate('network')}>
               View all recommendations

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:192:151
                 </div>
               );
             })}
-            <div style={{ padding: '8px 16px', fontSize: 13, fontWeight: 600, color: 'var(--text-2)', cursor: 'pointer', display: 'flex', alignItems: 'center', gap: 4, justifyContent: 'center' }}
+            <div style={{ padding: '8px 16px', fontSize: 13, fontWeight: 600, color: 'var(--text-2)', cursor: 'pointer', display: 'flex', alignItems: "", gap: 4, justifyContent: 'center' }}
               onClick={() => navigate('network')}>
               View all recommendations

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:193:24
               );
             })}
             <div style={{ padding: '8px 16px', fontSize: 13, fontWeight: 600, color: 'var(--text-2)', cursor: 'pointer', display: 'flex', alignItems: 'center', gap: 4, justifyContent: 'center' }}
-              onClick={() => navigate('network')}>
+              onClick={() => undefined}>
               View all recommendations
               <svg viewBox="0 0 16 16" width="14" height="14" fill="none" stroke="currentColor" strokeWidth="2"><path d="M6 12l4-4-4-4"/></svg>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:207:44
 
 /* ── PostCreator ─────────────────────────────────────────── */
 function PostCreator({ user, onPost, openModal, showToast }) {
-  const [draft, setDraft] = React.useState('');
+  const [draft, setDraft] = React.useState("Stryker was here!");
   const [expanded, setExpanded] = React.useState(false);
   const MAX = 3000;

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:208:50
 /* ── PostCreator ─────────────────────────────────────────── */
 function PostCreator({ user, onPost, openModal, showToast }) {
   const [draft, setDraft] = React.useState('');
-  const [expanded, setExpanded] = React.useState(false);
+  const [expanded, setExpanded] = React.useState(true);
   const MAX = 3000;
 

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:211:21
   const [expanded, setExpanded] = React.useState(false);
   const MAX = 3000;
 
-  function submit() {
-    if (!draft.trim()) return;
-    onPost(draft.trim());
-    setDraft('');
-    setExpanded(false);
-  }
+  function submit() {}
 
   return (

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:212:9
   const MAX = 3000;
 
   function submit() {
-    if (!draft.trim()) return;
+    if (true) return;
     onPost(draft.trim());
     setDraft('');

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:212:9
   const MAX = 3000;
 
   function submit() {
-    if (!draft.trim()) return;
+    if (false) return;
     onPost(draft.trim());
     setDraft('');

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:213:12
 
   function submit() {
     if (!draft.trim()) return;
-    onPost(draft.trim());
+    onPost(draft);
     setDraft('');
     setExpanded(false);

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:214:14
   function submit() {
     if (!draft.trim()) return;
     onPost(draft.trim());
-    setDraft('');
+    setDraft("Stryker was here!");
     setExpanded(false);
   }

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:215:17
     if (!draft.trim()) return;
     onPost(draft.trim());
     setDraft('');
-    setExpanded(false);
+    setExpanded(true);
   }
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:222:24
     <div className="li-card li-post-creator">
       <div className="li-post-creator__top">
-          {getInitials(user.name || 'Me')}
+          {getInitials(true)}
         </div>
         {!expanded ? (

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:222:24
     <div className="li-card li-post-creator">
       <div className="li-post-creator__top">
-          {getInitials(user.name || 'Me')}
+          {getInitials(false)}
         </div>
         {!expanded ? (

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:224:10
           {getInitials(user.name || 'Me')}
         </div>
-        {!expanded ? (
+        {expanded ? (
           <button className="li-post-creator__trigger" onClick={() => setExpanded(true)}>
             Start a post

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:225:83
           {getInitials(user.name || 'Me')}
         </div>
         {!expanded ? (
-          <button className="li-post-creator__trigger" onClick={() => setExpanded(true)}>
+          <button className="li-post-creator__trigger" onClick={() => setExpanded(false)}>
             Start a post
           </button>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:225:65
           {getInitials(user.name || 'Me')}
         </div>
         {!expanded ? (
-          <button className="li-post-creator__trigger" onClick={() => setExpanded(true)}>
+          <button className="li-post-creator__trigger" onClick={() => undefined}>
             Start a post
           </button>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:232:23
           <textarea
             autoFocus
             value={draft}
-            onChange={e => setDraft(e.target.value)}
+            onChange={() => undefined}
             placeholder="What do you want to talk about?"
             maxLength={MAX}

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:236:32
             placeholder="What do you want to talk about?"
             maxLength={MAX}
             style={{
-              flex: 1, border: '1px solid var(--border)', borderRadius: 8,
+              flex: 1, border: "", borderRadius: 8,
               padding: '10px 14px', fontSize: 15, resize: 'none', outline: 'none',
               fontFamily: 'inherit', minHeight: 80, background: 'var(--white)', color: 'var(--text)',

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:244:56
         )}
       </div>
       {expanded && (
-        <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center', marginTop: 8, paddingTop: 8, borderTop: '1px solid var(--border)' }}>
+        <div style={{ display: 'flex', justifyContent: "", alignItems: 'center', marginTop: 8, paddingTop: 8, borderTop: '1px solid var(--border)' }}>
           <div style={{ display: 'flex', gap: 4 }}>
             {[['Photo','Photo'],['Video','Video'],['Event','Event'],['Article','Article']].map(([icon, label]) => (

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:244:135
         )}
       </div>
       {expanded && (
-        <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center', marginTop: 8, paddingTop: 8, borderTop: '1px solid var(--border)' }}>
+        <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center', marginTop: 8, paddingTop: 8, borderTop: "" }}>
           <div style={{ display: 'flex', gap: 4 }}>
             {[['Photo','Photo'],['Video','Video'],['Event','Event'],['Article','Article']].map(([icon, label]) => (

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:245:23
       </div>
       {expanded && (
         <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center', marginTop: 8, paddingTop: 8, borderTop: '1px solid var(--border)' }}>
-          <div style={{ display: 'flex', gap: 4 }}>
+          <div style={{}}>
             {[['Photo','Photo'],['Video','Video'],['Event','Event'],['Article','Article']].map(([icon, label]) => (
               <button key={label} title={label}

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:246:42
       {expanded && (
         <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center', marginTop: 8, paddingTop: 8, borderTop: '1px solid var(--border)' }}>
           <div style={{ display: 'flex', gap: 4 }}>
-            {[['Photo','Photo'],['Video','Video'],['Event','Event'],['Article','Article']].map(([icon, label]) => (
+            {[['Photo','Photo'],['Video',""],['Event','Event'],['Article','Article']].map(([icon, label]) => (
               <button key={label} title={label}
                 onClick={() => { if (label === 'Event') navigate('events'); else showToast(`${label} upload — coming soon`); }}

[NoCoverage] ArrayDeclaration
js/components/pages/FeedPage.js:246:14
       {expanded && (
         <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'center', marginTop: 8, paddingTop: 8, borderTop: '1px solid var(--border)' }}>
           <div style={{ display: 'flex', gap: 4 }}>
-            {[['Photo','Photo'],['Video','Video'],['Event','Event'],['Article','Article']].map(([icon, label]) => (
+            {[].map(([icon, label]) => (
               <button key={label} title={label}
                 onClick={() => { if (label === 'Event') navigate('events'); else showToast(`${label} upload — coming soon`); }}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:248:38
           <div style={{ display: 'flex', gap: 4 }}>
             {[['Photo','Photo'],['Video','Video'],['Event','Event'],['Article','Article']].map(([icon, label]) => (
               <button key={label} title={label}
-                onClick={() => { if (label === 'Event') navigate('events'); else showToast(`${label} upload — coming soon`); }}
+                onClick={() => { if (true) navigate('events'); else showToast(`${label} upload — coming soon`); }}
                 onMouseEnter={e => e.currentTarget.style.background = 'var(--bg)'}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:248:38
           <div style={{ display: 'flex', gap: 4 }}>
             {[['Photo','Photo'],['Video','Video'],['Event','Event'],['Article','Article']].map(([icon, label]) => (
               <button key={label} title={label}
-                onClick={() => { if (label === 'Event') navigate('events'); else showToast(`${label} upload — coming soon`); }}
+                onClick={() => { if (false) navigate('events'); else showToast(`${label} upload — coming soon`); }}
                 onMouseEnter={e => e.currentTarget.style.background = 'var(--bg)'}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:250:31
               <button key={label} title={label}
                 onClick={() => { if (label === 'Event') navigate('events'); else showToast(`${label} upload — coming soon`); }}
-                onMouseEnter={e => e.currentTarget.style.background = 'var(--bg)'}
+                onMouseEnter={() => undefined}
                 onMouseLeave={e => e.currentTarget.style.background = 'none'}>
                 <span style={{ fontSize: 13 }}>{icon}</span>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:251:31
                 onClick={() => { if (label === 'Event') navigate('events'); else showToast(`${label} upload — coming soon`); }}
                 onMouseEnter={e => e.currentTarget.style.background = 'var(--bg)'}
-                onMouseLeave={e => e.currentTarget.style.background = 'none'}>
+                onMouseLeave={() => undefined}>
                 <span style={{ fontSize: 13 }}>{icon}</span>
               </button>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:257:49
             ))}
           </div>
           <div style={{ display: 'flex', gap: 8, alignItems: 'center' }}>
-            <span style={{ fontSize: 12, color: MAX - draft.length < 200 ? '#CC1016' : 'var(--text-3)' }}>
+            <span style={{ fontSize: 12, color: true ? '#CC1016' : 'var(--text-3)' }}>
               {MAX - draft.length}
             </span>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:257:49
             ))}
           </div>
           <div style={{ display: 'flex', gap: 8, alignItems: 'center' }}>
-            <span style={{ fontSize: 12, color: MAX - draft.length < 200 ? '#CC1016' : 'var(--text-3)' }}>
+            <span style={{ fontSize: 12, color: false ? '#CC1016' : 'var(--text-3)' }}>
               {MAX - draft.length}
             </span>
