[NoCoverage] ArithmeticOperator
js/components/pages/FeedPage.js:258:16
           </div>
           <div style={{ display: 'flex', gap: 8, alignItems: 'center' }}>
             <span style={{ fontSize: 12, color: MAX - draft.length < 200 ? '#CC1016' : 'var(--text-3)' }}>
-              {MAX - draft.length}
+              {MAX + draft.length}
             </span>
             <button onClick={() => setExpanded(false)} style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 14, padding: '4px 8px' }}>Cancel</button>

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:260:48
             <span style={{ fontSize: 12, color: MAX - draft.length < 200 ? '#CC1016' : 'var(--text-3)' }}>
               {MAX - draft.length}
             </span>
-            <button onClick={() => setExpanded(false)} style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 14, padding: '4px 8px' }}>Cancel</button>
+            <button onClick={() => setExpanded(true)} style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 14, padding: '4px 8px' }}>Cancel</button>
             <button
               onClick={submit}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:260:30
             <span style={{ fontSize: 12, color: MAX - draft.length < 200 ? '#CC1016' : 'var(--text-3)' }}>
               {MAX - draft.length}
             </span>
-            <button onClick={() => setExpanded(false)} style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 14, padding: '4px 8px' }}>Cancel</button>
+            <button onClick={() => undefined} style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 14, padding: '4px 8px' }}>Cancel</button>
             <button
               onClick={submit}

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:263:25
             <button onClick={() => setExpanded(false)} style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 14, padding: '4px 8px' }}>Cancel</button>
             <button
               onClick={submit}
-              disabled={!draft.trim() || draft.length > MAX}
+              disabled={!draft.trim() && draft.length > MAX}
               style={{
                 background: draft.trim() && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:263:42
             <button onClick={() => setExpanded(false)} style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 14, padding: '4px 8px' }}>Cancel</button>
             <button
               onClick={submit}
-              disabled={!draft.trim() || draft.length > MAX}
+              disabled={!draft.trim() || draft.length >= MAX}
               style={{
                 background: draft.trim() && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:264:22
             <button
               onClick={submit}
               disabled={!draft.trim() || draft.length > MAX}
-              style={{
-                background: draft.trim() && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',
-                color: draft.trim() && draft.length <= MAX ? '#fff' : 'var(--text-3)',
-                border: 'none', borderRadius: 20, padding: '8px 22px', fontSize: 14, fontWeight: 600,
-                cursor: draft.trim() && draft.length <= MAX ? 'pointer' : 'not-allowed',
-              }}>
+              style={{}}>
               Post
             </button>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:265:29
               onClick={submit}
               disabled={!draft.trim() || draft.length > MAX}
               style={{
-                background: draft.trim() && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',
+                background: true ? 'var(--blue)' : 'var(--border)',
                 color: draft.trim() && draft.length <= MAX ? '#fff' : 'var(--text-3)',
                 border: 'none', borderRadius: 20, padding: '8px 22px', fontSize: 14, fontWeight: 600,

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:265:29
               onClick={submit}
               disabled={!draft.trim() || draft.length > MAX}
               style={{
-                background: draft.trim() && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',
+                background: draft && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',
                 color: draft.trim() && draft.length <= MAX ? '#fff' : 'var(--text-3)',
                 border: 'none', borderRadius: 20, padding: '8px 22px', fontSize: 14, fontWeight: 600,

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:266:24
               disabled={!draft.trim() || draft.length > MAX}
               style={{
                 background: draft.trim() && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',
-                color: draft.trim() && draft.length <= MAX ? '#fff' : 'var(--text-3)',
+                color: draft.trim() || draft.length <= MAX ? '#fff' : 'var(--text-3)',
                 border: 'none', borderRadius: 20, padding: '8px 22px', fontSize: 14, fontWeight: 600,
                 cursor: draft.trim() && draft.length <= MAX ? 'pointer' : 'not-allowed',

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:266:24
               disabled={!draft.trim() || draft.length > MAX}
               style={{
                 background: draft.trim() && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',
-                color: draft.trim() && draft.length <= MAX ? '#fff' : 'var(--text-3)',
+                color: false ? '#fff' : 'var(--text-3)',
                 border: 'none', borderRadius: 20, padding: '8px 22px', fontSize: 14, fontWeight: 600,
                 cursor: draft.trim() && draft.length <= MAX ? 'pointer' : 'not-allowed',

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:268:25
                 background: draft.trim() && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',
                 color: draft.trim() && draft.length <= MAX ? '#fff' : 'var(--text-3)',
                 border: 'none', borderRadius: 20, padding: '8px 22px', fontSize: 14, fontWeight: 600,
-                cursor: draft.trim() && draft.length <= MAX ? 'pointer' : 'not-allowed',
+                cursor: draft && draft.length <= MAX ? 'pointer' : 'not-allowed',
               }}>
               Post

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:268:41
                 background: draft.trim() && draft.length <= MAX ? 'var(--blue)' : 'var(--border)',
                 color: draft.trim() && draft.length <= MAX ? '#fff' : 'var(--text-3)',
                 border: 'none', borderRadius: 20, padding: '8px 22px', fontSize: 14, fontWeight: 600,
-                cursor: draft.trim() && draft.length <= MAX ? 'pointer' : 'not-allowed',
+                cursor: draft.trim() && draft.length < MAX ? 'pointer' : 'not-allowed',
               }}>
               Post

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:275:8
           </div>
         </div>
       )}
-      {!expanded && (
+      {expanded && (
         <div className="li-post-creator__actions">
           {[

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:282:17
-          ].map(item => (
-            <button key={item.label} className="li-post-creator__action" onClick={item.action}>
-              {item.icon}
-              <span>{item.label}</span>
-            </button>
-          ))}
+          ].map(() => undefined)}
         </div>
       )}

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:302:21
           {ad.logo}
         </div>
-        <div style={{ flex: 1, minWidth: 0 }}>
+        <div style={{}}>
           <div style={{ fontWeight: 700, fontSize: 14 }}>{ad.company}</div>
           <div style={{ fontSize: 12, color: 'var(--text-2)' }}>Sponsored</div>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:303:23
           {ad.logo}
         </div>
         <div style={{ flex: 1, minWidth: 0 }}>
-          <div style={{ fontWeight: 700, fontSize: 14 }}>{ad.company}</div>
+          <div style={{}}>{ad.company}</div>
           <div style={{ fontSize: 12, color: 'var(--text-2)' }}>Sponsored</div>
         </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:306:54
           <div style={{ fontWeight: 700, fontSize: 14 }}>{ad.company}</div>
           <div style={{ fontSize: 12, color: 'var(--text-2)' }}>Sponsored</div>
         </div>
-        <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', padding: 4 }}
+        <button style={{ background: 'none', border: "", cursor: 'pointer', color: 'var(--text-2)', padding: 4 }}
           onClick={() => showToast('Ad hidden')}>✕</button>
       </div>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:306:24
           <div style={{ fontWeight: 700, fontSize: 14 }}>{ad.company}</div>
           <div style={{ fontSize: 12, color: 'var(--text-2)' }}>Sponsored</div>
         </div>
-        <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', padding: 4 }}
+        <button style={{}}
           onClick={() => showToast('Ad hidden')}>✕</button>
       </div>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:307:20
           <div style={{ fontSize: 12, color: 'var(--text-2)' }}>Sponsored</div>
         </div>
         <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', padding: 4 }}
-          onClick={() => showToast('Ad hidden')}>✕</button>
+          onClick={() => undefined}>✕</button>
       </div>
       <div className="li-post__body">

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:307:36
           <div style={{ fontSize: 12, color: 'var(--text-2)' }}>Sponsored</div>
         </div>
         <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', padding: 4 }}
-          onClick={() => showToast('Ad hidden')}>✕</button>
+          onClick={() => showToast("")}>✕</button>
       </div>
       <div className="li-post__body">

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:312:79
       <div className="li-post__body">
         <p className="li-post__text">{ad.desc}</p>
       </div>
-      <div style={{ height: 140, background: ad.bg, borderRadius: 8, display: 'flex', alignItems: 'center', justifyContent: 'center', margin: '8px 16px 8px', overflow: 'hidden' }}>
+      <div style={{ height: 140, background: ad.bg, borderRadius: 8, display: "", alignItems: 'center', justifyContent: 'center', margin: '8px 16px 8px', overflow: 'hidden' }}>
         <div style={{ textAlign: 'center', color: '#fff', padding: 20 }}>
           <div style={{ fontSize: 18, fontWeight: 800, marginBottom: 4 }}>{ad.tagline}</div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:313:51
         <p className="li-post__text">{ad.desc}</p>
       </div>
       <div style={{ height: 140, background: ad.bg, borderRadius: 8, display: 'flex', alignItems: 'center', justifyContent: 'center', margin: '8px 16px 8px', overflow: 'hidden' }}>
-        <div style={{ textAlign: 'center', color: '#fff', padding: 20 }}>
+        <div style={{ textAlign: 'center', color: "", padding: 20 }}>
           <div style={{ fontSize: 18, fontWeight: 800, marginBottom: 4 }}>{ad.tagline}</div>
           <div style={{ fontSize: 13, opacity: 0.8 }}>{ad.company}</div>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:315:23
       <div style={{ height: 140, background: ad.bg, borderRadius: 8, display: 'flex', alignItems: 'center', justifyContent: 'center', margin: '8px 16px 8px', overflow: 'hidden' }}>
         <div style={{ textAlign: 'center', color: '#fff', padding: 20 }}>
           <div style={{ fontSize: 18, fontWeight: 800, marginBottom: 4 }}>{ad.tagline}</div>
-          <div style={{ fontSize: 13, opacity: 0.8 }}>{ad.company}</div>
+          <div style={{}}>{ad.company}</div>
         </div>
       </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:318:30
           <div style={{ fontSize: 13, opacity: 0.8 }}>{ad.company}</div>
         </div>
       </div>
-      <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', padding: '8px 16px', borderTop: '1px solid var(--border)' }}>
+      <div style={{ display: "", alignItems: 'center', justifyContent: 'space-between', padding: '8px 16px', borderTop: '1px solid var(--border)' }}>
         <div>
           <div style={{ fontSize: 14, fontWeight: 700 }}>{ad.company}</div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:318:76
           <div style={{ fontSize: 13, opacity: 0.8 }}>{ad.company}</div>
         </div>
       </div>
-      <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', padding: '8px 16px', borderTop: '1px solid var(--border)' }}>
+      <div style={{ display: 'flex', alignItems: 'center', justifyContent: "", padding: '8px 16px', borderTop: '1px solid var(--border)' }}>
         <div>
           <div style={{ fontSize: 14, fontWeight: 700 }}>{ad.company}</div>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:320:23
       </div>
       <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', padding: '8px 16px', borderTop: '1px solid var(--border)' }}>
         <div>
-          <div style={{ fontSize: 14, fontWeight: 700 }}>{ad.company}</div>
+          <div style={{}}>{ad.company}</div>
           <div style={{ fontSize: 12, color: 'var(--text-2)' }}>{ad.tagline}</div>
         </div>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:323:26
           <div style={{ fontSize: 14, fontWeight: 700 }}>{ad.company}</div>
           <div style={{ fontSize: 12, color: 'var(--text-2)' }}>{ad.tagline}</div>
         </div>
-        <button onClick={() => showToast(`Opening ${ad.company}...`)}
+        <button onClick={() => undefined}
           style={{ background: 'none', border: '1.5px solid var(--text-2)', color: 'var(--text)', borderRadius: 20, padding: '6px 16px', fontSize: 14, fontWeight: 600, cursor: 'pointer' }}>
           {ad.cta}

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:324:48
           <div style={{ fontSize: 12, color: 'var(--text-2)' }}>{ad.tagline}</div>
         </div>
         <button onClick={() => showToast(`Opening ${ad.company}...`)}
-          style={{ background: 'none', border: '1.5px solid var(--text-2)', color: 'var(--text)', borderRadius: 20, padding: '6px 16px', fontSize: 14, fontWeight: 600, cursor: 'pointer' }}>
+          style={{ background: 'none', border: "", color: 'var(--text)', borderRadius: 20, padding: '6px 16px', fontSize: 14, fontWeight: 600, cursor: 'pointer' }}>
           {ad.cta}
         </button>

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:334:50
 
 /* ── FeedPost ────────────────────────────────────────────── */
 function FeedPost({ post, liked, onLike, commentsOpen, onToggleComments, following, onFollow, openModal, showToast, currentUser, onDelete }) {
-  const [menuOpen, setMenuOpen] = React.useState(false);
+  const [menuOpen, setMenuOpen] = React.useState(true);
   const [reactionHover, setReactionHover] = React.useState(false);
   const [reactionTimer, setReactionTimer] = React.useState(null);

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:335:60
 /* ── FeedPost ────────────────────────────────────────────── */
 function FeedPost({ post, liked, onLike, commentsOpen, onToggleComments, following, onFollow, openModal, showToast, currentUser, onDelete }) {
   const [menuOpen, setMenuOpen] = React.useState(false);
-  const [reactionHover, setReactionHover] = React.useState(false);
+  const [reactionHover, setReactionHover] = React.useState(true);
   const [reactionTimer, setReactionTimer] = React.useState(null);
   const [localReaction, setLocalReaction] = React.useState(null);

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:339:60
   const [reactionTimer, setReactionTimer] = React.useState(null);
   const [localReaction, setLocalReaction] = React.useState(null);
   const [commentDraft, setCommentDraft] = React.useState('');
-  const [localComments, setLocalComments] = React.useState(post.comments || post.commentsList || []);
+  const [localComments, setLocalComments] = React.useState(true);
 
   const authorId = post.authorId || (post.author && post.author.id) || 2;

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:339:60
   const [reactionTimer, setReactionTimer] = React.useState(null);
   const [localReaction, setLocalReaction] = React.useState(null);
   const [commentDraft, setCommentDraft] = React.useState('');
-  const [localComments, setLocalComments] = React.useState(post.comments || post.commentsList || []);
+  const [localComments, setLocalComments] = React.useState((post.comments || post.commentsList) && []);
 
   const authorId = post.authorId || (post.author && post.author.id) || 2;

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:341:38
   const [commentDraft, setCommentDraft] = React.useState('');
   const [localComments, setLocalComments] = React.useState(post.comments || post.commentsList || []);
 
-  const authorId = post.authorId || (post.author && post.author.id) || 2;
+  const authorId = post.authorId || (post.author || post.author.id) || 2;
   const authorName = post.author?.name || post.author || post.authorName || 'User';
   const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:341:38
   const [commentDraft, setCommentDraft] = React.useState('');
   const [localComments, setLocalComments] = React.useState(post.comments || post.commentsList || []);
 
-  const authorId = post.authorId || (post.author && post.author.id) || 2;
+  const authorId = post.authorId || (false) || 2;
   const authorName = post.author?.name || post.author || post.authorName || 'User';
   const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:342:22
   const [localComments, setLocalComments] = React.useState(post.comments || post.commentsList || []);
 
   const authorId = post.authorId || (post.author && post.author.id) || 2;
-  const authorName = post.author?.name || post.author || post.authorName || 'User';
+  const authorName = false;
   const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';
   const authorColor = post.author?.avatarColor || null;

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:342:22
   const [localComments, setLocalComments] = React.useState(post.comments || post.commentsList || []);
 
   const authorId = post.authorId || (post.author && post.author.id) || 2;
-  const authorName = post.author?.name || post.author || post.authorName || 'User';
+  const authorName = false || 'User';
   const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';
   const authorColor = post.author?.avatarColor || null;

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:343:23
 
   const authorId = post.authorId || (post.author && post.author.id) || 2;
   const authorName = post.author?.name || post.author || post.authorName || 'User';
-  const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';
+  const authorTitle = true;
   const authorColor = post.author?.avatarColor || null;
 

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:343:23
 
   const authorId = post.authorId || (post.author && post.author.id) || 2;
   const authorName = post.author?.name || post.author || post.authorName || 'User';
-  const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';
+  const authorTitle = post.author?.headline && post.authorTitle || post.authorHeadline || '';
   const authorColor = post.author?.avatarColor || null;
 

[NoCoverage] OptionalChaining
js/components/pages/FeedPage.js:344:23
   const authorId = post.authorId || (post.author && post.author.id) || 2;
   const authorName = post.author?.name || post.author || post.authorName || 'User';
   const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';
-  const authorColor = post.author?.avatarColor || null;
+  const authorColor = post.author.avatarColor || null;
 
   const totalReactions = post.likeCount || post.totalReactions ||

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:344:23
   const authorId = post.authorId || (post.author && post.author.id) || 2;
   const authorName = post.author?.name || post.author || post.authorName || 'User';
   const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';
-  const authorColor = post.author?.avatarColor || null;
+  const authorColor = post.author?.avatarColor && null;
 
   const totalReactions = post.likeCount || post.totalReactions ||

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:346:26
   const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';
   const authorColor = post.author?.avatarColor || null;
 
-  const totalReactions = post.likeCount || post.totalReactions ||
-    (post.reactions ? Object.values(post.reactions).reduce((a, b) => a + b, 0) : 0);
+  const totalReactions = false;
   const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));
   const repostCount = post.repostCount || post.reposts || 0;

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:346:26
   const authorTitle = post.author?.headline || post.authorTitle || post.authorHeadline || '';
   const authorColor = post.author?.avatarColor || null;
 
-  const totalReactions = post.likeCount || post.totalReactions ||
+  const totalReactions = false ||
     (post.reactions ? Object.values(post.reactions).reduce((a, b) => a + b, 0) : 0);
   const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));

[NoCoverage] ArithmeticOperator
js/components/pages/FeedPage.js:347:70
   const authorColor = post.author?.avatarColor || null;
 
   const totalReactions = post.likeCount || post.totalReactions ||
-    (post.reactions ? Object.values(post.reactions).reduce((a, b) => a + b, 0) : 0);
+    (post.reactions ? Object.values(post.reactions).reduce((a, b) => a - b, 0) : 0);
   const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));
   const repostCount = post.repostCount || post.reposts || 0;

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:347:60
   const authorColor = post.author?.avatarColor || null;
 
   const totalReactions = post.likeCount || post.totalReactions ||
-    (post.reactions ? Object.values(post.reactions).reduce((a, b) => a + b, 0) : 0);
+    (post.reactions ? Object.values(post.reactions).reduce(() => undefined, 0) : 0);
   const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));
   const repostCount = post.repostCount || post.reposts || 0;

[NoCoverage] OptionalChaining
js/components/pages/FeedPage.js:348:99
 
   const totalReactions = post.likeCount || post.totalReactions ||
     (post.reactions ? Object.values(post.reactions).reduce((a, b) => a + b, 0) : 0);
-  const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));
+  const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList.length || 0));
   const repostCount = post.repostCount || post.reposts || 0;
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:348:24
 
   const totalReactions = post.likeCount || post.totalReactions ||
     (post.reactions ? Object.values(post.reactions).reduce((a, b) => a + b, 0) : 0);
-  const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));
+  const commentCount = true;
   const repostCount = post.repostCount || post.reposts || 0;
 

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:349:23
   const totalReactions = post.likeCount || post.totalReactions ||
     (post.reactions ? Object.values(post.reactions).reduce((a, b) => a + b, 0) : 0);
   const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));
-  const repostCount = post.repostCount || post.reposts || 0;
+  const repostCount = (post.repostCount || post.reposts) && 0;
 
   const reactionLabels = { like: 'Like', celebrate: 'Celebrate', love: 'Love', support: 'Support', insightful: 'Insightful', curious: 'Curious', funny: 'Funny' };

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:349:23
   const totalReactions = post.likeCount || post.totalReactions ||
     (post.reactions ? Object.values(post.reactions).reduce((a, b) => a + b, 0) : 0);
   const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));
-  const repostCount = post.repostCount || post.reposts || 0;
+  const repostCount = false;
 
   const reactionLabels = { like: 'Like', celebrate: 'Celebrate', love: 'Love', support: 'Support', insightful: 'Insightful', curious: 'Curious', funny: 'Funny' };

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:351:135
   const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));
   const repostCount = post.repostCount || post.reposts || 0;
 
-  const reactionLabels = { like: 'Like', celebrate: 'Celebrate', love: 'Love', support: 'Support', insightful: 'Insightful', curious: 'Curious', funny: 'Funny' };
+  const reactionLabels = { like: 'Like', celebrate: 'Celebrate', love: 'Love', support: 'Support', insightful: 'Insightful', curious: "", funny: 'Funny' };
   const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝', insightful: '💡', curious: '🤔', funny: '😄' };
   const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:351:26
   const commentCount = post.commentCount || (typeof post.comments === 'number' ? post.comments : (post.commentsList?.length || 0));
   const repostCount = post.repostCount || post.reposts || 0;
 
-  const reactionLabels = { like: 'Like', celebrate: 'Celebrate', love: 'Love', support: 'Support', insightful: 'Insightful', curious: 'Curious', funny: 'Funny' };
+  const reactionLabels = {};
   const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝', insightful: '💡', curious: '🤔', funny: '😄' };
   const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:352:80
   const repostCount = post.repostCount || post.reposts || 0;
 
   const reactionLabels = { like: 'Like', celebrate: 'Celebrate', love: 'Love', support: 'Support', insightful: 'Insightful', curious: 'Curious', funny: 'Funny' };
-  const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝', insightful: '💡', curious: '🤔', funny: '😄' };
+  const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝""nsightful: '💡', curious: '🤔', funny: '😄' };
   const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
 

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:352:126
   const repostCount = post.repostCount || post.reposts || 0;
 
   const reactionLabels = { like: 'Like', celebrate: 'Celebrate', love: 'Love', support: 'Support', insightful: 'Insightful', curious: 'Curious', funny: 'Funny' };
-  const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝', insightful: '💡', curious: '🤔', funny: '😄' };
+  const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝', insightful: '💡', curious: '🤔', funny: '😄' }""
   const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
 

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:353:43
 
   const reactionLabels = { like: 'Like', celebrate: 'Celebrate', love: 'Love', support: 'Support', insightful: 'Insightful', curious: 'Curious', funny: 'Funny' };
   const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝', insightful: '💡', curious: '🤔', funny: '😄' };
-  const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
+  const topReactLabels = post.reactions ? Object.entries(post.reactions).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
 
   const reactionLabel = localReaction || (liked ? 'Liked' : 'Like');
