[NoCoverage] ArithmeticOperator
js/components/pages/FeedPage.js:353:89
 
   const reactionLabels = { like: 'Like', celebrate: 'Celebrate', love: 'Love', support: 'Support', insightful: 'Insightful', curious: 'Curious', funny: 'Funny' };
   const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝', insightful: '💡', curious: '🤔', funny: '😄' };
-  const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
+  const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] + a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
 
   const reactionLabel = localReaction || (liked ? 'Liked' : 'Like');

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:355:25
   const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝', insightful: '💡', curious: '🤔', funny: '😄' };
   const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
 
-  const reactionLabel = localReaction || (liked ? 'Liked' : 'Like');
+  const reactionLabel = true;
   const isFollowingAuthor = following && following.has(String(authorId));
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:355:25
   const reactionEmojiMap = { like: '👍', celebrate: '🎉', love: '❤️', support: '🤝', insightful: '💡', curious: '🤔', funny: '😄' };
   const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
 
-  const reactionLabel = localReaction || (liked ? 'Liked' : 'Like');
+  const reactionLabel = false;
   const isFollowingAuthor = following && following.has(String(authorId));
 

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:356:29
   const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
 
   const reactionLabel = localReaction || (liked ? 'Liked' : 'Like');
-  const isFollowingAuthor = following && following.has(String(authorId));
+  const isFollowingAuthor = true;
 
   const reactions = [

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:356:29
   const topReactLabels = post.reactions ? Object.entries(post.reactions).sort((a, b) => b[1] - a[1]).slice(0, 3).map(([k]) => reactionEmojiMap[k] || '👍') : [];
 
   const reactionLabel = localReaction || (liked ? 'Liked' : 'Like');
-  const isFollowingAuthor = following && following.has(String(authorId));
+  const isFollowingAuthor = following || following.has(String(authorId));
 
   const reactions = [

[NoCoverage] ArrayDeclaration
js/components/pages/FeedPage.js:358:21
   const reactionLabel = localReaction || (liked ? 'Liked' : 'Like');
   const isFollowingAuthor = following && following.has(String(authorId));
 
-  const reactions = [
-    { emoji: '👍', name: 'Like', color: '#0F5DBD' },
-    { emoji: '❤️', name: 'Love', color: '#CC1016' },
-    { emoji: '🎉', name: 'Celebrate', color: '#E7A500' },
-    { emoji: '💡', name: 'Insightful', color: '#5F9B41' },
-    { emoji: '🤔', name: 'Curious', color: '#E06847' },
-    { emoji: '😄', name: 'Funny', color: '#E7A500' },
-  ];
+  const reactions = [];
 
   function handleLikeHover() {

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:359:14
   const isFollowingAuthor = following && following.has(String(authorId));
 
   const reactions = [
-    { emoji: '👍', name: 'Like', color: '#0F5DBD' },
+    { emoji: "" name: 'Like', color: '#0F5DBD' },
     { emoji: '❤️', name: 'Love', color: '#CC1016' },
     { emoji: '🎉', name: 'Celebrate', color: '#E7A500' },

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:360:41
 
   const reactions = [
     { emoji: '👍', name: 'Like', color: '#0F5DBD' },
-    { emoji: '❤️', name: 'Love', color: '#CC1016' },
+    { emoji: '❤️', name: 'Love', color: "" },
     { emoji: '🎉', name: 'Celebrate', color: '#E7A500' },
     { emoji: '💡', name: 'Insightful', color: '#5F9B41' },

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:361:26
   const reactions = [
     { emoji: '👍', name: 'Like', color: '#0F5DBD' },
     { emoji: '❤️', name: 'Love', color: '#CC1016' },
-    { emoji: '🎉', name: 'Celebrate', color: '#E7A500' },
+    { emoji: '🎉', name: '"" color: '#E7A500' },
     { emoji: '💡', name: 'Insightful', color: '#5F9B41' },
     { emoji: '🤔', name: 'Curious', color: '#E06847' },

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:361:46
   const reactions = [
     { emoji: '👍', name: 'Like', color: '#0F5DBD' },
     { emoji: '❤️', name: 'Love', color: '#CC1016' },
-    { emoji: '🎉', name: 'Celebrate', color: '#E7A500' },
+    { emoji: '🎉', name: 'Celebrate', color: '""},
     { emoji: '💡', name: 'Insightful', color: '#5F9B41' },
     { emoji: '🤔', name: 'Curious', color: '#E06847' },

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:362:47
     { emoji: '👍', name: 'Like', color: '#0F5DBD' },
     { emoji: '❤️', name: 'Love', color: '#CC1016' },
     { emoji: '🎉', name: 'Celebrate', color: '#E7A500' },
-    { emoji: '💡', name: 'Insightful', color: '#5F9B41' },
+    { emoji: '💡', name: 'Insightful', color: '""},
     { emoji: '🤔', name: 'Curious', color: '#E06847' },
     { emoji: '😄', name: 'Funny', color: '#E7A500' },

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:362:5
     { emoji: '👍', name: 'Like', color: '#0F5DBD' },
     { emoji: '❤️', name: 'Love', color: '#CC1016' },
     { emoji: '🎉', name: 'Celebrate', color: '#E7A500' },
-    { emoji: '💡', name: 'Insightful', color: '#5F9B41' },
+    {}
     { emoji: '🤔', name: 'Curious', color: '#E06847' },
     { emoji: '😄', name: 'Funny', color: '#E7A500' },

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:363:14
     { emoji: '❤️', name: 'Love', color: '#CC1016' },
     { emoji: '🎉', name: 'Celebrate', color: '#E7A500' },
     { emoji: '💡', name: 'Insightful', color: '#5F9B41' },
-    { emoji: '🤔', name: 'Curious', color: '#E06847' },
+    { emoji: "" name: 'Curious', color: '#E06847' },
     { emoji: '😄', name: 'Funny', color: '#E7A500' },
   ];

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:363:26
     { emoji: '❤️', name: 'Love', color: '#CC1016' },
     { emoji: '🎉', name: 'Celebrate', color: '#E7A500' },
     { emoji: '💡', name: 'Insightful', color: '#5F9B41' },
-    { emoji: '🤔', name: 'Curious', color: '#E06847' },
+    { emoji: '🤔', name: '"" color: '#E06847' },
     { emoji: '😄', name: 'Funny', color: '#E7A500' },
   ];

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:367:30
     { emoji: '😄', name: 'Funny', color: '#E7A500' },
   ];
 
-  function handleLikeHover() {
-    const t = setTimeout(() => setReactionHover(true), 500);
-    setReactionTimer(t);
-  }
+  function handleLikeHover() {}
   function handleLikeLeave() {
     if (reactionTimer) clearTimeout(reactionTimer);

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:368:26
   ];
 
   function handleLikeHover() {
-    const t = setTimeout(() => setReactionHover(true), 500);
+    const t = setTimeout(() => undefined, 500);
     setReactionTimer(t);
   }

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:368:49
   ];
 
   function handleLikeHover() {
-    const t = setTimeout(() => setReactionHover(true), 500);
+    const t = setTimeout(() => setReactionHover(false), 500);
     setReactionTimer(t);
   }

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:371:30
     const t = setTimeout(() => setReactionHover(true), 500);
     setReactionTimer(t);
   }
-  function handleLikeLeave() {
-    if (reactionTimer) clearTimeout(reactionTimer);
-    setTimeout(() => setReactionHover(false), 300);
-  }
+  function handleLikeLeave() {}
   function selectReaction(r) {
     setLocalReaction(r.name);

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:372:9
     setReactionTimer(t);
   }
   function handleLikeLeave() {
-    if (reactionTimer) clearTimeout(reactionTimer);
+    if (false) clearTimeout(reactionTimer);
     setTimeout(() => setReactionHover(false), 300);
   }

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:372:9
     setReactionTimer(t);
   }
   function handleLikeLeave() {
-    if (reactionTimer) clearTimeout(reactionTimer);
+    if (true) clearTimeout(reactionTimer);
     setTimeout(() => setReactionHover(false), 300);
   }

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:373:39
   }
   function handleLikeLeave() {
     if (reactionTimer) clearTimeout(reactionTimer);
-    setTimeout(() => setReactionHover(false), 300);
+    setTimeout(() => setReactionHover(true), 300);
   }
   function selectReaction(r) {

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:373:16
   }
   function handleLikeLeave() {
     if (reactionTimer) clearTimeout(reactionTimer);
-    setTimeout(() => setReactionHover(false), 300);
+    setTimeout(() => undefined, 300);
   }
   function selectReaction(r) {

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:375:30
     if (reactionTimer) clearTimeout(reactionTimer);
     setTimeout(() => setReactionHover(false), 300);
   }
-  function selectReaction(r) {
-    setLocalReaction(r.name);
-    setReactionHover(false);
-    onLike();
-    showToast(`Reacted with ${r.name}!`, 'success');
-  }
+  function selectReaction(r) {}
   function postComment() {
     if (!commentDraft.trim()) return;

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:377:22
   }
   function selectReaction(r) {
     setLocalReaction(r.name);
-    setReactionHover(false);
+    setReactionHover(true);
     onLike();
     showToast(`Reacted with ${r.name}!`, 'success');

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:379:15
     setLocalReaction(r.name);
     setReactionHover(false);
     onLike();
-    showToast(`Reacted with ${r.name}!`, 'success');
+    showToast(``, 'success');
   }
   function postComment() {

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:381:26
     onLike();
     showToast(`Reacted with ${r.name}!`, 'success');
   }
-  function postComment() {
-    if (!commentDraft.trim()) return;
-    const u = currentUser || {};
-    setLocalComments(prev => [{
-      author: u.name || 'You',
-      authorHeadline: u.headline,
-      text: commentDraft.trim(),
-      timestamp: 'Just now',
-      likes: 0,
-    }, ...prev]);
-    setCommentDraft('');
-    showToast('Comment posted!');
-  }
+  function postComment() {}
 
   const content = post.content || '';

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:382:9
     showToast(`Reacted with ${r.name}!`, 'success');
   }
   function postComment() {
-    if (!commentDraft.trim()) return;
+    if (true) return;
     const u = currentUser || {};
     setLocalComments(prev => [{

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:382:9
     showToast(`Reacted with ${r.name}!`, 'success');
   }
   function postComment() {
-    if (!commentDraft.trim()) return;
+    if (false) return;
     const u = currentUser || {};
     setLocalComments(prev => [{

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:383:15
   }
   function postComment() {
     if (!commentDraft.trim()) return;
-    const u = currentUser || {};
+    const u = currentUser && {};
     setLocalComments(prev => [{
       author: u.name || 'You',

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:383:15
   }
   function postComment() {
     if (!commentDraft.trim()) return;
-    const u = currentUser || {};
+    const u = true;
     setLocalComments(prev => [{
       author: u.name || 'You',

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:384:22
   function postComment() {
     if (!commentDraft.trim()) return;
     const u = currentUser || {};
-    setLocalComments(prev => [{
-      author: u.name || 'You',
-      authorHeadline: u.headline,
-      text: commentDraft.trim(),
-      timestamp: 'Just now',
-      likes: 0,
-    }, ...prev]);
+    setLocalComments(() => undefined);
     setCommentDraft('');
     showToast('Comment posted!');

[NoCoverage] ArrayDeclaration
js/components/pages/FeedPage.js:384:30
   function postComment() {
     if (!commentDraft.trim()) return;
     const u = currentUser || {};
-    setLocalComments(prev => [{
-      author: u.name || 'You',
-      authorHeadline: u.headline,
-      text: commentDraft.trim(),
-      timestamp: 'Just now',
-      likes: 0,
-    }, ...prev]);
+    setLocalComments(prev => []);
     setCommentDraft('');
     showToast('Comment posted!');

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:385:15
     if (!commentDraft.trim()) return;
     const u = currentUser || {};
     setLocalComments(prev => [{
-      author: u.name || 'You',
+      author: u.name && 'You',
       authorHeadline: u.headline,
       text: commentDraft.trim(),

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:385:15
     if (!commentDraft.trim()) return;
     const u = currentUser || {};
     setLocalComments(prev => [{
-      author: u.name || 'You',
+      author: false,
       authorHeadline: u.headline,
       text: commentDraft.trim(),

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:387:13
     setLocalComments(prev => [{
       author: u.name || 'You',
       authorHeadline: u.headline,
-      text: commentDraft.trim(),
+      text: commentDraft,
       timestamp: 'Just now',
       likes: 0,

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:395:19
     showToast('Comment posted!');
   }
 
-  const content = post.content || '';
+  const content = false;
 
   return (

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:395:19
     showToast('Comment posted!');
   }
 
-  const content = post.content || '';
+  const content = post.content && '';
 
   return (

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:401:32
     <div className="li-post">
       {/* Header */}
       <div className="li-post__header">
-        <div style={{ display: 'flex', gap: 10, alignItems: 'flex-start', flex: 1 }}>
+        <div style={{ display: "", gap: 10, alignItems: 'flex-start', flex: 1 }}>
           <div className="li-post__author-photo" style={{ background: authorColor || 'var(--blue)', cursor: 'pointer' }}
             onClick={() => navigate(`profile?id=${authorId}`)}>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:401:21
     <div className="li-post">
       {/* Header */}
       <div className="li-post__header">
-        <div style={{ display: 'flex', gap: 10, alignItems: 'flex-start', flex: 1 }}>
+        <div style={{}}>
           <div className="li-post__author-photo" style={{ background: authorColor || 'var(--blue)', cursor: 'pointer' }}
             onClick={() => navigate(`profile?id=${authorId}`)}>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:402:71
       {/* Header */}
       <div className="li-post__header">
         <div style={{ display: 'flex', gap: 10, alignItems: 'flex-start', flex: 1 }}>
-          <div className="li-post__author-photo" style={{ background: authorColor || 'var(--blue)', cursor: 'pointer' }}
+          <div className="li-post__author-photo" style={{ background: false, cursor: 'pointer' }}
             onClick={() => navigate(`profile?id=${authorId}`)}>
             {getInitials(authorName)}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:402:71
       {/* Header */}
       <div className="li-post__header">
         <div style={{ display: 'flex', gap: 10, alignItems: 'flex-start', flex: 1 }}>
-          <div className="li-post__author-photo" style={{ background: authorColor || 'var(--blue)', cursor: 'pointer' }}
+          <div className="li-post__author-photo" style={{ background: true, cursor: 'pointer' }}
             onClick={() => navigate(`profile?id=${authorId}`)}>
             {getInitials(authorName)}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:403:22
       <div className="li-post__header">
         <div style={{ display: 'flex', gap: 10, alignItems: 'flex-start', flex: 1 }}>
           <div className="li-post__author-photo" style={{ background: authorColor || 'var(--blue)', cursor: 'pointer' }}
-            onClick={() => navigate(`profile?id=${authorId}`)}>
+            onClick={() => undefined}>
             {getInitials(authorName)}
           </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:403:37
       <div className="li-post__header">
         <div style={{ display: 'flex', gap: 10, alignItems: 'flex-start', flex: 1 }}>
           <div className="li-post__author-photo" style={{ background: authorColor || 'var(--blue)', cursor: 'pointer' }}
-            onClick={() => navigate(`profile?id=${authorId}`)}>
+            onClick={() => navigate(``)}>
             {getInitials(authorName)}
           </div>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:407:60
             {getInitials(authorName)}
           </div>
           <div className="li-post__author-info">
-            <div className="li-post__author-name" onClick={() => navigate(`profile?id=${authorId}`)}>
+            <div className="li-post__author-name" onClick={() => undefined}>
               {authorName}
               <span style={{ fontSize: 12, color: 'var(--text-2)', fontWeight: 400 }}>· 2nd</span>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:409:51
           <div className="li-post__author-info">
             <div className="li-post__author-name" onClick={() => navigate(`profile?id=${authorId}`)}>
               {authorName}
-              <span style={{ fontSize: 12, color: 'var(--text-2)', fontWeight: 400 }}>· 2nd</span>
+              <span style={{ fontSize: 12, color: "", fontWeight: 400 }}>· 2nd</span>
             </div>
             {authorTitle && <div className="li-post__author-headline">{authorTitle}</div>}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:411:14
               {authorName}
               <span style={{ fontSize: 12, color: 'var(--text-2)', fontWeight: 400 }}>· 2nd</span>
             </div>
-            {authorTitle && <div className="li-post__author-headline">{authorTitle}</div>}
+            {false}
             <div className="li-post__meta">
               <span className="li-post__timestamp">{formatTime(post.createdAt || post.timestamp)}</span>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:411:14
               {authorName}
               <span style={{ fontSize: 12, color: 'var(--text-2)', fontWeight: 400 }}>· 2nd</span>
             </div>
-            {authorTitle && <div className="li-post__author-headline">{authorTitle}</div>}
+            {true}
             <div className="li-post__meta">
               <span className="li-post__timestamp">{formatTime(post.createdAt || post.timestamp)}</span>

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:413:64
             </div>
             {authorTitle && <div className="li-post__author-headline">{authorTitle}</div>}
             <div className="li-post__meta">
-              <span className="li-post__timestamp">{formatTime(post.createdAt || post.timestamp)}</span>
+              <span className="li-post__timestamp">{formatTime(post.createdAt && post.timestamp)}</span>
               <span className="li-post__privacy">·</span>
               <svg viewBox="0 0 16 16" width="12" height="12" fill="currentColor" className="li-post__privacy">

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:413:64
             </div>
             {authorTitle && <div className="li-post__author-headline">{authorTitle}</div>}
             <div className="li-post__meta">
-              <span className="li-post__timestamp">{formatTime(post.createdAt || post.timestamp)}</span>
+              <span className="li-post__timestamp">{formatTime(true)}</span>
               <span className="li-post__privacy">·</span>
               <svg viewBox="0 0 16 16" width="12" height="12" fill="currentColor" className="li-post__privacy">

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:421:21
             </div>
           </div>
         </div>
-        <div style={{ display: 'flex', gap: 6, alignItems: 'center', flexShrink: 0 }}>
+        <div style={{}}>
           {!isFollowingAuthor && (
             <button

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:422:12
           </div>
         </div>
         <div style={{ display: 'flex', gap: 6, alignItems: 'center', flexShrink: 0 }}>
-          {!isFollowingAuthor && (
+          {isFollowingAuthor && (
             <button
               onClick={() => { onFollow(authorId); showToast(`Following ${authorName}`); }}

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:424:30
         <div style={{ display: 'flex', gap: 6, alignItems: 'center', flexShrink: 0 }}>
           {!isFollowingAuthor && (
             <button
-              onClick={() => { onFollow(authorId); showToast(`Following ${authorName}`); }}
+              onClick={() => {}}
               + Follow

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:429:23
               + Follow
             </button>
           )}
-          <div style={{ position: 'relative' }}>
+          <div style={{}}>
             <button className="li-post__options" onClick={() => setMenuOpen(v => !v)}>
               <svg viewBox="0 0 24 24" width="20" height="20" fill="currentColor">

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:430:77
             </button>
           )}
           <div style={{ position: 'relative' }}>
-            <button className="li-post__options" onClick={() => setMenuOpen(v => !v)}>
+            <button className="li-post__options" onClick={() => setMenuOpen(() => undefined)}>
               <svg viewBox="0 0 24 24" width="20" height="20" fill="currentColor">
                 <circle cx="5" cy="12" r="2"/><circle cx="12" cy="12" r="2"/><circle cx="19" cy="12" r="2"/>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:430:59
             </button>
           )}
           <div style={{ position: 'relative' }}>
-            <button className="li-post__options" onClick={() => setMenuOpen(v => !v)}>
+            <button className="li-post__options" onClick={() => undefined}>
               <svg viewBox="0 0 24 24" width="20" height="20" fill="currentColor">
                 <circle cx="5" cy="12" r="2"/><circle cx="12" cy="12" r="2"/><circle cx="19" cy="12" r="2"/>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:435:14
                 <circle cx="5" cy="12" r="2"/><circle cx="12" cy="12" r="2"/><circle cx="19" cy="12" r="2"/>
               </svg>
             </button>
-            {menuOpen && (
-              <div className="li-dropdown" style={{ display: 'block', position: 'absolute', top: '100%', right: 0, minWidth: 200, zIndex: 100 }}>
-                {[
-                  ...(currentUser && (post.authorId === currentUser.id || post.authorId === String(currentUser.id)) ? ['Delete post'] : []),
-                  'Save post', 'Copy link to post', 'Not interested', 'Report post'
-                ].map(label => (
-                  <div key={label} className="li-dropdown__item"
-                    style={label === 'Delete post' ? { color: 'var(--red)' } : {}}
-                    onClick={() => {
-                      setMenuOpen(false);
-                      if (label === 'Delete post') { onDelete && onDelete(post.id); showToast('Post deleted'); }
-                      else if (label === 'Report post') openModal('report', { post });
-                      else showToast(label);
-                    }}>
-                    {label}
-                  </div>
-                ))}
-              </div>
-            )}
+            {true}
           </div>
         </div>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:435:14
                 <circle cx="5" cy="12" r="2"/><circle cx="12" cy="12" r="2"/><circle cx="19" cy="12" r="2"/>
               </svg>
             </button>
-            {menuOpen && (
-              <div className="li-dropdown" style={{ display: 'block', position: 'absolute', top: '100%', right: 0, minWidth: 200, zIndex: 100 }}>
-                {[
-                  ...(currentUser && (post.authorId === currentUser.id || post.authorId === String(currentUser.id)) ? ['Delete post'] : []),
-                  'Save post', 'Copy link to post', 'Not interested', 'Report post'
-                ].map(label => (
-                  <div key={label} className="li-dropdown__item"
-                    style={label === 'Delete post' ? { color: 'var(--red)' } : {}}
-                    onClick={() => {
-                      setMenuOpen(false);
-                      if (label === 'Delete post') { onDelete && onDelete(post.id); showToast('Post deleted'); }
-                      else if (label === 'Report post') openModal('report', { post });
-                      else showToast(label);
-                    }}>
-                    {label}
-                  </div>
-                ))}
-              </div>
-            )}
+            {false}
           </div>
         </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:436:98
               </svg>
             </button>
             {menuOpen && (
-              <div className="li-dropdown" style={{ display: 'block', position: 'absolute', top: '100%', right: 0, minWidth: 200, zIndex: 100 }}>
+              <div className="li-dropdown" style={{ display: 'block', position: 'absolute', top: "", right: 0, minWidth: 200, zIndex: 100 }}>
                 {[
                   ...(currentUser && (post.authorId === currentUser.id || post.authorId === String(currentUser.id)) ? ['Delete post'] : []),

[NoCoverage] ArrayDeclaration
js/components/pages/FeedPage.js:437:18
             </button>
             {menuOpen && (
               <div className="li-dropdown" style={{ display: 'block', position: 'absolute', top: '100%', right: 0, minWidth: 200, zIndex: 100 }}>
-                {[
-                  ...(currentUser && (post.authorId === currentUser.id || post.authorId === String(currentUser.id)) ? ['Delete post'] : []),
-                  'Save post', 'Copy link to post', 'Not interested', 'Report post'
-                ].map(label => (
+                {[].map(label => (
                   <div key={label} className="li-dropdown__item"
                     style={label === 'Delete post' ? { color: 'var(--red)' } : {}}

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:438:75
             {menuOpen && (
               <div className="li-dropdown" style={{ display: 'block', position: 'absolute', top: '100%', right: 0, minWidth: 200, zIndex: 100 }}>
                 {[
-                  ...(currentUser && (post.authorId === currentUser.id || post.authorId === String(currentUser.id)) ? ['Delete post'] : []),
+                  ...(currentUser && (post.authorId === currentUser.id || post.authorId !== String(currentUser.id)) ? ['Delete post'] : []),
                   'Save post', 'Copy link to post', 'Not interested', 'Report post'
                 ].map(label => (

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:438:23
             {menuOpen && (
               <div className="li-dropdown" style={{ display: 'block', position: 'absolute', top: '100%', right: 0, minWidth: 200, zIndex: 100 }}>
                 {[
-                  ...(currentUser && (post.authorId === currentUser.id || post.authorId === String(currentUser.id)) ? ['Delete post'] : []),
+                  ...(currentUser || post.authorId === currentUser.id || post.authorId === String(currentUser.id) ? ['Delete post'] : []),
                   'Save post', 'Copy link to post', 'Not interested', 'Report post'
                 ].map(label => (

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:439:32
               <div className="li-dropdown" style={{ display: 'block', position: 'absolute', top: '100%', right: 0, minWidth: 200, zIndex: 100 }}>
                 {[
                   ...(currentUser && (post.authorId === currentUser.id || post.authorId === String(currentUser.id)) ? ['Delete post'] : []),
-                  'Save post', 'Copy link to post', 'Not interested', 'Report post'
+                  'Save post', "", 'Not interested', 'Report post'
                 ].map(label => (
                   <div key={label} className="li-dropdown__item"

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:440:23
                 {[
                   ...(currentUser && (post.authorId === currentUser.id || post.authorId === String(currentUser.id)) ? ['Delete post'] : []),
                   'Save post', 'Copy link to post', 'Not interested', 'Report post'
-                ].map(label => (
-                  <div key={label} className="li-dropdown__item"
-                    style={label === 'Delete post' ? { color: 'var(--red)' } : {}}
-                    onClick={() => {
-                      setMenuOpen(false);
-                      if (label === 'Delete post') { onDelete && onDelete(post.id); showToast('Post deleted'); }
-                      else if (label === 'Report post') openModal('report', { post });
-                      else showToast(label);
-                    }}>
-                    {label}
-                  </div>
-                ))}
+                ].map(() => undefined)}
               </div>
             )}
