[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:442:28
                   'Save post', 'Copy link to post', 'Not interested', 'Report post'
                 ].map(label => (
                   <div key={label} className="li-dropdown__item"
-                    style={label === 'Delete post' ? { color: 'var(--red)' } : {}}
+                    style={true ? { color: 'var(--red)' } : {}}
                     onClick={() => {
                       setMenuOpen(false);

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:442:28
                   'Save post', 'Copy link to post', 'Not interested', 'Report post'
                 ].map(label => (
                   <div key={label} className="li-dropdown__item"
-                    style={label === 'Delete post' ? { color: 'var(--red)' } : {}}
+                    style={false ? { color: 'var(--red)' } : {}}
                     onClick={() => {
                       setMenuOpen(false);

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:443:36
                 ].map(label => (
                   <div key={label} className="li-dropdown__item"
                     style={label === 'Delete post' ? { color: 'var(--red)' } : {}}
-                    onClick={() => {
-                      setMenuOpen(false);
-                      if (label === 'Delete post') { onDelete && onDelete(post.id); showToast('Post deleted'); }
-                      else if (label === 'Report post') openModal('report', { post });
-                      else showToast(label);
-                    }}>
+                    onClick={() => {}}>
                     {label}
                   </div>

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:444:35
                   <div key={label} className="li-dropdown__item"
                     style={label === 'Delete post' ? { color: 'var(--red)' } : {}}
                     onClick={() => {
-                      setMenuOpen(false);
+                      setMenuOpen(true);
                       if (label === 'Delete post') { onDelete && onDelete(post.id); showToast('Post deleted'); }
                       else if (label === 'Report post') openModal('report', { post });

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:445:54
                     style={label === 'Delete post' ? { color: 'var(--red)' } : {}}
                     onClick={() => {
                       setMenuOpen(false);
-                      if (label === 'Delete post') { onDelete && onDelete(post.id); showToast('Post deleted'); }
+                      if (label === 'Delete post') { true; showToast('Post deleted'); }
                       else if (label === 'Report post') openModal('report', { post });
                       else showToast(label);

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:445:27
                     style={label === 'Delete post' ? { color: 'var(--red)' } : {}}
                     onClick={() => {
                       setMenuOpen(false);
-                      if (label === 'Delete post') { onDelete && onDelete(post.id); showToast('Post deleted'); }
+                      if (true) { onDelete && onDelete(post.id); showToast('Post deleted'); }
                       else if (label === 'Report post') openModal('report', { post });
                       else showToast(label);

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:446:32
                     onClick={() => {
                       setMenuOpen(false);
                       if (label === 'Delete post') { onDelete && onDelete(post.id); showToast('Post deleted'); }
-                      else if (label === 'Report post') openModal('report', { post });
+                      else if (false) openModal('report', { post });
                       else showToast(label);
                     }}>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:446:32
                     onClick={() => {
                       setMenuOpen(false);
                       if (label === 'Delete post') { onDelete && onDelete(post.id); showToast('Post deleted'); }
-                      else if (label === 'Report post') openModal('report', { post });
+                      else if (true) openModal('report', { post });
                       else showToast(label);
                     }}>

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:461:12
       {/* Body */}
       <div className="li-post__body">
         <p className="li-post__text">
-          {content.length > 280 ? <TruncatedText text={content} limit={280} /> : content}
+          {content.length >= 280 ? <TruncatedText text={content} limit={280} /> : content}
         </p>
         {(post.tags || []).length > 0 && (

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:461:12
       {/* Body */}
       <div className="li-post__body">
         <p className="li-post__text">
-          {content.length > 280 ? <TruncatedText text={content} limit={280} /> : content}
+          {content.length <= 280 ? <TruncatedText text={content} limit={280} /> : content}
         </p>
         {(post.tags || []).length > 0 && (

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:463:10
         <p className="li-post__text">
           {content.length > 280 ? <TruncatedText text={content} limit={280} /> : content}
         </p>
-        {(post.tags || []).length > 0 && (
-          <div style={{ display: 'flex', gap: 6, flexWrap: 'wrap', marginTop: 6 }}>
-            {post.tags.slice(0, 3).map(t => (
-              <span key={t} style={{ fontSize: 13, color: 'var(--blue)', cursor: 'pointer' }}
-                onClick={() => navigate(`search?q=${encodeURIComponent('#' + t)}`)}>
-                #{t}
-              </span>
-            ))}
-          </div>
-        )}
+        {true}
       </div>
       {post.image && (

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:463:10
         <p className="li-post__text">
           {content.length > 280 ? <TruncatedText text={content} limit={280} /> : content}
         </p>
-        {(post.tags || []).length > 0 && (
+        {true && (
           <div style={{ display: 'flex', gap: 6, flexWrap: 'wrap', marginTop: 6 }}>
             {post.tags.slice(0, 3).map(t => (

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:464:23
           {content.length > 280 ? <TruncatedText text={content} limit={280} /> : content}
         </p>
         {(post.tags || []).length > 0 && (
-          <div style={{ display: 'flex', gap: 6, flexWrap: 'wrap', marginTop: 6 }}>
+          <div style={{}}>
             {post.tags.slice(0, 3).map(t => (
               <span key={t} style={{ fontSize: 13, color: 'var(--blue)', cursor: 'pointer' }}

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:464:60
           {content.length > 280 ? <TruncatedText text={content} limit={280} /> : content}
         </p>
         {(post.tags || []).length > 0 && (
-          <div style={{ display: 'flex', gap: 6, flexWrap: 'wrap', marginTop: 6 }}>
+          <div style={{ display: 'flex', gap: 6, flexWrap: "", marginTop: 6 }}>
             {post.tags.slice(0, 3).map(t => (
               <span key={t} style={{ fontSize: 13, color: 'var(--blue)', cursor: 'pointer' }}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:465:40
         </p>
         {(post.tags || []).length > 0 && (
           <div style={{ display: 'flex', gap: 6, flexWrap: 'wrap', marginTop: 6 }}>
-            {post.tags.slice(0, 3).map(t => (
-              <span key={t} style={{ fontSize: 13, color: 'var(--blue)', cursor: 'pointer' }}
-                onClick={() => navigate(`search?q=${encodeURIComponent('#' + t)}`)}>
-                #{t}
-              </span>
-            ))}
+            {post.tags.slice(0, 3).map(() => undefined)}
           </div>
         )}

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:465:14
         </p>
         {(post.tags || []).length > 0 && (
           <div style={{ display: 'flex', gap: 6, flexWrap: 'wrap', marginTop: 6 }}>
-            {post.tags.slice(0, 3).map(t => (
+            {post.tags.map(t => (
               <span key={t} style={{ fontSize: 13, color: 'var(--blue)', cursor: 'pointer' }}
                 onClick={() => navigate(`search?q=${encodeURIComponent('#' + t)}`)}>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:466:59
         {(post.tags || []).length > 0 && (
           <div style={{ display: 'flex', gap: 6, flexWrap: 'wrap', marginTop: 6 }}>
             {post.tags.slice(0, 3).map(t => (
-              <span key={t} style={{ fontSize: 13, color: 'var(--blue)', cursor: 'pointer' }}
+              <span key={t} style={{ fontSize: 13, color: "", cursor: 'pointer' }}
                 onClick={() => navigate(`search?q=${encodeURIComponent('#' + t)}`)}>
                 #{t}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:467:26
           <div style={{ display: 'flex', gap: 6, flexWrap: 'wrap', marginTop: 6 }}>
             {post.tags.slice(0, 3).map(t => (
               <span key={t} style={{ fontSize: 13, color: 'var(--blue)', cursor: 'pointer' }}
-                onClick={() => navigate(`search?q=${encodeURIComponent('#' + t)}`)}>
+                onClick={() => undefined}>
                 #{t}
               </span>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:467:41
           <div style={{ display: 'flex', gap: 6, flexWrap: 'wrap', marginTop: 6 }}>
             {post.tags.slice(0, 3).map(t => (
               <span key={t} style={{ fontSize: 13, color: 'var(--blue)', cursor: 'pointer' }}
-                onClick={() => navigate(`search?q=${encodeURIComponent('#' + t)}`)}>
+                onClick={() => navigate(``)}>
                 #{t}
               </span>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:474:8
           </div>
         )}
       </div>
-      {post.image && (
-        <img src={post.image} alt="" className="li-post__image"
-          onClick={() => showToast('Image viewer — coming soon')} />
-      )}
+      {true}
 
       {/* Reactions count row */}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:474:8
           </div>
         )}
       </div>
-      {post.image && (
-        <img src={post.image} alt="" className="li-post__image"
-          onClick={() => showToast('Image viewer — coming soon')} />
-      )}
+      {false}
 
       {/* Reactions count row */}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:476:20
       </div>
       {post.image && (
         <img src={post.image} alt="" className="li-post__image"
-          onClick={() => showToast('Image viewer — coming soon')} />
+          onClick={() => undefined} />
       )}
 

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:476:36
       </div>
       {post.image && (
         <img src={post.image} alt="" className="li-post__image"
-          onClick={() => showToast('Image viewer — coming soon')} />
+          onClick={() => showToast("")} />
       )}
 

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:480:31
       )}
 
       {/* Reactions count row */}
-      {(totalReactions > 0 || commentCount > 0 || repostCount > 0) && (
+      {(totalReactions > 0 || commentCount <= 0 || repostCount > 0) && (
         <div className="li-post__reactions">
           <div className="li-post__reaction-icons" onClick={() => showToast('Reactions — coming soon')} style={{ cursor: 'pointer' }}>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:480:9
       )}
 
       {/* Reactions count row */}
-      {(totalReactions > 0 || commentCount > 0 || repostCount > 0) && (
+      {(true) && (
         <div className="li-post__reactions">
           <div className="li-post__reaction-icons" onClick={() => showToast('Reactions — coming soon')} style={{ cursor: 'pointer' }}>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:482:61
       {/* Reactions count row */}
       {(totalReactions > 0 || commentCount > 0 || repostCount > 0) && (
         <div className="li-post__reactions">
-          <div className="li-post__reaction-icons" onClick={() => showToast('Reactions — coming soon')} style={{ cursor: 'pointer' }}>
+          <div className="li-post__reaction-icons" onClick={() => undefined} style={{ cursor: 'pointer' }}>
             {topReactLabels.length > 0 && (
               <span style={{ display: 'flex', marginRight: 4 }}>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:482:122
       {/* Reactions count row */}
       {(totalReactions > 0 || commentCount > 0 || repostCount > 0) && (
         <div className="li-post__reactions">
-          <div className="li-post__reaction-icons" onClick={() => showToast('Reactions — coming soon')} style={{ cursor: 'pointer' }}>
+          <div className="li-post__reaction-icons" onClick={() => showToast('Reactions — coming soon')} style={{ cursor: "" }}>
             {topReactLabels.length > 0 && (
               <span style={{ display: 'flex', marginRight: 4 }}>

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:483:14
       {(totalReactions > 0 || commentCount > 0 || repostCount > 0) && (
         <div className="li-post__reactions">
           <div className="li-post__reaction-icons" onClick={() => showToast('Reactions — coming soon')} style={{ cursor: 'pointer' }}>
-            {topReactLabels.length > 0 && (
+            {topReactLabels.length >= 0 && (
               <span style={{ display: 'flex', marginRight: 4 }}>
                 {topReactLabels.map((e, i) => (

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:483:14
       {(totalReactions > 0 || commentCount > 0 || repostCount > 0) && (
         <div className="li-post__reactions">
           <div className="li-post__reaction-icons" onClick={() => showToast('Reactions — coming soon')} style={{ cursor: 'pointer' }}>
-            {topReactLabels.length > 0 && (
-              <span style={{ display: 'flex', marginRight: 4 }}>
-                {topReactLabels.map((e, i) => (
-                  <span key={i} className="li-post__reaction-emoji" style={{ marginLeft: i > 0 ? -4 : 0 }}>{e}</span>
-                ))}
-              </span>
-            )}
+            {false}
             {(totalReactions > 0 || liked) && (
               <span className="li-post__reaction-count">

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:484:28
         <div className="li-post__reactions">
           <div className="li-post__reaction-icons" onClick={() => showToast('Reactions — coming soon')} style={{ cursor: 'pointer' }}>
             {topReactLabels.length > 0 && (
-              <span style={{ display: 'flex', marginRight: 4 }}>
+              <span style={{}}>
                 {topReactLabels.map((e, i) => (
                   <span key={i} className="li-post__reaction-emoji" style={{ marginLeft: i > 0 ? -4 : 0 }}>{e}</span>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:485:37
           <div className="li-post__reaction-icons" onClick={() => showToast('Reactions — coming soon')} style={{ cursor: 'pointer' }}>
             {topReactLabels.length > 0 && (
               <span style={{ display: 'flex', marginRight: 4 }}>
-                {topReactLabels.map((e, i) => (
-                  <span key={i} className="li-post__reaction-emoji" style={{ marginLeft: i > 0 ? -4 : 0 }}>{e}</span>
-                ))}
+                {topReactLabels.map(() => undefined)}
               </span>
             )}

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:486:90
             {topReactLabels.length > 0 && (
               <span style={{ display: 'flex', marginRight: 4 }}>
                 {topReactLabels.map((e, i) => (
-                  <span key={i} className="li-post__reaction-emoji" style={{ marginLeft: i > 0 ? -4 : 0 }}>{e}</span>
+                  <span key={i} className="li-post__reaction-emoji" style={{ marginLeft: i >= 0 ? -4 : 0 }}>{e}</span>
                 ))}
               </span>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:486:90
             {topReactLabels.length > 0 && (
               <span style={{ display: 'flex', marginRight: 4 }}>
                 {topReactLabels.map((e, i) => (
-                  <span key={i} className="li-post__reaction-emoji" style={{ marginLeft: i > 0 ? -4 : 0 }}>{e}</span>
+                  <span key={i} className="li-post__reaction-emoji" style={{ marginLeft: true ? -4 : 0 }}>{e}</span>
                 ))}
               </span>

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:490:15
                 ))}
               </span>
             )}
-            {(totalReactions > 0 || liked) && (
+            {(totalReactions > 0 && liked) && (
               <span className="li-post__reaction-count">
                 {liked ? (totalReactions > 1 ? `You and ${formatNumber(totalReactions - 1)} others` : 'You') : formatNumber(totalReactions)}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:490:14
                 ))}
               </span>
             )}
-            {(totalReactions > 0 || liked) && (
-              <span className="li-post__reaction-count">
-                {liked ? (totalReactions > 1 ? `You and ${formatNumber(totalReactions - 1)} others` : 'You') : formatNumber(totalReactions)}
-              </span>
-            )}
+            {false}
           </div>
           <div className="li-post__meta-right">

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:492:27
             )}
             {(totalReactions > 0 || liked) && (
               <span className="li-post__reaction-count">
-                {liked ? (totalReactions > 1 ? `You and ${formatNumber(totalReactions - 1)} others` : 'You') : formatNumber(totalReactions)}
+                {liked ? (false ? `You and ${formatNumber(totalReactions - 1)} others` : 'You') : formatNumber(totalReactions)}
               </span>
             )}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:492:27
             )}
             {(totalReactions > 0 || liked) && (
               <span className="li-post__reaction-count">
-                {liked ? (totalReactions > 1 ? `You and ${formatNumber(totalReactions - 1)} others` : 'You') : formatNumber(totalReactions)}
+                {liked ? (true ? `You and ${formatNumber(totalReactions - 1)} others` : 'You') : formatNumber(totalReactions)}
               </span>
             )}

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:497:14
             )}
           </div>
           <div className="li-post__meta-right">
-            {commentCount > 0 && (
-              <span className="li-post__comments-count" onClick={onToggleComments}>
-                {formatNumber(commentCount)} comment{commentCount !== 1 ? 's' : ''}
-              </span>
-            )}
+            {commentCount > 0 || <span className="li-post__comments-count" onClick={onToggleComments}>
+                {formatNumber(commentCount)} comment{commentCount !== 1 ? 's' : ''}
+              </span>}
             {repostCount > 0 && (
               <span style={{ fontSize: 13, color: 'var(--text-2)' }}>{formatNumber(repostCount)} reposts</span>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:497:14
             )}
           </div>
           <div className="li-post__meta-right">
-            {commentCount > 0 && (
-              <span className="li-post__comments-count" onClick={onToggleComments}>
-                {formatNumber(commentCount)} comment{commentCount !== 1 ? 's' : ''}
-              </span>
-            )}
+            {true}
             {repostCount > 0 && (
               <span style={{ fontSize: 13, color: 'var(--text-2)' }}>{formatNumber(repostCount)} reposts</span>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:499:54
           <div className="li-post__meta-right">
             {commentCount > 0 && (
               <span className="li-post__comments-count" onClick={onToggleComments}>
-                {formatNumber(commentCount)} comment{commentCount !== 1 ? 's' : ''}
+                {formatNumber(commentCount)} comment{true ? 's' : ''}
               </span>
             )}

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:499:54
           <div className="li-post__meta-right">
             {commentCount > 0 && (
               <span className="li-post__comments-count" onClick={onToggleComments}>
-                {formatNumber(commentCount)} comment{commentCount !== 1 ? 's' : ''}
+                {formatNumber(commentCount)} comment{commentCount === 1 ? 's' : ''}
               </span>
             )}

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:502:14
                 {formatNumber(commentCount)} comment{commentCount !== 1 ? 's' : ''}
               </span>
             )}
-            {repostCount > 0 && (
+            {repostCount >= 0 && (
               <span style={{ fontSize: 13, color: 'var(--text-2)' }}>{formatNumber(repostCount)} reposts</span>
             )}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:502:14
                 {formatNumber(commentCount)} comment{commentCount !== 1 ? 's' : ''}
               </span>
             )}
-            {repostCount > 0 && (
-              <span style={{ fontSize: 13, color: 'var(--text-2)' }}>{formatNumber(repostCount)} reposts</span>
-            )}
+            {false}
           </div>
         </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:503:51
               </span>
             )}
             {repostCount > 0 && (
-              <span style={{ fontSize: 13, color: 'var(--text-2)' }}>{formatNumber(repostCount)} reposts</span>
+              <span style={{ fontSize: 13, color: "" }}>{formatNumber(repostCount)} reposts</span>
             )}
           </div>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:514:61
         {/* Like with reaction picker */}
         <div style={{ position: 'relative', flex: 1 }}>
           <button
-            className={`li-post__action${liked ? ' liked' : ''}`}
+            className={`li-post__action${liked ? ' liked' : "Stryker was here!"}`}
             style={{ width: '100%' }}
             onMouseEnter={handleLikeHover}

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:514:50
         {/* Like with reaction picker */}
         <div style={{ position: 'relative', flex: 1 }}>
           <button
-            className={`li-post__action${liked ? ' liked' : ''}`}
+            className={`li-post__action${liked ? "" : ''}`}
             style={{ width: '100%' }}
             onMouseEnter={handleLikeHover}

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:515:20
         <div style={{ position: 'relative', flex: 1 }}>
           <button
             className={`li-post__action${liked ? ' liked' : ''}`}
-            style={{ width: '100%' }}
+            style={{}}
             onMouseEnter={handleLikeHover}
             onMouseLeave={handleLikeLeave}

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:518:28
             style={{ width: '100%' }}
             onMouseEnter={handleLikeHover}
             onMouseLeave={handleLikeLeave}
-            onClick={() => { setLocalReaction(null); onLike(); }}
+            onClick={() => {}}
           >
             <svg viewBox="0 0 24 24" width="18" height="18" fill={liked ? 'var(--blue)' : 'none'} stroke={liked ? 'var(--blue)' : 'currentColor'} strokeWidth="1.5">

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:520:91
             onMouseLeave={handleLikeLeave}
             onClick={() => { setLocalReaction(null); onLike(); }}
           >
-            <svg viewBox="0 0 24 24" width="18" height="18" fill={liked ? 'var(--blue)' : 'none'} stroke={liked ? 'var(--blue)' : 'currentColor'} strokeWidth="1.5">
+            <svg viewBox="0 0 24 24" width="18" height="18" fill={liked ? 'var(--blue)' : ""} stroke={liked ? 'var(--blue)' : 'currentColor'} strokeWidth="1.5">
               <path d="M8 10V20H4V10h4zm4-7a1 1 0 011 1v6h5a2 2 0 011.98 2.22l-1 7A2 2 0 0117 21H8V10l2.95-6.55A1 1 0 0112 3z" strokeLinecap="round" strokeLinejoin="round"/>
             </svg>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:528:41
           {reactionHover && (
             <div
-              onMouseEnter={() => { if (reactionTimer) clearTimeout(reactionTimer); setReactionHover(true); }}
+              onMouseEnter={() => { if (false) clearTimeout(reactionTimer); setReactionHover(true); }}
               onMouseLeave={() => setReactionHover(false)}>
               {reactions.map(r => (

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:528:35
           {reactionHover && (
             <div
-              onMouseEnter={() => { if (reactionTimer) clearTimeout(reactionTimer); setReactionHover(true); }}
+              onMouseEnter={() => {}}
               onMouseLeave={() => setReactionHover(false)}>
               {reactions.map(r => (

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:529:29
             <div
               onMouseEnter={() => { if (reactionTimer) clearTimeout(reactionTimer); setReactionHover(true); }}
-              onMouseLeave={() => setReactionHover(false)}>
+              onMouseLeave={() => undefined}>
               {reactions.map(r => (
                 <button key={r.name} title={r.name}

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:529:52
             <div
               onMouseEnter={() => { if (reactionTimer) clearTimeout(reactionTimer); setReactionHover(true); }}
-              onMouseLeave={() => setReactionHover(false)}>
+              onMouseLeave={() => setReactionHover(true)}>
               {reactions.map(r => (
                 <button key={r.name} title={r.name}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:530:30
               onMouseEnter={() => { if (reactionTimer) clearTimeout(reactionTimer); setReactionHover(true); }}
               onMouseLeave={() => setReactionHover(false)}>
-              {reactions.map(r => (
-                <button key={r.name} title={r.name}
-                  onClick={() => selectReaction(r)}
-                  style={{ background: 'none', border: 'none', cursor: 'pointer', fontSize: 22, padding: '2px 4px', borderRadius: '50%', transition: 'transform 0.1s' }}
-                  onMouseEnter={e => e.currentTarget.style.transform = 'scale(1.4)'}
-                  onMouseLeave={e => e.currentTarget.style.transform = 'scale(1)'}>
-                  {r.emoji || r.name}
-                </button>
-              ))}
+              {reactions.map(() => undefined)}
             </div>
           )}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:532:28
               onMouseLeave={() => setReactionHover(false)}>
               {reactions.map(r => (
                 <button key={r.name} title={r.name}
-                  onClick={() => selectReaction(r)}
+                  onClick={() => undefined}
                   style={{ background: 'none', border: 'none', cursor: 'pointer', fontSize: 22, padding: '2px 4px', borderRadius: '50%', transition: 'transform 0.1s' }}
                   onMouseEnter={e => e.currentTarget.style.transform = 'scale(1.4)'}

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:533:72
               {reactions.map(r => (
                 <button key={r.name} title={r.name}
                   onClick={() => selectReaction(r)}
-                  style={{ background: 'none', border: 'none', cursor: 'pointer', fontSize: 22, padding: '2px 4px', borderRadius: '50%', transition: 'transform 0.1s' }}
+                  style={{ background: 'none', border: 'none', cursor: "", fontSize: 22, padding: '2px 4px', borderRadius: '50%', transition: 'transform 0.1s' }}
                   onMouseEnter={e => e.currentTarget.style.transform = 'scale(1.4)'}
                   onMouseLeave={e => e.currentTarget.style.transform = 'scale(1)'}>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:534:33
                 <button key={r.name} title={r.name}
                   onClick={() => selectReaction(r)}
                   style={{ background: 'none', border: 'none', cursor: 'pointer', fontSize: 22, padding: '2px 4px', borderRadius: '50%', transition: 'transform 0.1s' }}
-                  onMouseEnter={e => e.currentTarget.style.transform = 'scale(1.4)'}
+                  onMouseEnter={() => undefined}
                   onMouseLeave={e => e.currentTarget.style.transform = 'scale(1)'}>
                   {r.emoji || r.name}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:535:33
                   onClick={() => selectReaction(r)}
                   style={{ background: 'none', border: 'none', cursor: 'pointer', fontSize: 22, padding: '2px 4px', borderRadius: '50%', transition: 'transform 0.1s' }}
                   onMouseEnter={e => e.currentTarget.style.transform = 'scale(1.4)'}
-                  onMouseLeave={e => e.currentTarget.style.transform = 'scale(1)'}>
+                  onMouseLeave={() => undefined}>
                   {r.emoji || r.name}
                 </button>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:536:20
                   style={{ background: 'none', border: 'none', cursor: 'pointer', fontSize: 22, padding: '2px 4px', borderRadius: '50%', transition: 'transform 0.1s' }}
                   onMouseEnter={e => e.currentTarget.style.transform = 'scale(1.4)'}
                   onMouseLeave={e => e.currentTarget.style.transform = 'scale(1)'}>
-                  {r.emoji || r.name}
+                  {true}
                 </button>
               ))}
