[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:536:20
                   style={{ background: 'none', border: 'none', cursor: 'pointer', fontSize: 22, padding: '2px 4px', borderRadius: '50%', transition: 'transform 0.1s' }}
                   onMouseEnter={e => e.currentTarget.style.transform = 'scale(1.4)'}
                   onMouseLeave={e => e.currentTarget.style.transform = 'scale(1)'}>
-                  {r.emoji || r.name}
+                  {r.emoji && r.name}
                 </button>
               ))}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:550:54
           <span>Comment</span>
         </button>
 
-        <button className="li-post__action" onClick={() => openModal('share', { post })} style={{ flex: 1 }}>
+        <button className="li-post__action" onClick={() => undefined} style={{ flex: 1 }}>
           <svg viewBox="0 0 24 24" width="18" height="18" fill="none" stroke="currentColor" strokeWidth="1.5">
             <path d="M17 1l4 4-4 4M3 11V9a4 4 0 014-4h14M7 23l-4-4 4-4M21 13v2a4 4 0 01-4 4H3" strokeLinecap="round" strokeLinejoin="round"/>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:550:70
           <span>Comment</span>
         </button>
 
-        <button className="li-post__action" onClick={() => openModal('share', { post })} style={{ flex: 1 }}>
+        <button className="li-post__action" onClick={() => openModal("", { post })} style={{ flex: 1 }}>
           <svg viewBox="0 0 24 24" width="18" height="18" fill="none" stroke="currentColor" strokeWidth="1.5">
             <path d="M17 1l4 4-4 4M3 11V9a4 4 0 014-4h14M7 23l-4-4 4-4M21 13v2a4 4 0 01-4 4H3" strokeLinecap="round" strokeLinejoin="round"/>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:557:54
           <span>Repost</span>
         </button>
 
-        <button className="li-post__action" onClick={() => showToast('Link copied!')} style={{ flex: 1 }}>
+        <button className="li-post__action" onClick={() => undefined} style={{ flex: 1 }}>
           <svg viewBox="0 0 24 24" width="18" height="18" fill="none" stroke="currentColor" strokeWidth="1.5">
             <path d="M4 12v8a2 2 0 002 2h12a2 2 0 002-2v-8M16 6l-4-4-4 4M12 2v13" strokeLinecap="round" strokeLinejoin="round"/>

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:570:69
         <div className="li-post__comments">
           {/* Comment input */}
           <div className="li-post__comment-input-row">
-            <div className="li-comment__photo" style={{ background: (currentUser || {}).avatarColor || 'var(--blue)' }}>
+            <div className="li-comment__photo" style={{ background: (currentUser || {}).avatarColor && 'var(--blue)' }}>
               {getInitials((currentUser || {}).name || 'Me')}
             </div>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:570:70
         <div className="li-post__comments">
           {/* Comment input */}
           <div className="li-post__comment-input-row">
-            <div className="li-comment__photo" style={{ background: (currentUser || {}).avatarColor || 'var(--blue)' }}>
+            <div className="li-comment__photo" style={{ background: (true).avatarColor || 'var(--blue)' }}>
               {getInitials((currentUser || {}).name || 'Me')}
             </div>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:571:29
           {/* Comment input */}
           <div className="li-post__comment-input-row">
             <div className="li-comment__photo" style={{ background: (currentUser || {}).avatarColor || 'var(--blue)' }}>
-              {getInitials((currentUser || {}).name || 'Me')}
+              {getInitials((false).name || 'Me')}
             </div>
             <input

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:571:28
           {/* Comment input */}
           <div className="li-post__comment-input-row">
             <div className="li-comment__photo" style={{ background: (currentUser || {}).avatarColor || 'var(--blue)' }}>
-              {getInitials((currentUser || {}).name || 'Me')}
+              {getInitials(true)}
             </div>
             <input

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:577:25
               className="li-post__comment-input"
               placeholder="Add a comment…"
               value={commentDraft}
-              onChange={e => setCommentDraft(e.target.value)}
+              onChange={() => undefined}
               onKeyDown={e => e.key === 'Enter' && postComment()}
             />

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:578:31
               placeholder="Add a comment…"
               value={commentDraft}
               onChange={e => setCommentDraft(e.target.value)}
-              onKeyDown={e => e.key === 'Enter' && postComment()}
+              onKeyDown={e => e.key !== 'Enter' && postComment()}
             />
             {commentDraft.trim() && (

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:578:31
               placeholder="Add a comment…"
               value={commentDraft}
               onChange={e => setCommentDraft(e.target.value)}
-              onKeyDown={e => e.key === 'Enter' && postComment()}
+              onKeyDown={e => true}
             />
             {commentDraft.trim() && (

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:580:14
               onChange={e => setCommentDraft(e.target.value)}
               onKeyDown={e => e.key === 'Enter' && postComment()}
             />
-            {commentDraft.trim() && (
-              <button className="li-btn li-btn--primary li-btn--sm" style={{ borderRadius: 20, flexShrink: 0 }} onClick={postComment}>Post</button>
-            )}
+            {commentDraft.trim() || <button className="li-btn li-btn--primary li-btn--sm" style={{
+  borderRadius: 20,
+  flexShrink: 0
+}} onClick={postComment}>Post</button>}
           </div>
 

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:580:14
               onChange={e => setCommentDraft(e.target.value)}
               onKeyDown={e => e.key === 'Enter' && postComment()}
             />
-            {commentDraft.trim() && (
+            {commentDraft && (
               <button className="li-btn li-btn--primary li-btn--sm" style={{ borderRadius: 20, flexShrink: 0 }} onClick={postComment}>Post</button>
             )}

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:581:76
               onKeyDown={e => e.key === 'Enter' && postComment()}
             />
             {commentDraft.trim() && (
-              <button className="li-btn li-btn--primary li-btn--sm" style={{ borderRadius: 20, flexShrink: 0 }} onClick={postComment}>Post</button>
+              <button className="li-btn li-btn--primary li-btn--sm" style={{}} onClick={postComment}>Post</button>
             )}
           </div>

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:586:12
           </div>
 
           {/* Comment list */}
-          {localComments.slice(0, 3).map((c, i) => {
+          {localComments.map((c, i) => {
             const cName = c.author?.name || c.authorName || c.author || 'User';
             const cText = c.text || c.content || '';

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:587:27
 
           {/* Comment list */}
           {localComments.slice(0, 3).map((c, i) => {
-            const cName = c.author?.name || c.authorName || c.author || 'User';
+            const cName = (c.author?.name || c.authorName || c.author) && 'User';
             const cText = c.text || c.content || '';
             const cHeadline = c.author?.headline || c.authorHeadline || '';

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:587:27
 
           {/* Comment list */}
           {localComments.slice(0, 3).map((c, i) => {
-            const cName = c.author?.name || c.authorName || c.author || 'User';
+            const cName = false;
             const cText = c.text || c.content || '';
             const cHeadline = c.author?.headline || c.authorHeadline || '';

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:588:27
           {/* Comment list */}
           {localComments.slice(0, 3).map((c, i) => {
             const cName = c.author?.name || c.authorName || c.author || 'User';
-            const cText = c.text || c.content || '';
+            const cText = true;
             const cHeadline = c.author?.headline || c.authorHeadline || '';
             return (

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:588:27
           {/* Comment list */}
           {localComments.slice(0, 3).map((c, i) => {
             const cName = c.author?.name || c.authorName || c.author || 'User';
-            const cText = c.text || c.content || '';
+            const cText = (c.text || c.content) && '';
             const cHeadline = c.author?.headline || c.authorHeadline || '';
             return (

[NoCoverage] OptionalChaining
js/components/pages/FeedPage.js:589:31
           {localComments.slice(0, 3).map((c, i) => {
             const cName = c.author?.name || c.authorName || c.author || 'User';
             const cText = c.text || c.content || '';
-            const cHeadline = c.author?.headline || c.authorHeadline || '';
+            const cHeadline = c.author.headline || c.authorHeadline || '';
             return (
               <div key={i} className="li-comment">

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:589:31
           {localComments.slice(0, 3).map((c, i) => {
             const cName = c.author?.name || c.authorName || c.author || 'User';
             const cText = c.text || c.content || '';
-            const cHeadline = c.author?.headline || c.authorHeadline || '';
+            const cHeadline = true;
             return (
               <div key={i} className="li-comment">

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:592:73
             const cHeadline = c.author?.headline || c.authorHeadline || '';
             return (
               <div key={i} className="li-comment">
-                <div className="li-comment__photo" style={{ background: 'var(--blue)' }}>
+                <div className="li-comment__photo" style={{ background: "" }}>
                   {getInitials(cName)}
                 </div>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:595:29
                 <div className="li-comment__photo" style={{ background: 'var(--blue)' }}>
                   {getInitials(cName)}
                 </div>
-                <div style={{ flex: 1 }}>
+                <div style={{}}>
                   <div className="li-comment__bubble">
                     <div className="li-comment__author">{cName}</div>

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:598:22
                 <div style={{ flex: 1 }}>
                   <div className="li-comment__bubble">
                     <div className="li-comment__author">{cName}</div>
-                    {cHeadline && <div className="li-comment__headline">{cHeadline}</div>}
+                    {cHeadline || <div className="li-comment__headline">{cHeadline}</div>}
                     <div className="li-comment__text">{cText}</div>
                   </div>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:598:22
                 <div style={{ flex: 1 }}>
                   <div className="li-comment__bubble">
                     <div className="li-comment__author">{cName}</div>
-                    {cHeadline && <div className="li-comment__headline">{cHeadline}</div>}
+                    {false}
                     <div className="li-comment__text">{cText}</div>
                   </div>

[NoCoverage] LogicalOperator
js/components/pages/FeedPage.js:602:22
                     <div className="li-comment__text">{cText}</div>
                   </div>
                   <div className="li-comment__actions">
-                    {c.timestamp && <span style={{ fontSize: 12, color: 'var(--text-3)' }}>{typeof c.timestamp === 'string' ? c.timestamp : formatTime(c.timestamp)}</span>}
+                    {c.timestamp || <span style={{
+  fontSize: 12,
+  color: 'var(--text-3)'
+}}>{typeof c.timestamp === 'string' ? c.timestamp : formatTime(c.timestamp)}</span>}
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
                       onClick={() => showToast('Liked comment!')}>Like</button>

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:602:93
                     <div className="li-comment__text">{cText}</div>
                   </div>
                   <div className="li-comment__actions">
-                    {c.timestamp && <span style={{ fontSize: 12, color: 'var(--text-3)' }}>{typeof c.timestamp === 'string' ? c.timestamp : formatTime(c.timestamp)}</span>}
+                    {c.timestamp && <span style={{ fontSize: 12, color: 'var(--text-3)' }}>{typeof c.timestamp !== 'string' ? c.timestamp : formatTime(c.timestamp)}</span>}
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
                       onClick={() => showToast('Liked comment!')}>Like</button>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:603:36
                   </div>
                   <div className="li-comment__actions">
                     {c.timestamp && <span style={{ fontSize: 12, color: 'var(--text-3)' }}>{typeof c.timestamp === 'string' ? c.timestamp : formatTime(c.timestamp)}</span>}
-                    <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
+                    <button style={{}}
                       onClick={() => showToast('Liked comment!')}>Like</button>
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:604:32
                   <div className="li-comment__actions">
                     {c.timestamp && <span style={{ fontSize: 12, color: 'var(--text-3)' }}>{typeof c.timestamp === 'string' ? c.timestamp : formatTime(c.timestamp)}</span>}
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
-                      onClick={() => showToast('Liked comment!')}>Like</button>
+                      onClick={() => undefined}>Like</button>
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
                       onClick={() => showToast('Reply — coming soon')}>Reply</button>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:604:48
                   <div className="li-comment__actions">
                     {c.timestamp && <span style={{ fontSize: 12, color: 'var(--text-3)' }}>{typeof c.timestamp === 'string' ? c.timestamp : formatTime(c.timestamp)}</span>}
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
-                      onClick={() => showToast('Liked comment!')}>Like</button>
+                      onClick={() => showToast("")}>Like</button>
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
                       onClick={() => showToast('Reply — coming soon')}>Reply</button>

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:605:66
                     {c.timestamp && <span style={{ fontSize: 12, color: 'var(--text-3)' }}>{typeof c.timestamp === 'string' ? c.timestamp : formatTime(c.timestamp)}</span>}
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
                       onClick={() => showToast('Liked comment!')}>Like</button>
-                    <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
+                    <button style={{ background: 'none', border: "", cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
                       onClick={() => showToast('Reply — coming soon')}>Reply</button>
                   </div>

[NoCoverage] ObjectLiteral
js/components/pages/FeedPage.js:605:36
                     {c.timestamp && <span style={{ fontSize: 12, color: 'var(--text-3)' }}>{typeof c.timestamp === 'string' ? c.timestamp : formatTime(c.timestamp)}</span>}
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
                       onClick={() => showToast('Liked comment!')}>Like</button>
-                    <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
+                    <button style={{}}
                       onClick={() => showToast('Reply — coming soon')}>Reply</button>
                   </div>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:606:32
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
                       onClick={() => showToast('Liked comment!')}>Like</button>
                     <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 12, fontWeight: 600, padding: 0 }}
-                      onClick={() => showToast('Reply — coming soon')}>Reply</button>
+                      onClick={() => undefined}>Reply</button>
                   </div>
                 </div>

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:612:12
               </div>
             );
           })}
-          {commentCount > 3 && (
+          {commentCount <= 3 && (
             <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 13, fontWeight: 600 }}
               onClick={() => showToast('Loading all comments...')}>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:612:12
               </div>
             );
           })}
-          {commentCount > 3 && (
-            <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 13, fontWeight: 600 }}
-              onClick={() => showToast('Loading all comments...')}>
-              View all {formatNumber(commentCount)} comments
-            </button>
-          )}
+          {true}
         </div>
       )}

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:613:92
             );
           })}
           {commentCount > 3 && (
-            <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 13, fontWeight: 600 }}
+            <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: "", fontSize: 13, fontWeight: 600 }}
               onClick={() => showToast('Loading all comments...')}>
               View all {formatNumber(commentCount)} comments

[NoCoverage] StringLiteral
js/components/pages/FeedPage.js:613:42
             );
           })}
           {commentCount > 3 && (
-            <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 13, fontWeight: 600 }}
+            <button style={{ background: "", border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 13, fontWeight: 600 }}
               onClick={() => showToast('Loading all comments...')}>
               View all {formatNumber(commentCount)} comments

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:614:24
           })}
           {commentCount > 3 && (
             <button style={{ background: 'none', border: 'none', cursor: 'pointer', color: 'var(--text-2)', fontSize: 13, fontWeight: 600 }}
-              onClick={() => showToast('Loading all comments...')}>
+              onClick={() => undefined}>
               View all {formatNumber(commentCount)} comments
             </button>

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:625:41
 }
 
 /* ── TruncatedText helper ────────────────────────────────── */
-function TruncatedText({ text, limit }) {
-  const [expanded, setExpanded] = React.useState(false);
-  if (text.length <= limit || expanded) {
-    return (
-      <>
-        {text}
-        {expanded && text.length > limit && (
-          <> <button className="li-post__see-more" onClick={() => setExpanded(false)}>see less</button></>
-        )}
-      </>
-    );
-  }
-  return (
-    <>
-      {text.slice(0, limit)}
-      <button className="li-post__see-more" onClick={() => setExpanded(true)}>…see more</button>
-    </>
-  );
-}
+function TruncatedText({ text, limit }) {}
 

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:626:50
 
 /* ── TruncatedText helper ────────────────────────────────── */
 function TruncatedText({ text, limit }) {
-  const [expanded, setExpanded] = React.useState(false);
+  const [expanded, setExpanded] = React.useState(true);
   if (text.length <= limit || expanded) {
     return (

[NoCoverage] BlockStatement
js/components/pages/FeedPage.js:627:41
 /* ── TruncatedText helper ────────────────────────────────── */
 function TruncatedText({ text, limit }) {
   const [expanded, setExpanded] = React.useState(false);
-  if (text.length <= limit || expanded) {
-    return (
-      <>
-        {text}
-        {expanded && text.length > limit && (
-          <> <button className="li-post__see-more" onClick={() => setExpanded(false)}>see less</button></>
-        )}
-      </>
-    );
-  }
+  if (text.length <= limit || expanded) {}
   return (
     <>

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:627:7
 /* ── TruncatedText helper ────────────────────────────────── */
 function TruncatedText({ text, limit }) {
   const [expanded, setExpanded] = React.useState(false);
-  if (text.length <= limit || expanded) {
+  if (true) {
     return (
       <>

[NoCoverage] EqualityOperator
js/components/pages/FeedPage.js:631:22
     return (
       <>
         {text}
-        {expanded && text.length > limit && (
+        {expanded && text.length >= limit && (
           <> <button className="li-post__see-more" onClick={() => setExpanded(false)}>see less</button></>
         )}

[NoCoverage] ConditionalExpression
js/components/pages/FeedPage.js:631:10
     return (
       <>
         {text}
-        {expanded && text.length > limit && (
-          <> <button className="li-post__see-more" onClick={() => setExpanded(false)}>see less</button></>
-        )}
+        {false}
       </>
     );

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:632:79
       <>
         {text}
         {expanded && text.length > limit && (
-          <> <button className="li-post__see-more" onClick={() => setExpanded(false)}>see less</button></>
+          <> <button className="li-post__see-more" onClick={() => setExpanded(true)}>see less</button></>
         )}
       </>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:632:61
       <>
         {text}
         {expanded && text.length > limit && (
-          <> <button className="li-post__see-more" onClick={() => setExpanded(false)}>see less</button></>
+          <> <button className="li-post__see-more" onClick={() => undefined}>see less</button></>
         )}
       </>

[NoCoverage] MethodExpression
js/components/pages/FeedPage.js:639:8
   }
   return (
     <>
-      {text.slice(0, limit)}
+      {text}
       <button className="li-post__see-more" onClick={() => setExpanded(true)}>…see more</button>
     </>

[NoCoverage] ArrowFunction
js/components/pages/FeedPage.js:640:54
   return (
     <>
       {text.slice(0, limit)}
-      <button className="li-post__see-more" onClick={() => setExpanded(true)}>…see more</button>
+      <button className="li-post__see-more" onClick={() => undefined}>…see more</button>
     </>
   );

[NoCoverage] BooleanLiteral
js/components/pages/FeedPage.js:640:72
   return (
     <>
       {text.slice(0, limit)}
-      <button className="li-post__see-more" onClick={() => setExpanded(true)}>…see more</button>
+      <button className="li-post__see-more" onClick={() => setExpanded(false)}>…see more</button>
     </>
   );
