[Survived] ArrayDeclaration
js/components/pages/MessagingPage.js:10:75
 function MessagingPage() {
   const { currentUser, showToast, setUnreadMessages } = React.useContext(AppContext);
 
-  const { data: conversations, loading } = useFetch(API.getConversations, []);
+  const { data: conversations, loading } = useFetch(API.getConversations, ["Stryker was here"]);
   const [selectedId, setSelectedId] = React.useState(null);
   const [messages, setMessages] = React.useState([]);

[Survived] ArrayDeclaration
js/components/pages/MessagingPage.js:12:50
 
   const { data: conversations, loading } = useFetch(API.getConversations, []);
   const [selectedId, setSelectedId] = React.useState(null);
-  const [messages, setMessages] = React.useState([]);
+  const [messages, setMessages] = React.useState(["Stryker was here"]);
   const [msgLoading, setMsgLoading] = React.useState(false);
   const [draft, setDraft] = React.useState('');

[Survived] BooleanLiteral
js/components/pages/MessagingPage.js:13:54
   const { data: conversations, loading } = useFetch(API.getConversations, []);
   const [selectedId, setSelectedId] = React.useState(null);
   const [messages, setMessages] = React.useState([]);
-  const [msgLoading, setMsgLoading] = React.useState(false);
+  const [msgLoading, setMsgLoading] = React.useState(true);
   const [draft, setDraft] = React.useState('');
   const [search, setSearch] = React.useState('');

[Killed] StringLiteral
js/components/pages/MessagingPage.js:15:46
   const [messages, setMessages] = React.useState([]);
   const [msgLoading, setMsgLoading] = React.useState(false);
   const [draft, setDraft] = React.useState('');
-  const [search, setSearch] = React.useState('');
+  const [search, setSearch] = React.useState("Stryker was here!");
   const messagesEndRef = React.useRef(null);
 
killedBy: MessagingPage Component Tests Sets selectedId immediately on call
statusReason: TestingLibraryElementError: Unable to find an element with the text: Bob. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] BooleanLiteral
js/components/pages/MessagingPage.js:26:66
 
   // Profile Readiness state
   const [readiness, setReadiness] = React.useState(null);
-  const [readinessLoading, setReadinessLoading] = React.useState(false);
+  const [readinessLoading, setReadinessLoading] = React.useState(true);
   const [readinessError, setReadinessError] = React.useState(null);
 

[Killed] BlockStatement
js/components/pages/MessagingPage.js:30:25
   const [readinessError, setReadinessError] = React.useState(null);
 
   // Auto-select first conversation
-  React.useEffect(() => {
-    if (conversations && conversations.length > 0 && !selectedId) {
-      selectConversation(conversations[0].id);
-    }
-  }, [conversations]);
+  React.useEffect(() => {}, [conversations]);
 
   // Mark all read when page mounts (P3 simplification)
killedBy: MessagingPage Component Tests Auto-selects first conversation when selectedId is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:31:9
 
   // Auto-select first conversation
   React.useEffect(() => {
-    if (conversations && conversations.length > 0 && !selectedId) {
+    if (conversations || conversations.length > 0 && !selectedId) {
       selectConversation(conversations[0].id);
     }
killedBy: MessagingPage Component Tests Shows loading spinner while conversations fetch
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] BlockStatement
js/components/pages/MessagingPage.js:31:67
 
   // Auto-select first conversation
   React.useEffect(() => {
-    if (conversations && conversations.length > 0 && !selectedId) {
-      selectConversation(conversations[0].id);
-    }
+    if (conversations && conversations.length > 0 && !selectedId) {}
   }, [conversations]);
 
killedBy: MessagingPage Component Tests Auto-selects first conversation when selectedId is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
js/components/pages/MessagingPage.js:37:25
   }, [conversations]);
 
   // Mark all read when page mounts (P3 simplification)
-  React.useEffect(() => {
-    setUnreadMessages(0);
-  }, []);
+  React.useEffect(() => {}, []);
 
   // Scroll to bottom when messages change
killedBy: MessagingPage Component Tests Calls setUnreadMessages(0) once on mount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
js/components/pages/MessagingPage.js:42:25
   }, []);
 
   // Scroll to bottom when messages change
-  React.useEffect(() => {
-    if (messagesEndRef.current) {
-      messagesEndRef.current.scrollIntoView({ behavior: 'smooth' });
-    }
-  }, [messages]);
+  React.useEffect(() => {}, [messages]);
 
   function selectConversation(id) {
killedBy: MessagingPage Component Tests Scrolls to bottom when messages state changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"behavior": "smooth"}

Number of calls: 0

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:43:9
 
   // Scroll to bottom when messages change
   React.useEffect(() => {
-    if (messagesEndRef.current) {
+    if (false) {
       messagesEndRef.current.scrollIntoView({ behavior: 'smooth' });
     }
killedBy: MessagingPage Component Tests Scrolls to bottom when messages state changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"behavior": "smooth"}

Number of calls: 0

[Killed] BlockStatement
js/components/pages/MessagingPage.js:43:33
 
   // Scroll to bottom when messages change
   React.useEffect(() => {
-    if (messagesEndRef.current) {
-      messagesEndRef.current.scrollIntoView({ behavior: 'smooth' });
-    }
+    if (messagesEndRef.current) {}
   }, [messages]);
 
killedBy: MessagingPage Component Tests Scrolls to bottom when messages state changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"behavior": "smooth"}

Number of calls: 0

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:44:45
   // Scroll to bottom when messages change
   React.useEffect(() => {
     if (messagesEndRef.current) {
-      messagesEndRef.current.scrollIntoView({ behavior: 'smooth' });
+      messagesEndRef.current.scrollIntoView({});
     }
   }, [messages]);
killedBy: MessagingPage Component Tests Scrolls to bottom when messages state changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "behavior": "smooth",
- }

[Killed] BlockStatement
js/components/pages/MessagingPage.js:48:35
     }
   }, [messages]);
 
-  function selectConversation(id) {
-    setSelectedId(id);
-    setMsgLoading(true);
-    API.getConversation(id)
-      .then(data => {
-        setMessages(data.messages || []);
-        setMsgLoading(false);
-      })
-      .catch(() => {
-        setMessages([]);
-        setMsgLoading(false);
-      });
-  }
+  function selectConversation(id) {}
 
   function sendMessage() {
killedBy: MessagingPage Component Tests Auto-selects first conversation when selectedId is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:50:19
 
   function selectConversation(id) {
     setSelectedId(id);
-    setMsgLoading(true);
+    setMsgLoading(false);
     API.getConversation(id)
       .then(data => {
killedBy: MessagingPage Component Tests Sets msgLoading:true before API resolves
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading conversation…. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BlockStatement
js/components/pages/MessagingPage.js:52:21
     setSelectedId(id);
     setMsgLoading(true);
     API.getConversation(id)
-      .then(data => {
-        setMessages(data.messages || []);
-        setMsgLoading(false);
-      })
+      .then(data => {})
       .catch(() => {
         setMessages([]);
killedBy: MessagingPage Component Tests Scrolls to bottom when messages state changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"behavior": "smooth"}

Number of calls: 0

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:53:21
     setMsgLoading(true);
     API.getConversation(id)
       .then(data => {
-        setMessages(data.messages || []);
+        setMessages(false);
         setMsgLoading(false);
       })
killedBy: MessagingPage Component Tests Sets messages from data.messages on success
statusReason: TestingLibraryElementError: Unable to find an element with the text: Secret Message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:53:21
     setMsgLoading(true);
     API.getConversation(id)
       .then(data => {
-        setMessages(data.messages || []);
+        setMessages(data.messages && []);
         setMsgLoading(false);
       })
killedBy: MessagingPage Component Tests Sets messages from data.messages on success
statusReason: TestingLibraryElementError: Unable to find an element with the text: Secret Message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:54:23
     API.getConversation(id)
       .then(data => {
         setMessages(data.messages || []);
-        setMsgLoading(false);
+        setMsgLoading(true);
       })
       .catch(() => {
killedBy: MessagingPage Component Tests Scrolls to bottom when messages state changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"behavior": "smooth"}

Number of calls: 0

[Killed] BlockStatement
js/components/pages/MessagingPage.js:56:20
         setMessages(data.messages || []);
         setMsgLoading(false);
       })
-      .catch(() => {
-        setMessages([]);
-        setMsgLoading(false);
-      });
+      .catch(() => {});
   }
 
killedBy: MessagingPage Component Tests Sets messages to [] on API rejection
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div style="color: var(--text-3);">Loading conversation…</div> instead

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:58:23
       })
       .catch(() => {
         setMessages([]);
-        setMsgLoading(false);
+        setMsgLoading(true);
       });
   }
killedBy: MessagingPage Component Tests Sets messages to [] on API rejection
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div style="color: var(--text-3);">Loading conversation…</div> instead

[Killed] BlockStatement
js/components/pages/MessagingPage.js:62:26
       });
   }
 
-  function sendMessage() {
-    if (!draft.trim() || !selectedId) return;
-    const text = draft.trim();
-    setDraft('');
-
-    // Optimistic update
-    const newMsg = {
-      id: Date.now(),
-      senderId: 'me',
-      text,
-      timestamp: Date.now(),
-      isMe: true,
-    };
-    setMessages(prev => [...prev, newMsg]);
-
-    API.sendMessage(selectedId, text).catch(() => {
-      showToast('Failed to send message', 'error');
-    });
-  }
+  function sendMessage() {}
 
   // ────────────────────────────────────────────────────────────
killedBy: MessagingPage Component Tests Clears draft state before API call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Hello"

[Killed] MethodExpression
js/components/pages/MessagingPage.js:63:10
   }
 
   function sendMessage() {
-    if (!draft.trim() || !selectedId) return;
+    if (!draft || !selectedId) return;
     const text = draft.trim();
     setDraft('');
killedBy: MessagingPage Component Tests No-op for whitespace only
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: 1, ""

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:63:9
   }
 
   function sendMessage() {
-    if (!draft.trim() || !selectedId) return;
+    if (draft.trim() || !selectedId) return;
     const text = draft.trim();
     setDraft('');
killedBy: MessagingPage Component Tests No-op for empty string
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: 1, ""

[Killed] MethodExpression
js/components/pages/MessagingPage.js:64:18
 
   function sendMessage() {
     if (!draft.trim() || !selectedId) return;
-    const text = draft.trim();
+    const text = draft;
     setDraft('');
 
killedBy: MessagingPage Component Tests Sends trimmed text to API — not raw draft
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, "Hello"
Received: 1, " Hello "

Number of calls: 1

[Killed] StringLiteral
js/components/pages/MessagingPage.js:65:14
   function sendMessage() {
     if (!draft.trim() || !selectedId) return;
     const text = draft.trim();
-    setDraft('');
+    setDraft("Stryker was here!");
 
     // Optimistic update
killedBy: MessagingPage Component Tests Clears draft state before API call
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:68:20
     setDraft('');
 
     // Optimistic update
-    const newMsg = {
-      id: Date.now(),
-      senderId: 'me',
-      text,
-      timestamp: Date.now(),
-      isMe: true,
-    };
+    const newMsg = {};
     setMessages(prev => [...prev, newMsg]);
 
killedBy: MessagingPage Component Tests Appends optimistic message with correct shape
statusReason: TestingLibraryElementError: Unable to find an element with the text: Hello. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] BooleanLiteral
js/components/pages/MessagingPage.js:73:13
       senderId: 'me',
       text,
       timestamp: Date.now(),
-      isMe: true,
+      isMe: false,
     };
     setMessages(prev => [...prev, newMsg]);

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:75:17
       timestamp: Date.now(),
       isMe: true,
     };
-    setMessages(prev => [...prev, newMsg]);
+    setMessages(() => undefined);
 
     API.sendMessage(selectedId, text).catch(() => {
killedBy: MessagingPage Component Tests Appends optimistic message with correct shape
statusReason: TestingLibraryElementError: Unable to find an element with the text: Hello. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BlockStatement
js/components/pages/MessagingPage.js:77:51
     };
     setMessages(prev => [...prev, newMsg]);
 
-    API.sendMessage(selectedId, text).catch(() => {
-      showToast('Failed to send message', 'error');
-    });
+    API.sendMessage(selectedId, text).catch(() => {});
   }
 
killedBy: MessagingPage Component Tests Calls showToast on API rejection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Failed to send message", "error"

Number of calls: 0

[Killed] BlockStatement
js/components/pages/MessagingPage.js:86:41
   // USER STORY 2 — Profile Readiness
   // API-first (backend-ready), fallback mock for P3 if backend off
   // ────────────────────────────────────────────────────────────
-  async function openProfileReadiness() {
-    setActivePanel(prev => (prev === 'score' ? null : 'score'));
-    if (activePanel === 'score') return;
-
-    // Close guide if open
-    if (activePanel === 'guide') setActivePanel('score');
-
-    await loadProfileReadiness({ refresh: false });
-  }
+  async function openProfileReadiness() {}
 
   async function loadProfileReadiness({ refresh }) {
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TestingLibraryElementError: Unable to find an element with the text: Profile Readiness. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:87:29
   // API-first (backend-ready), fallback mock for P3 if backend off
   // ────────────────────────────────────────────────────────────
   async function openProfileReadiness() {
-    setActivePanel(prev => (prev === 'score' ? null : 'score'));
+    setActivePanel(prev => (false ? null : 'score'));
     if (activePanel === 'score') return;
 
killedBy: MessagingPage Component Tests Sets activePanel to null when was 'score'
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span class="li-msg-score__subtitle">Improve your profile before outreach</span> instead

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:87:29
   // API-first (backend-ready), fallback mock for P3 if backend off
   // ────────────────────────────────────────────────────────────
   async function openProfileReadiness() {
-    setActivePanel(prev => (prev === 'score' ? null : 'score'));
+    setActivePanel(prev => (true ? null : 'score'));
     if (activePanel === 'score') return;
 
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TestingLibraryElementError: Unable to find an element with the text: Profile Readiness. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:88:9
   // ────────────────────────────────────────────────────────────
   async function openProfileReadiness() {
     setActivePanel(prev => (prev === 'score' ? null : 'score'));
-    if (activePanel === 'score') return;
+    if (activePanel !== 'score') return;
 
     // Close guide if open
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:88:9
   // ────────────────────────────────────────────────────────────
   async function openProfileReadiness() {
     setActivePanel(prev => (prev === 'score' ? null : 'score'));
-    if (activePanel === 'score') return;
+    if (true) return;
 
     // Close guide if open
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:91:9
     if (activePanel === 'score') return;
 
     // Close guide if open
-    if (activePanel === 'guide') setActivePanel('score');
+    if (true) setActivePanel('score');
 
     await loadProfileReadiness({ refresh: false });

[Survived] EqualityOperator
js/components/pages/MessagingPage.js:91:9
     if (activePanel === 'score') return;
 
     // Close guide if open
-    if (activePanel === 'guide') setActivePanel('score');
+    if (activePanel !== 'guide') setActivePanel('score');
 
     await loadProfileReadiness({ refresh: false });

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:93:43
     // Close guide if open
     if (activePanel === 'guide') setActivePanel('score');
 
-    await loadProfileReadiness({ refresh: false });
+    await loadProfileReadiness({ refresh: true });
   }
 
killedBy: MessagingPage Component Tests No showToast when refresh:false and API succeeds
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalledWith(...expected)

Expected: not "Score refreshed", Anything
Received:     0, ["Score refreshed", "success"]

Number of calls: 1

[Killed] BlockStatement
js/components/pages/MessagingPage.js:96:52
     await loadProfileReadiness({ refresh: false });
   }
 
-  async function loadProfileReadiness({ refresh }) {
-    setReadinessLoading(true);
-    setReadinessError(null);
-    try {
-      // Backend call (P4-ready)
-      const data = await API.getProfileReadiness();
-      setReadiness(data);
-      if (refresh) showToast('Score refreshed', 'success');
-    } catch (e) {
-      // Fallback mock so P3 works even if backend isn’t running
-      const mock = mockBackendGetProfileReadiness(currentUser, { jitter: refresh });
-      setReadiness(mock);
-      setReadinessError('Backend not running — using mocked score');
-      if (refresh) showToast('Score refreshed (mock)', 'info');
-    } finally {
-      setReadinessLoading(false);
-    }
-  }
+  async function loadProfileReadiness({ refresh }) {}
 
   // ────────────────────────────────────────────────────────────
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:97:25
   }
 
   async function loadProfileReadiness({ refresh }) {
-    setReadinessLoading(true);
+    setReadinessLoading(false);
     setReadinessError(null);
     try {
killedBy: MessagingPage Component Tests Sets readinessLoading:true at start
statusReason: TestingLibraryElementError: Unable to find an element with the text: Calculating score…. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BlockStatement
js/components/pages/MessagingPage.js:99:9
   async function loadProfileReadiness({ refresh }) {
     setReadinessLoading(true);
     setReadinessError(null);
-    try {
-      // Backend call (P4-ready)
-      const data = await API.getProfileReadiness();
-      setReadiness(data);
-      if (refresh) showToast('Score refreshed', 'success');
-    } catch (e) {
+    try {} catch (e) {
       // Fallback mock so P3 works even if backend isn’t running
       const mock = mockBackendGetProfileReadiness(currentUser, { jitter: refresh });
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:103:11
       // Backend call (P4-ready)
       const data = await API.getProfileReadiness();
       setReadiness(data);
-      if (refresh) showToast('Score refreshed', 'success');
+      if (true) showToast('Score refreshed', 'success');
     } catch (e) {
       // Fallback mock so P3 works even if backend isn’t running
killedBy: MessagingPage Component Tests No showToast when refresh:false and API succeeds
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalledWith(...expected)

Expected: not "Score refreshed", Anything
Received:     0, ["Score refreshed", "success"]

Number of calls: 1

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:103:11
       // Backend call (P4-ready)
       const data = await API.getProfileReadiness();
       setReadiness(data);
-      if (refresh) showToast('Score refreshed', 'success');
+      if (false) showToast('Score refreshed', 'success');
     } catch (e) {
       // Fallback mock so P3 works even if backend isn’t running
killedBy: MessagingPage Component Tests showToast 'Score refreshed' when refresh:true + success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Score refreshed", "success"

Number of calls: 0

[Killed] BlockStatement
js/components/pages/MessagingPage.js:104:17
       const data = await API.getProfileReadiness();
       setReadiness(data);
       if (refresh) showToast('Score refreshed', 'success');
-    } catch (e) {
-      // Fallback mock so P3 works even if backend isn’t running
-      const mock = mockBackendGetProfileReadiness(currentUser, { jitter: refresh });
-      setReadiness(mock);
-      setReadinessError('Backend not running — using mocked score');
-      if (refresh) showToast('Score refreshed (mock)', 'info');
-    } finally {
+    } catch (e) {} finally {
       setReadinessLoading(false);
     }
killedBy: MessagingPage Component Tests Uses mock fallback and sets readinessError on failure
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backend not running — using mocked score. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0

[Survived] ObjectLiteral
js/components/pages/MessagingPage.js:106:64
       if (refresh) showToast('Score refreshed', 'success');
     } catch (e) {
       // Fallback mock so P3 works even if backend isn’t running
-      const mock = mockBackendGetProfileReadiness(currentUser, { jitter: refresh });
+      const mock = mockBackendGetProfileReadiness(currentUser, {});
       setReadiness(mock);
       setReadinessError('Backend not running — using mocked score');

[Killed] StringLiteral
js/components/pages/MessagingPage.js:108:25
       // Fallback mock so P3 works even if backend isn’t running
       const mock = mockBackendGetProfileReadiness(currentUser, { jitter: refresh });
       setReadiness(mock);
-      setReadinessError('Backend not running — using mocked score');
+      setReadinessError("");
       if (refresh) showToast('Score refreshed (mock)', 'info');
     } finally {
killedBy: MessagingPage Component Tests Uses mock fallback and sets readinessError on failure
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backend not running — using mocked score. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:109:11
       const mock = mockBackendGetProfileReadiness(currentUser, { jitter: refresh });
       setReadiness(mock);
       setReadinessError('Backend not running — using mocked score');
-      if (refresh) showToast('Score refreshed (mock)', 'info');
+      if (false) showToast('Score refreshed (mock)', 'info');
     } finally {
       setReadinessLoading(false);
killedBy: MessagingPage Component Tests showToast 'Score refreshed (mock)' when refresh:true + failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Score refreshed (mock)", "info"

Number of calls: 0

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:109:11
       const mock = mockBackendGetProfileReadiness(currentUser, { jitter: refresh });
       setReadiness(mock);
       setReadinessError('Backend not running — using mocked score');
-      if (refresh) showToast('Score refreshed (mock)', 'info');
+      if (true) showToast('Score refreshed (mock)', 'info');
     } finally {
       setReadinessLoading(false);
