[Killed] BlockStatement
js/components/pages/MessagingPage.js:110:15
       setReadiness(mock);
       setReadinessError('Backend not running — using mocked score');
       if (refresh) showToast('Score refreshed (mock)', 'info');
-    } finally {
-      setReadinessLoading(false);
-    }
+    } finally {}
   }
 
killedBy: MessagingPage Component Tests Sets readiness from API on success
statusReason: TestingLibraryElementError: Unable to find an element with the text: 85. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:111:27
       setReadinessError('Backend not running — using mocked score');
       if (refresh) showToast('Score refreshed (mock)', 'info');
     } finally {
-      setReadinessLoading(false);
+      setReadinessLoading(true);
     }
   }
killedBy: MessagingPage Component Tests Sets readiness from API on success
statusReason: TestingLibraryElementError: Unable to find an element with the text: 85. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:120:20
   // React version of your old step-by-step guide logic
   // ────────────────────────────────────────────────────────────
   function openOutreachGuide() {
-    setActivePanel(prev => (prev === 'guide' ? null : 'guide'));
+    setActivePanel(() => undefined);
     if (!selectedId) return;
 
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:120:29
   // React version of your old step-by-step guide logic
   // ────────────────────────────────────────────────────────────
   function openOutreachGuide() {
-    setActivePanel(prev => (prev === 'guide' ? null : 'guide'));
+    setActivePanel(prev => (true ? null : 'guide'));
     if (!selectedId) return;
 
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:121:9
   // ────────────────────────────────────────────────────────────
   function openOutreachGuide() {
     setActivePanel(prev => (prev === 'guide' ? null : 'guide'));
-    if (!selectedId) return;
+    if (selectedId) return;
 
     // Close readiness if open
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:121:9
   // ────────────────────────────────────────────────────────────
   function openOutreachGuide() {
     setActivePanel(prev => (prev === 'guide' ? null : 'guide'));
-    if (!selectedId) return;
+    if (true) return;
 
     // Close readiness if open
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:124:9
     if (!selectedId) return;
 
     // Close readiness if open
-    if (activePanel === 'score') setActivePanel('guide');
+    if (activePanel !== 'score') setActivePanel('guide');
 
     setGuideStateByConv(prev => {
killedBy: MessagingPage Component Tests Toggles activePanel to null when was 'guide'
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="li-msg-guide__step-label">What’s the purpose of your message?</div> instead

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:124:9
     if (!selectedId) return;
 
     // Close readiness if open
-    if (activePanel === 'score') setActivePanel('guide');
+    if (true) setActivePanel('guide');
 
     setGuideStateByConv(prev => {
killedBy: MessagingPage Component Tests Toggles activePanel to null when was 'guide'
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="li-msg-guide__step-label">What’s the purpose of your message?</div> instead

[Killed] BlockStatement
js/components/pages/MessagingPage.js:126:33
     // Close readiness if open
     if (activePanel === 'score') setActivePanel('guide');
 
-    setGuideStateByConv(prev => {
-      const next = { ...prev };
-      if (!next[selectedId]) {
-        next[selectedId] = {
-          step: 1,
-          goal: null,
-          variantIdx: 0,
-          details: {
-            recipient: '',
-            yourRole: '',
-            field: '',
-            company: '',
-            role: '',
-            context: '',
-          },
-          preview: '',
-        };
-      }
-      return next;
-    });
+    setGuideStateByConv(prev => {});
   }
 
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] BlockStatement
js/components/pages/MessagingPage.js:128:30
 
     setGuideStateByConv(prev => {
       const next = { ...prev };
-      if (!next[selectedId]) {
-        next[selectedId] = {
-          step: 1,
-          goal: null,
-          variantIdx: 0,
-          details: {
-            recipient: '',
-            yourRole: '',
-            field: '',
-            company: '',
-            role: '',
-            context: '',
-          },
-          preview: '',
-        };
-      }
+      if (!next[selectedId]) {}
       return next;
     });
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:128:11
 
     setGuideStateByConv(prev => {
       const next = { ...prev };
-      if (!next[selectedId]) {
+      if (true) {
         next[selectedId] = {
           step: 1,
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] StringLiteral
js/components/pages/MessagingPage.js:137:22
             recipient: '',
             yourRole: '',
             field: '',
-            company: '',
+            company: "Stryker was here!",
             role: '',
             context: '',

[Survived] StringLiteral
js/components/pages/MessagingPage.js:141:20
             role: '',
             context: '',
           },
-          preview: '',
+          preview: "Stryker was here!",
         };
       }

[Killed] BlockStatement
js/components/pages/MessagingPage.js:148:33
     });
   }
 
-  function setGuideState(patch) {
-    if (!selectedId) return;
-    setGuideStateByConv(prev => ({
-      ...prev,
-      [selectedId]: { ...(prev[selectedId] || {}), ...patch },
-    }));
-  }
+  function setGuideState(patch) {}
 
   function setGuideDetailsPatch(patch) {
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:149:9
   }
 
   function setGuideState(patch) {
-    if (!selectedId) return;
+    if (true) return;
     setGuideStateByConv(prev => ({
       ...prev,
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:149:9
   }
 
   function setGuideState(patch) {
-    if (!selectedId) return;
+    if (selectedId) return;
     setGuideStateByConv(prev => ({
       ...prev,
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:150:25
 
   function setGuideState(patch) {
     if (!selectedId) return;
-    setGuideStateByConv(prev => ({
-      ...prev,
-      [selectedId]: { ...(prev[selectedId] || {}), ...patch },
-    }));
+    setGuideStateByConv(() => undefined);
   }
 
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:150:34
 
   function setGuideState(patch) {
     if (!selectedId) return;
-    setGuideStateByConv(prev => ({
-      ...prev,
-      [selectedId]: { ...(prev[selectedId] || {}), ...patch },
-    }));
+    setGuideStateByConv(prev => ({}));
   }
 
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:152:27
     if (!selectedId) return;
     setGuideStateByConv(prev => ({
       ...prev,
-      [selectedId]: { ...(prev[selectedId] || {}), ...patch },
+      [selectedId]: { ...(true), ...patch },
     }));
   }
killedBy: MessagingPage Component Tests selectGoal resets step:2 and variantIdx:0
statusReason: TypeError: Cannot read properties of undefined (reading 'recipient')

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:152:27
     if (!selectedId) return;
     setGuideStateByConv(prev => ({
       ...prev,
-      [selectedId]: { ...(prev[selectedId] || {}), ...patch },
+      [selectedId]: { ...(prev[selectedId] && {}), ...patch },
     }));
   }
killedBy: MessagingPage Component Tests selectGoal resets step:2 and variantIdx:0
statusReason: TypeError: Cannot read properties of undefined (reading 'recipient')

[Killed] BlockStatement
js/components/pages/MessagingPage.js:156:40
     }));
   }
 
-  function setGuideDetailsPatch(patch) {
-    if (!selectedId) return;
-    setGuideStateByConv(prev => ({
-      ...prev,
-      [selectedId]: {
-        ...(prev[selectedId] || {}),
-        details: { ...((prev[selectedId] || {}).details || {}), ...patch },
-      },
-    }));
-  }
+  function setGuideDetailsPatch(patch) {}
 
 
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    "Hi [Name],·
I saw the [role] opening at [Company] and I’m really interested. I’m [your name/major] with experience in [skill/area].·
Would you be open to a quick chat about the team and what you look for in candidates?"

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:157:9
   }
 
   function setGuideDetailsPatch(patch) {
-    if (!selectedId) return;
+    if (selectedId) return;
     setGuideStateByConv(prev => ({
       ...prev,
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    "Hi [Name],·
I saw the [role] opening at [Company] and I’m really interested. I’m [your name/major] with experience in [skill/area].·
Would you be open to a quick chat about the team and what you look for in candidates?"

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:157:9
   }
 
   function setGuideDetailsPatch(patch) {
-    if (!selectedId) return;
+    if (true) return;
     setGuideStateByConv(prev => ({
       ...prev,
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    "Hi [Name],·
I saw the [role] opening at [Company] and I’m really interested. I’m [your name/major] with experience in [skill/area].·
Would you be open to a quick chat about the team and what you look for in candidates?"

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:158:25
 
   function setGuideDetailsPatch(patch) {
     if (!selectedId) return;
-    setGuideStateByConv(prev => ({
-      ...prev,
-      [selectedId]: {
-        ...(prev[selectedId] || {}),
-        details: { ...((prev[selectedId] || {}).details || {}), ...patch },
-      },
-    }));
+    setGuideStateByConv(() => undefined);
   }
 
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:161:13
     setGuideStateByConv(prev => ({
       ...prev,
       [selectedId]: {
-        ...(prev[selectedId] || {}),
+        ...(prev[selectedId] && {}),
         details: { ...((prev[selectedId] || {}).details || {}), ...patch },
       },
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:161:13
     setGuideStateByConv(prev => ({
       ...prev,
       [selectedId]: {
-        ...(prev[selectedId] || {}),
+        ...(false),
         details: { ...((prev[selectedId] || {}).details || {}), ...patch },
       },
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:162:24
       ...prev,
       [selectedId]: {
         ...(prev[selectedId] || {}),
-        details: { ...((prev[selectedId] || {}).details || {}), ...patch },
+        details: { ...(false), ...patch },
       },
     }));
killedBy: MessagingPage Component Tests setGuideDetailsPatch deep-merges into details only, preserves other detail fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Frank"
Received: ""

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:162:25
       ...prev,
       [selectedId]: {
         ...(prev[selectedId] || {}),
-        details: { ...((prev[selectedId] || {}).details || {}), ...patch },
+        details: { ...((true).details || {}), ...patch },
       },
     }));
killedBy: MessagingPage Component Tests setGuideDetailsPatch deep-merges into details only, preserves other detail fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Frank"
Received: ""

[Killed] BlockStatement
js/components/pages/MessagingPage.js:168:32
   }
 
 
-  function selectGoal(goalKey) {
-    const cur = guideStateByConv[selectedId] || {};
-    const updated = {
-      ...cur,
-      goal: goalKey,
-      step: 2,
-      variantIdx: 0,
-    };
-    updated.preview = computeGuidePreview(updated);
-    setGuideState(updated);
-  }
+  function selectGoal(goalKey) {}
 
   function nextStep() {
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] LogicalOperator
js/components/pages/MessagingPage.js:169:17
 
 
   function selectGoal(goalKey) {
-    const cur = guideStateByConv[selectedId] || {};
+    const cur = guideStateByConv[selectedId] && {};
     const updated = {
       ...cur,

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:169:17
 
 
   function selectGoal(goalKey) {
-    const cur = guideStateByConv[selectedId] || {};
+    const cur = true;
     const updated = {
       ...cur,

[Killed] BlockStatement
js/components/pages/MessagingPage.js:180:23
     setGuideState(updated);
   }
 
-  function nextStep() {
-    const s = guideStateByConv[selectedId];
-    if (!s) return;
-
-    if (s.step === 1) {
-      if (!s.goal) {
-        showToast('Pick a goal to continue', 'info');
-        return;
-      }
-      setGuideState({ step: 2 });
-      return;
-    }
-
-    if (s.step === 2) {
-      const updated = { ...s, step: 3 };
-      updated.preview = computeGuidePreview(updated);
-      setGuideState(updated);
-      return;
-    }
-  }
+  function nextStep() {}
 
   function backStep() {
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:182:9
 
   function nextStep() {
     const s = guideStateByConv[selectedId];
-    if (!s) return;
+    if (s) return;
 
     if (s.step === 1) {
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:182:9
 
   function nextStep() {
     const s = guideStateByConv[selectedId];
-    if (!s) return;
+    if (true) return;
 
     if (s.step === 1) {
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:184:9
     const s = guideStateByConv[selectedId];
     if (!s) return;
 
-    if (s.step === 1) {
+    if (s.step !== 1) {
       if (!s.goal) {
         showToast('Pick a goal to continue', 'info');
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:184:9
     const s = guideStateByConv[selectedId];
     if (!s) return;
 
-    if (s.step === 1) {
+    if (false) {
       if (!s.goal) {
         showToast('Pick a goal to continue', 'info');
killedBy: MessagingPage Component Tests nextStep shows info toast on Step 1 with no goal selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Pick a goal to continue", "info"

Number of calls: 0

[Killed] BlockStatement
js/components/pages/MessagingPage.js:185:20
     if (!s) return;
 
     if (s.step === 1) {
-      if (!s.goal) {
-        showToast('Pick a goal to continue', 'info');
-        return;
-      }
+      if (!s.goal) {}
       setGuideState({ step: 2 });
       return;
killedBy: MessagingPage Component Tests nextStep shows info toast on Step 1 with no goal selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Pick a goal to continue", "info"

Number of calls: 0

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:185:11
     if (!s) return;
 
     if (s.step === 1) {
-      if (!s.goal) {
+      if (s.goal) {
         showToast('Pick a goal to continue', 'info');
         return;
killedBy: MessagingPage Component Tests nextStep shows info toast on Step 1 with no goal selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Pick a goal to continue", "info"

Number of calls: 0

[Killed] BlockStatement
js/components/pages/MessagingPage.js:193:23
       return;
     }
 
-    if (s.step === 2) {
-      const updated = { ...s, step: 3 };
-      updated.preview = computeGuidePreview(updated);
-      setGuideState(updated);
-      return;
-    }
+    if (s.step === 2) {}
   }
 
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:193:9
       return;
     }
 
-    if (s.step === 2) {
+    if (s.step !== 2) {
       const updated = { ...s, step: 3 };
       updated.preview = computeGuidePreview(updated);
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:194:23
     }
 
     if (s.step === 2) {
-      const updated = { ...s, step: 3 };
+      const updated = {};
       updated.preview = computeGuidePreview(updated);
       setGuideState(updated);
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BlockStatement
js/components/pages/MessagingPage.js:201:23
     }
   }
 
-  function backStep() {
-    const s = guideStateByConv[selectedId];
-    if (!s) return;
-    if (s.step > 1) setGuideState({ step: s.step - 1 });
-  }
+  function backStep() {}
 
   function cycleVariant() {
killedBy: MessagingPage Component Tests selectGoal resets step:2 and variantIdx:0
statusReason: TestingLibraryElementError: Unable to find an element with the text: Job / Internship. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:204:9
   function backStep() {
     const s = guideStateByConv[selectedId];
     if (!s) return;
-    if (s.step > 1) setGuideState({ step: s.step - 1 });
+    if (false) setGuideState({ step: s.step - 1 });
   }
 
killedBy: MessagingPage Component Tests selectGoal resets step:2 and variantIdx:0
statusReason: TestingLibraryElementError: Unable to find an element with the text: Job / Internship. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ArithmeticOperator
js/components/pages/MessagingPage.js:204:43
   function backStep() {
     const s = guideStateByConv[selectedId];
     if (!s) return;
-    if (s.step > 1) setGuideState({ step: s.step - 1 });
+    if (s.step > 1) setGuideState({ step: s.step + 1 });
   }
 
killedBy: MessagingPage Component Tests selectGoal resets step:2 and variantIdx:0
statusReason: TestingLibraryElementError: Unable to find an element with the text: Job / Internship. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BlockStatement
js/components/pages/MessagingPage.js:207:27
     if (s.step > 1) setGuideState({ step: s.step - 1 });
   }
 
-  function cycleVariant() {
-    const s = guideStateByConv[selectedId];
-    if (!s || !s.goal) return;
-    const variants = _OUTREACH_TEMPLATES[s.goal] || [];
-    if (!variants.length) return;
-
-    const updated = { ...s, variantIdx: (s.variantIdx + 1) % variants.length };
-    updated.preview = computeGuidePreview(updated);
-    setGuideState(updated);
-  }
+  function cycleVariant() {}
 
   function updateGuidePreviewManual(value) {
killedBy: MessagingPage Component Tests Uses variantIdx modulo to wrap around variants seamlessly
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not "Hi [Name],·
I'm [your name/major] and I've been following your work in [their field]. I'd love to learn from your experience — would you have 15–20 minutes for a quick chat sometime?·
Thanks so much for considering it!"
