[Killed] ArrowFunction
js/components/pages/MessagingPage.js:302:32
 
           {/* Conversation list */}
           <div style={{ overflowY: 'auto', flex: 1 }}>
-            {filteredConvs.map(c => (
-              <button
-                key={c.id}
-                onClick={() => selectConversation(c.id)}
-                className="li-msg-conv"
-                style={{
-                  width: '100%',
-                  textAlign: 'left',
-                  padding: '12px 12px',
-                  border: 'none',
-                  background: c.id === selectedId ? 'var(--blue-light)' : 'transparent',
-                  cursor: 'pointer',
-                  borderBottom: '1px solid rgba(0,0,0,0.06)',
-                }}
-              >
-                <div style={{ fontWeight: 700, fontSize: 14 }}>{c.participantName || 'Unknown'}</div>
-                <div style={{ color: 'var(--text-3)', fontSize: 12, marginTop: 2 }}>{c.lastMessage || ''}</div>
-              </button>
-            ))}
+            {filteredConvs.map(() => undefined)}
           </div>
         </div>
killedBy: MessagingPage Component Tests Sets selectedId immediately on call
statusReason: TestingLibraryElementError: Unable to find an element with the text: Bob. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:305:26
             {filteredConvs.map(c => (
               <button
                 key={c.id}
-                onClick={() => selectConversation(c.id)}
+                onClick={() => undefined}
                 className="li-msg-conv"
                 style={{
killedBy: MessagingPage Component Tests Sets selectedId immediately on call
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading" and name "Bob"

Here are the accessible roles:

  heading:

  Name "Messaging":
  <h2

[Survived] EqualityOperator
js/components/pages/MessagingPage.js:312:31
                   textAlign: 'left',
                   padding: '12px 12px',
                   border: 'none',
-                  background: c.id === selectedId ? 'var(--blue-light)' : 'transparent',
+                  background: c.id !== selectedId ? 'var(--blue-light)' : 'transparent',
                   cursor: 'pointer',
                   borderBottom: '1px solid rgba(0,0,0,0.06)',

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:312:31
                   textAlign: 'left',
                   padding: '12px 12px',
                   border: 'none',
-                  background: c.id === selectedId ? 'var(--blue-light)' : 'transparent',
+                  background: true ? 'var(--blue-light)' : 'transparent',
                   cursor: 'pointer',
                   borderBottom: '1px solid rgba(0,0,0,0.06)',

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:317:65
                   borderBottom: '1px solid rgba(0,0,0,0.06)',
                 }}
               >
-                <div style={{ fontWeight: 700, fontSize: 14 }}>{c.participantName || 'Unknown'}</div>
+                <div style={{ fontWeight: 700, fontSize: 14 }}>{c.participantName && 'Unknown'}</div>
                 <div style={{ color: 'var(--text-3)', fontSize: 12, marginTop: 2 }}>{c.lastMessage || ''}</div>
               </button>
killedBy: MessagingPage Component Tests Sets selectedId immediately on call
statusReason: TestingLibraryElementError: Unable to find an element with the text: Bob. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:317:65
                   borderBottom: '1px solid rgba(0,0,0,0.06)',
                 }}
               >
-                <div style={{ fontWeight: 700, fontSize: 14 }}>{c.participantName || 'Unknown'}</div>
+                <div style={{ fontWeight: 700, fontSize: 14 }}>{false}</div>
                 <div style={{ color: 'var(--text-3)', fontSize: 12, marginTop: 2 }}>{c.lastMessage || ''}</div>
               </button>
killedBy: MessagingPage Component Tests Sets selectedId immediately on call
statusReason: TestingLibraryElementError: Unable to find an element with the text: Bob. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:318:86
                 }}
               >
                 <div style={{ fontWeight: 700, fontSize: 14 }}>{c.participantName || 'Unknown'}</div>
-                <div style={{ color: 'var(--text-3)', fontSize: 12, marginTop: 2 }}>{c.lastMessage || ''}</div>
+                <div style={{ color: 'var(--text-3)', fontSize: 12, marginTop: 2 }}>{false}</div>
               </button>
             ))}

[Survived] LogicalOperator
js/components/pages/MessagingPage.js:318:86
                 }}
               >
                 <div style={{ fontWeight: 700, fontSize: 14 }}>{c.participantName || 'Unknown'}</div>
-                <div style={{ color: 'var(--text-3)', fontSize: 12, marginTop: 2 }}>{c.lastMessage || ''}</div>
+                <div style={{ color: 'var(--text-3)', fontSize: 12, marginTop: 2 }}>{c.lastMessage && ''}</div>
               </button>
             ))}

[Survived] StringLiteral
js/components/pages/MessagingPage.js:325:41
         </div>
 
         {/* Right panel — chat */}
-        <div style={{ flex: 1, display: 'flex', flexDirection: 'column' }}>
+        <div style={{ flex: 1, display: "", flexDirection: 'column' }}>
           {/* Chat header */}
           <div style={{ padding: '12px 14px', borderBottom: '1px solid var(--border)', display: 'flex', alignItems: 'center', gap: 10 }}>

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:329:32
           {/* Chat header */}
           <div style={{ padding: '12px 14px', borderBottom: '1px solid var(--border)', display: 'flex', alignItems: 'center', gap: 10 }}>
             <h2 style={{ fontWeight: 800, fontSize: 15, margin: 0 }}>
-              {selectedConv ? (selectedConv.participantName || 'Conversation') : 'Select a conversation'}
+              {selectedConv ? (false) : 'Select a conversation'}
             </h2>
             <div style={{ flex: 1 }} />
killedBy: MessagingPage Component Tests Sets selectedId immediately on call
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading" and name "Bob"

Here are the accessible roles:

  heading:

  Name "Messaging":
  <h2

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:329:32
           {/* Chat header */}
           <div style={{ padding: '12px 14px', borderBottom: '1px solid var(--border)', display: 'flex', alignItems: 'center', gap: 10 }}>
             <h2 style={{ fontWeight: 800, fontSize: 15, margin: 0 }}>
-              {selectedConv ? (selectedConv.participantName || 'Conversation') : 'Select a conversation'}
+              {selectedConv ? (selectedConv.participantName && 'Conversation') : 'Select a conversation'}
             </h2>
             <div style={{ flex: 1 }} />
killedBy: MessagingPage Component Tests Sets selectedId immediately on call
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading" and name "Bob"

Here are the accessible roles:

  heading:

  Name "Messaging":
  <h2

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:337:25
             <button
               className="li-btn li-btn--ghost"
               onClick={openOutreachGuide}
-              disabled={!selectedId}
+              disabled={selectedId}
               style={{ display: 'inline-flex', alignItems: 'center', gap: 6 }}
               title="Outreach Guide"
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Survived] ObjectLiteral
js/components/pages/MessagingPage.js:338:22
               className="li-btn li-btn--ghost"
               onClick={openOutreachGuide}
               disabled={!selectedId}
-              style={{ display: 'inline-flex', alignItems: 'center', gap: 6 }}
+              style={{}}
               title="Outreach Guide"
             >

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:347:25
             <button
               className="li-btn li-btn--ghost"
               onClick={openProfileReadiness}
-              disabled={!selectedId}
+              disabled={selectedId}
               style={{ display: 'inline-flex', alignItems: 'center', gap: 6 }}
               title="Profile Readiness"
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TestingLibraryElementError: Unable to find an element with the text: Profile Readiness. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:356:12
           </div>
 
           {/* Panels (render like your old “side overlay” inside messaging) */}
-          {activePanel === 'guide' && selectedId && (
-            <OutreachGuidePanel
-              convId={selectedId}
-              state={guideState}
-              onClose={() => setActivePanel(null)}
-              onSelectGoal={selectGoal}
-              onNext={nextStep}
-              onBack={backStep}
-              onCycle={cycleVariant}
-              onDetailsChange={setGuideDetailsPatch}
-              onPreviewChange={updateGuidePreviewManual}
-              onInsert={applyGuideMessage}
-            />
-          )}
+          {false}
 
           {activePanel === 'score' && (
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:356:12
           </div>
 
           {/* Panels (render like your old “side overlay” inside messaging) */}
-          {activePanel === 'guide' && selectedId && (
+          {activePanel !== 'guide' && selectedId && (
             <OutreachGuidePanel
               convId={selectedId}
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:360:24
             <OutreachGuidePanel
               convId={selectedId}
               state={guideState}
-              onClose={() => setActivePanel(null)}
+              onClose={() => undefined}
               onSelectGoal={selectGoal}
               onNext={nextStep}
killedBy: MessagingPage Component Tests Guide ✕ close button sets activePanel to null
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="li-msg-guide__step-label">What’s the purpose of your message?</div> instead

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:371:12
             />
           )}
 
-          {activePanel === 'score' && (
+          {activePanel !== 'score' && (
             <ProfileReadinessPanel
               readiness={readiness}
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TestingLibraryElementError: Unable to find an element with the text: Profile Readiness. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:371:12
             />
           )}
 
-          {activePanel === 'score' && (
-            <ProfileReadinessPanel
-              readiness={readiness}
-              loading={readinessLoading}
-              error={readinessError}
-              onClose={() => setActivePanel(null)}
-              onRefresh={() => loadProfileReadiness({ refresh: true })}
-            />
-          )}
+          {true}
 
           {/* Chat messages */}
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TestingLibraryElementError: Unable to find an element with the text: Profile Readiness. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:376:24
               readiness={readiness}
               loading={readinessLoading}
               error={readinessError}
-              onClose={() => setActivePanel(null)}
+              onClose={() => undefined}
               onRefresh={() => loadProfileReadiness({ refresh: true })}
             />
killedBy: MessagingPage Component Tests Score panel ✕ close button sets activePanel to null
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="li-msg-score__ring-num">72</div> instead

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:377:26
               loading={readinessLoading}
               error={readinessError}
               onClose={() => setActivePanel(null)}
-              onRefresh={() => loadProfileReadiness({ refresh: true })}
+              onRefresh={() => undefined}
             />
           )}
killedBy: MessagingPage Component Tests showToast 'Score refreshed' when refresh:true + success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Score refreshed", "success"

Number of calls: 0

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:377:64
               loading={readinessLoading}
               error={readinessError}
               onClose={() => setActivePanel(null)}
-              onRefresh={() => loadProfileReadiness({ refresh: true })}
+              onRefresh={() => loadProfileReadiness({ refresh: false })}
             />
           )}
killedBy: MessagingPage Component Tests showToast 'Score refreshed' when refresh:true + success
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Score refreshed", "success"

Number of calls: 0

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:387:19
               <div style={{ color: 'var(--text-3)' }}>Loading conversation…</div>
             ) : (
               <>
-                {(messages || []).map(m => (
+                {(messages && []).map(m => (
                   <div
                     key={m.id}
killedBy: MessagingPage Component Tests Sets messages from data.messages on success
statusReason: TestingLibraryElementError: Unable to find an element with the text: Secret Message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] ObjectLiteral
js/components/pages/MessagingPage.js:390:28
                 {(messages || []).map(m => (
                   <div
                     key={m.id}
-                    style={{
-                      display: 'flex',
-                      justifyContent: m.isMe ? 'flex-end' : 'flex-start',
-                      marginTop: 8,
-                    }}
+                    style={{}}
                   >
                     <div

[Survived] StringLiteral
js/components/pages/MessagingPage.js:391:32
                   <div
                     key={m.id}
                     style={{
-                      display: 'flex',
+                      display: "",
                       justifyContent: m.isMe ? 'flex-end' : 'flex-start',
                       marginTop: 8,

[Survived] StringLiteral
js/components/pages/MessagingPage.js:398:35
                   >
                     <div
                       style={{
-                        maxWidth: '70%',
+                        maxWidth: "",
                         background: m.isMe ? 'var(--blue)' : 'var(--white)',
                         color: m.isMe ? 'white' : 'var(--text)',

[Survived] StringLiteral
js/components/pages/MessagingPage.js:399:62
                     <div
                       style={{
                         maxWidth: '70%',
-                        background: m.isMe ? 'var(--blue)' : 'var(--white)',
+                        background: m.isMe ? 'var(--blue)' : "",
                         color: m.isMe ? 'white' : 'var(--text)',
                         padding: '10px 12px',

[Survived] StringLiteral
js/components/pages/MessagingPage.js:400:41
                       style={{
                         maxWidth: '70%',
                         background: m.isMe ? 'var(--blue)' : 'var(--white)',
-                        color: m.isMe ? 'white' : 'var(--text)',
+                        color: m.isMe ? "" : 'var(--text)',
                         padding: '10px 12px',
                         borderRadius: m.isMe ? '18px 4px 18px 18px' : '4px 18px 18px 18px',

[Survived] StringLiteral
js/components/pages/MessagingPage.js:402:71
                         background: m.isMe ? 'var(--blue)' : 'var(--white)',
                         color: m.isMe ? 'white' : 'var(--text)',
                         padding: '10px 12px',
-                        borderRadius: m.isMe ? '18px 4px 18px 18px' : '4px 18px 18px 18px',
+                        borderRadius: m.isMe ? '18px 4px 18px 18px' : "",
                         boxShadow: '0 1px 2px rgba(0,0,0,0.08)',
                         fontSize: 14,

[Survived] ObjectLiteral
js/components/pages/MessagingPage.js:421:23
           </div>
 
           {/* Composer */}
-          <div style={{ padding: 12, borderTop: '1px solid var(--border)', display: 'flex', gap: 8 }}>
+          <div style={{}}>
             <input
               className="li-input"

[Killed] BlockStatement
js/components/pages/MessagingPage.js:427:31
               placeholder="Write a message…"
               value={draft}
               onChange={e => setDraft(e.target.value)}
-              onKeyDown={e => { if (e.key === 'Enter') sendMessage(); }}
+              onKeyDown={e => {}}
               style={{ flex: 1 }}
             />
killedBy: MessagingPage Component Tests Enter key in composer triggers sendMessage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, "Hello Enter"

Number of calls: 0

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:427:37
               placeholder="Write a message…"
               value={draft}
               onChange={e => setDraft(e.target.value)}
-              onKeyDown={e => { if (e.key === 'Enter') sendMessage(); }}
+              onKeyDown={e => { if (e.key !== 'Enter') sendMessage(); }}
               style={{ flex: 1 }}
             />
killedBy: MessagingPage Component Tests Enter key in composer triggers sendMessage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, "Hello Enter"

Number of calls: 0

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:455:7
   onPreviewChange,
   onInsert,
 }) {
-  if (!state) return null;
+  if (state) return null;
 
   const tips = state.goal ? (_OUTREACH_TIPS[state.goal] || []) : [];
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:455:7
   onPreviewChange,
   onInsert,
 }) {
-  if (!state) return null;
+  if (true) return null;
 
   const tips = state.goal ? (_OUTREACH_TIPS[state.goal] || []) : [];
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:457:30
 }) {
   if (!state) return null;
 
-  const tips = state.goal ? (_OUTREACH_TIPS[state.goal] || []) : [];
+  const tips = state.goal ? (false) : [];
 
   const variants = state.goal ? (_OUTREACH_TEMPLATES[state.goal] || []) : [];
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TypeError: tips.map is not a function

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:457:30
 }) {
   if (!state) return null;
 
-  const tips = state.goal ? (_OUTREACH_TIPS[state.goal] || []) : [];
+  const tips = state.goal ? (true) : [];
 
   const variants = state.goal ? (_OUTREACH_TEMPLATES[state.goal] || []) : [];
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TypeError: tips.map is not a function

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:459:34
 
   const tips = state.goal ? (_OUTREACH_TIPS[state.goal] || []) : [];
 
-  const variants = state.goal ? (_OUTREACH_TEMPLATES[state.goal] || []) : [];
+  const variants = state.goal ? (true) : [];
   const tone = variants.length ? variants[state.variantIdx % variants.length].tone : '—';
   const variantLabel = variants.length ? `v${state.variantIdx + 1} of ${variants.length}` : '';
killedBy: MessagingPage Component Tests selectGoal resets step:2 and variantIdx:0
statusReason: TestingLibraryElementError: Unable to find an element with the text: v2 of 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:459:34
 
   const tips = state.goal ? (_OUTREACH_TIPS[state.goal] || []) : [];
 
-  const variants = state.goal ? (_OUTREACH_TEMPLATES[state.goal] || []) : [];
+  const variants = state.goal ? (_OUTREACH_TEMPLATES[state.goal] && []) : [];
   const tone = variants.length ? variants[state.variantIdx % variants.length].tone : '—';
   const variantLabel = variants.length ? `v${state.variantIdx + 1} of ${variants.length}` : '';
killedBy: MessagingPage Component Tests selectGoal resets step:2 and variantIdx:0
statusReason: TestingLibraryElementError: Unable to find an element with the text: v2 of 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ArithmeticOperator
js/components/pages/MessagingPage.js:460:43
   const tips = state.goal ? (_OUTREACH_TIPS[state.goal] || []) : [];
 
   const variants = state.goal ? (_OUTREACH_TEMPLATES[state.goal] || []) : [];
-  const tone = variants.length ? variants[state.variantIdx % variants.length].tone : '—';
+  const tone = variants.length ? variants[state.variantIdx * variants.length].tone : '—';
   const variantLabel = variants.length ? `v${state.variantIdx + 1} of ${variants.length}` : '';
 
killedBy: MessagingPage Component Tests Uses variantIdx modulo to wrap around variants seamlessly
statusReason: TypeError: Cannot read properties of undefined (reading 'tone')

[Killed] ArithmeticOperator
js/components/pages/MessagingPage.js:461:46
 
   const variants = state.goal ? (_OUTREACH_TEMPLATES[state.goal] || []) : [];
   const tone = variants.length ? variants[state.variantIdx % variants.length].tone : '—';
-  const variantLabel = variants.length ? `v${state.variantIdx + 1} of ${variants.length}` : '';
+  const variantLabel = variants.length ? `v${state.variantIdx - 1} of ${variants.length}` : '';
 
   return (
killedBy: MessagingPage Component Tests selectGoal resets step:2 and variantIdx:0
statusReason: TestingLibraryElementError: Unable to find an element with the text: v2 of 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] EqualityOperator
js/components/pages/MessagingPage.js:470:52
           <span style={{ fontSize: 15 }}></span>
           <span className="li-msg-guide__title">Outreach Guide</span>
           <div className="li-msg-guide__dots">
-            <div className={'li-msg-guide__dot' + (state.step === 1 ? ' active' : ' done')}><span>1</span></div>
+            <div className={'li-msg-guide__dot' + (state.step !== 1 ? ' active' : ' done')}><span>1</span></div>
             <div className="li-msg-guide__dot-line"></div>
             <div className={'li-msg-guide__dot' + (state.step === 2 ? ' active' : state.step > 2 ? ' done' : '')}><span>2</span></div>

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:470:52
           <span style={{ fontSize: 15 }}></span>
           <span className="li-msg-guide__title">Outreach Guide</span>
           <div className="li-msg-guide__dots">
-            <div className={'li-msg-guide__dot' + (state.step === 1 ? ' active' : ' done')}><span>1</span></div>
+            <div className={'li-msg-guide__dot' + (true ? ' active' : ' done')}><span>1</span></div>
             <div className="li-msg-guide__dot-line"></div>
             <div className={'li-msg-guide__dot' + (state.step === 2 ? ' active' : state.step > 2 ? ' done' : '')}><span>2</span></div>

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:472:83
           <div className="li-msg-guide__dots">
             <div className={'li-msg-guide__dot' + (state.step === 1 ? ' active' : ' done')}><span>1</span></div>
             <div className="li-msg-guide__dot-line"></div>
-            <div className={'li-msg-guide__dot' + (state.step === 2 ? ' active' : state.step > 2 ? ' done' : '')}><span>2</span></div>
+            <div className={'li-msg-guide__dot' + (state.step === 2 ? ' active' : true ? ' done' : '')}><span>2</span></div>
             <div className="li-msg-guide__dot-line"></div>
             <div className={'li-msg-guide__dot' + (state.step === 3 ? ' active' : '')}><span>3</span></div>
