[Survived] EqualityOperator
js/components/pages/MessagingPage.js:472:83
           <div className="li-msg-guide__dots">
             <div className={'li-msg-guide__dot' + (state.step === 1 ? ' active' : ' done')}><span>1</span></div>
             <div className="li-msg-guide__dot-line"></div>
-            <div className={'li-msg-guide__dot' + (state.step === 2 ? ' active' : state.step > 2 ? ' done' : '')}><span>2</span></div>
+            <div className={'li-msg-guide__dot' + (state.step === 2 ? ' active' : state.step >= 2 ? ' done' : '')}><span>2</span></div>
             <div className="li-msg-guide__dot-line"></div>
             <div className={'li-msg-guide__dot' + (state.step === 3 ? ' active' : '')}><span>3</span></div>

[Survived] EqualityOperator
js/components/pages/MessagingPage.js:474:52
             <div className="li-msg-guide__dot-line"></div>
             <div className={'li-msg-guide__dot' + (state.step === 2 ? ' active' : state.step > 2 ? ' done' : '')}><span>2</span></div>
             <div className="li-msg-guide__dot-line"></div>
-            <div className={'li-msg-guide__dot' + (state.step === 3 ? ' active' : '')}><span>3</span></div>
+            <div className={'li-msg-guide__dot' + (state.step !== 3 ? ' active' : '')}><span>3</span></div>
           </div>
         </div>

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:474:52
             <div className="li-msg-guide__dot-line"></div>
             <div className={'li-msg-guide__dot' + (state.step === 2 ? ' active' : state.step > 2 ? ' done' : '')}><span>2</span></div>
             <div className="li-msg-guide__dot-line"></div>
-            <div className={'li-msg-guide__dot' + (state.step === 3 ? ' active' : '')}><span>3</span></div>
+            <div className={'li-msg-guide__dot' + (true ? ' active' : '')}><span>3</span></div>
           </div>
         </div>

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:482:12
 
       <div className="li-msg-guide__body">
         <div className="li-msg-guide__steps">
-          {state.step === 1 && (
+          {state.step !== 1 && (
             <div className="li-msg-guide__step">
               <div className="li-msg-guide__step-label">What’s the purpose of your message?</div>
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:482:12
 
       <div className="li-msg-guide__body">
         <div className="li-msg-guide__steps">
-          {state.step === 1 && (
-            <div className="li-msg-guide__step">
-              <div className="li-msg-guide__step-label">What’s the purpose of your message?</div>
-              <div className="li-msg-guide__goals">
-                {_OUTREACH_GOALS.map(g => (
-                  <div
-                    key={g.key}
-                    className={'li-msg-guide__goal-tile' + (state.goal === g.key ? ' selected' : '')}
-                    onClick={() => onSelectGoal(g.key)}
-                    role="button"
-                    tabIndex={0}
-                    onKeyDown={(e) => { if (e.key === 'Enter') onSelectGoal(g.key); }}
-                  >
-                    <span className="li-msg-guide__goal-icon">{g.icon}</span>
-                    <span className="li-msg-guide__goal-label">{g.label}</span>
-                    <span className="li-msg-guide__goal-desc">{g.desc}</span>
-                  </div>
-                ))}
-              </div>
-            </div>
-          )}
+          {false}
 
           {state.step === 2 && (
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: TestingLibraryElementError: Unable to find an element with the text: What’s the purpose of your message?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:486:38
             <div className="li-msg-guide__step">
               <div className="li-msg-guide__step-label">What’s the purpose of your message?</div>
               <div className="li-msg-guide__goals">
-                {_OUTREACH_GOALS.map(g => (
-                  <div
-                    key={g.key}
-                    className={'li-msg-guide__goal-tile' + (state.goal === g.key ? ' selected' : '')}
-                    onClick={() => onSelectGoal(g.key)}
-                    role="button"
-                    tabIndex={0}
-                    onKeyDown={(e) => { if (e.key === 'Enter') onSelectGoal(g.key); }}
-                  >
-                    <span className="li-msg-guide__goal-icon">{g.icon}</span>
-                    <span className="li-msg-guide__goal-label">{g.label}</span>
-                    <span className="li-msg-guide__goal-desc">{g.desc}</span>
-                  </div>
-                ))}
+                {_OUTREACH_GOALS.map(() => undefined)}
               </div>
             </div>
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Ask for Advice. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:489:61
                 {_OUTREACH_GOALS.map(g => (
                   <div
                     key={g.key}
-                    className={'li-msg-guide__goal-tile' + (state.goal === g.key ? ' selected' : '')}
+                    className={'li-msg-guide__goal-tile' + (true ? ' selected' : '')}
                     onClick={() => onSelectGoal(g.key)}
                     role="button"

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:489:61
                 {_OUTREACH_GOALS.map(g => (
                   <div
                     key={g.key}
-                    className={'li-msg-guide__goal-tile' + (state.goal === g.key ? ' selected' : '')}
+                    className={'li-msg-guide__goal-tile' + (false ? ' selected' : '')}
                     onClick={() => onSelectGoal(g.key)}
                     role="button"

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:490:30
                   <div
                     key={g.key}
                     className={'li-msg-guide__goal-tile' + (state.goal === g.key ? ' selected' : '')}
-                    onClick={() => onSelectGoal(g.key)}
+                    onClick={() => undefined}
                     role="button"
                     tabIndex={0}
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:493:45
                     onClick={() => onSelectGoal(g.key)}
                     role="button"
                     tabIndex={0}
-                    onKeyDown={(e) => { if (e.key === 'Enter') onSelectGoal(g.key); }}
+                    onKeyDown={(e) => { if (false) onSelectGoal(g.key); }}
                   >
                     <span className="li-msg-guide__goal-icon">{g.icon}</span>
killedBy: MessagingPage Component Tests Keyboard Enter on goal tile selects the goal
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:493:45
                     onClick={() => onSelectGoal(g.key)}
                     role="button"
                     tabIndex={0}
-                    onKeyDown={(e) => { if (e.key === 'Enter') onSelectGoal(g.key); }}
+                    onKeyDown={(e) => { if (e.key !== 'Enter') onSelectGoal(g.key); }}
                   >
                     <span className="li-msg-guide__goal-icon">{g.icon}</span>
killedBy: MessagingPage Component Tests Keyboard Enter on goal tile selects the goal
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:504:12
             </div>
           )}
 
-          {state.step === 2 && (
-            <div className="li-msg-guide__step">
-              <div className="li-msg-guide__step-label">Personalize your message</div>
-              <div className="li-msg-guide__fields">
-                <Field label="Their first name" value={state.details.recipient} onChange={(v) => onDetailsChange({ recipient: v })} />
-                <Field label="Your name / major" value={state.details.yourRole} onChange={(v) => onDetailsChange({ yourRole: v })} />
-                <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
-                <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({ company: v })} />
-                <Field label="Role (optional)" value={state.details.role} onChange={(v) => onDetailsChange({ role: v })} />
-                <Field label="Context (optional)" value={state.details.context} onChange={(v) => onDetailsChange({ context: v })} />
-              </div>
-            </div>
-          )}
+          {false}
 
           {state.step === 3 && (
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:504:12
             </div>
           )}
 
-          {state.step === 2 && (
-            <div className="li-msg-guide__step">
-              <div className="li-msg-guide__step-label">Personalize your message</div>
-              <div className="li-msg-guide__fields">
-                <Field label="Their first name" value={state.details.recipient} onChange={(v) => onDetailsChange({ recipient: v })} />
-                <Field label="Your name / major" value={state.details.yourRole} onChange={(v) => onDetailsChange({ yourRole: v })} />
-                <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
-                <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({ company: v })} />
-                <Field label="Role (optional)" value={state.details.role} onChange={(v) => onDetailsChange({ role: v })} />
-                <Field label="Context (optional)" value={state.details.context} onChange={(v) => onDetailsChange({ context: v })} />
-              </div>
-            </div>
-          )}
+          {true}
 
           {state.step === 3 && (
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Personalize your message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:508:91
             <div className="li-msg-guide__step">
               <div className="li-msg-guide__step-label">Personalize your message</div>
               <div className="li-msg-guide__fields">
-                <Field label="Their first name" value={state.details.recipient} onChange={(v) => onDetailsChange({ recipient: v })} />
+                <Field label="Their first name" value={state.details.recipient} onChange={() => undefined} />
                 <Field label="Your name / major" value={state.details.yourRole} onChange={(v) => onDetailsChange({ yourRole: v })} />
                 <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    "Hi [Name],·
I saw the [role] opening at [Company] and I’m really interested. I’m [your name/major] with experience in [skill/area].·
Would you be open to a quick chat about the team and what you look for in candidates?"

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:509:91
               <div className="li-msg-guide__step-label">Personalize your message</div>
               <div className="li-msg-guide__fields">
                 <Field label="Their first name" value={state.details.recipient} onChange={(v) => onDetailsChange({ recipient: v })} />
-                <Field label="Your name / major" value={state.details.yourRole} onChange={(v) => onDetailsChange({ yourRole: v })} />
+                <Field label="Your name / major" value={state.details.yourRole} onChange={() => undefined} />
                 <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
                 <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({ company: v })} />
killedBy: MessagingPage Component Tests setGuideDetailsPatch deep-merges into details only, preserves other detail fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Software Eng"
Received: ""

[Survived] ArrowFunction
js/components/pages/MessagingPage.js:510:93
               <div className="li-msg-guide__fields">
                 <Field label="Their first name" value={state.details.recipient} onChange={(v) => onDetailsChange({ recipient: v })} />
                 <Field label="Your name / major" value={state.details.yourRole} onChange={(v) => onDetailsChange({ yourRole: v })} />
-                <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
+                <Field label="Their field / industry" value={state.details.field} onChange={() => undefined} />
                 <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({ company: v })} />
                 <Field label="Role (optional)" value={state.details.role} onChange={(v) => onDetailsChange({ role: v })} />

[Survived] ArrowFunction
js/components/pages/MessagingPage.js:511:91
                 <Field label="Their first name" value={state.details.recipient} onChange={(v) => onDetailsChange({ recipient: v })} />
                 <Field label="Your name / major" value={state.details.yourRole} onChange={(v) => onDetailsChange({ yourRole: v })} />
                 <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
-                <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({ company: v })} />
+                <Field label="Company (optional)" value={state.details.company} onChange={() => undefined} />
                 <Field label="Role (optional)" value={state.details.role} onChange={(v) => onDetailsChange({ role: v })} />
                 <Field label="Context (optional)" value={state.details.context} onChange={(v) => onDetailsChange({ context: v })} />

[Survived] ObjectLiteral
js/components/pages/MessagingPage.js:511:114
                 <Field label="Their first name" value={state.details.recipient} onChange={(v) => onDetailsChange({ recipient: v })} />
                 <Field label="Your name / major" value={state.details.yourRole} onChange={(v) => onDetailsChange({ yourRole: v })} />
                 <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
-                <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({ company: v })} />
+                <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({})} />
                 <Field label="Role (optional)" value={state.details.role} onChange={(v) => onDetailsChange({ role: v })} />
                 <Field label="Context (optional)" value={state.details.context} onChange={(v) => onDetailsChange({ context: v })} />

[Survived] ArrowFunction
js/components/pages/MessagingPage.js:512:85
                 <Field label="Your name / major" value={state.details.yourRole} onChange={(v) => onDetailsChange({ yourRole: v })} />
                 <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
                 <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({ company: v })} />
-                <Field label="Role (optional)" value={state.details.role} onChange={(v) => onDetailsChange({ role: v })} />
+                <Field label="Role (optional)" value={state.details.role} onChange={() => undefined} />
                 <Field label="Context (optional)" value={state.details.context} onChange={(v) => onDetailsChange({ context: v })} />
               </div>

[Survived] ObjectLiteral
js/components/pages/MessagingPage.js:512:108
                 <Field label="Your name / major" value={state.details.yourRole} onChange={(v) => onDetailsChange({ yourRole: v })} />
                 <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
                 <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({ company: v })} />
-                <Field label="Role (optional)" value={state.details.role} onChange={(v) => onDetailsChange({ role: v })} />
+                <Field label="Role (optional)" value={state.details.role} onChange={(v) => onDetailsChange({})} />
                 <Field label="Context (optional)" value={state.details.context} onChange={(v) => onDetailsChange({ context: v })} />
               </div>

[Survived] ArrowFunction
js/components/pages/MessagingPage.js:513:91
                 <Field label="Their field / industry" value={state.details.field} onChange={(v) => onDetailsChange({ field: v })} />
                 <Field label="Company (optional)" value={state.details.company} onChange={(v) => onDetailsChange({ company: v })} />
                 <Field label="Role (optional)" value={state.details.role} onChange={(v) => onDetailsChange({ role: v })} />
-                <Field label="Context (optional)" value={state.details.context} onChange={(v) => onDetailsChange({ context: v })} />
+                <Field label="Context (optional)" value={state.details.context} onChange={() => undefined} />
               </div>
             </div>

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:518:12
             </div>
           )}
 
-          {state.step === 3 && (
+          {state.step !== 3 && (
             <div className="li-msg-guide__step">
               <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', gap: 8, marginBottom: 8 }}>
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:518:12
             </div>
           )}
 
-          {state.step === 3 && (
-            <div className="li-msg-guide__step">
-              <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', gap: 8, marginBottom: 8 }}>
-                <div className="li-msg-guide__step-label" style={{ margin: 0 }}>Review & edit your message</div>
-                <div style={{ display: 'flex', alignItems: 'center', gap: 8 }}>
-                  <span className="li-msg-guide__tone-badge">{tone}</span>
-                  <span style={{ fontSize: 11, color: 'var(--text-3)' }}>{variantLabel}</span>
-                  <button className="li-msg-guide__cycle-btn" onClick={onCycle} title="Try another version">Try another</button>
-                </div>
-              </div>
-
-              <textarea
-                className="li-msg-guide__preview"
-                value={state.preview || ''}
-                onChange={(e) => onPreviewChange(e.target.value)}
-                rows={6}
-                placeholder="Your message will appear here…"
-              />
-              <div style={{ display: 'flex', justifyContent: 'flex-end', marginTop: 8 }}>
-                <button className="li-msg-guide__insert-btn" onClick={onInsert}>Use this message →</button>
-              </div>
-            </div>
-          )}
+          {true}
         </div>
 
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: Your message will appear here…

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] StringLiteral
js/components/pages/MessagingPage.js:522:60
             <div className="li-msg-guide__step">
               <div style={{ display: 'flex', alignItems: 'center', justifyContent: 'space-between', gap: 8, marginBottom: 8 }}>
                 <div className="li-msg-guide__step-label" style={{ margin: 0 }}>Review & edit your message</div>
-                <div style={{ display: 'flex', alignItems: 'center', gap: 8 }}>
+                <div style={{ display: 'flex', alignItems: "", gap: 8 }}>
                   <span className="li-msg-guide__tone-badge">{tone}</span>
                   <span style={{ fontSize: 11, color: 'var(--text-3)' }}>{variantLabel}</span>

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:531:24
 
               <textarea
                 className="li-msg-guide__preview"
-                value={state.preview || ''}
+                value={true}
                 onChange={(e) => onPreviewChange(e.target.value)}
                 rows={6}
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    "true"

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:531:24
 
               <textarea
                 className="li-msg-guide__preview"
-                value={state.preview || ''}
+                value={false}
                 onChange={(e) => onPreviewChange(e.target.value)}
                 rows={6}
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    "false"

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:532:27
               <textarea
                 className="li-msg-guide__preview"
                 value={state.preview || ''}
-                onChange={(e) => onPreviewChange(e.target.value)}
+                onChange={() => undefined}
                 rows={6}
                 placeholder="Your message will appear here…"
killedBy: MessagingPage Component Tests updateGuidePreviewManual overrides state.preview explicitly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 5

- Totally Custom Message
+ Hi [Name],
+

[Survived] BooleanLiteral
js/components/pages/MessagingPage.js:546:14
         <div className="li-msg-guide__tips-panel">
           <div className="li-msg-guide__tips-heading">Quick Tips</div>
           <div className="li-msg-guide__tips-list">
-            {!state.goal ? (
+            {state.goal ? (
               <div style={{ fontSize: 11, color: 'var(--text-3)', fontStyle: 'italic', lineHeight: 1.5 }}>
                 Pick a goal to see tailored tips

[Survived] StringLiteral
js/components/pages/MessagingPage.js:547:50
           <div className="li-msg-guide__tips-heading">Quick Tips</div>
           <div className="li-msg-guide__tips-list">
             {!state.goal ? (
-              <div style={{ fontSize: 11, color: 'var(--text-3)', fontStyle: 'italic', lineHeight: 1.5 }}>
+              <div style={{ fontSize: 11, color: "", fontStyle: 'italic', lineHeight: 1.5 }}>
                 Pick a goal to see tailored tips
               </div>

[Survived] StringLiteral
js/components/pages/MessagingPage.js:547:78
           <div className="li-msg-guide__tips-heading">Quick Tips</div>
           <div className="li-msg-guide__tips-list">
             {!state.goal ? (
-              <div style={{ fontSize: 11, color: 'var(--text-3)', fontStyle: 'italic', lineHeight: 1.5 }}>
+              <div style={{ fontSize: 11, color: 'var(--text-3)', fontStyle: "", lineHeight: 1.5 }}>
                 Pick a goal to see tailored tips
               </div>

[Survived] ArrowFunction
js/components/pages/MessagingPage.js:550:26
               <div style={{ fontSize: 11, color: 'var(--text-3)', fontStyle: 'italic', lineHeight: 1.5 }}>
                 Pick a goal to see tailored tips
               </div>
-            ) : tips.map((t, idx) => (
-              <div key={idx} className="li-msg-guide__tip">- {t}</div>
-            ))}
+            ) : tips.map(() => undefined)}
           </div>
         </div>

[Survived] EqualityOperator
js/components/pages/MessagingPage.js:558:72
       </div>
 
       <div className="li-msg-guide__footer">
-        <button className="li-msg-guide__nav-btn" style={{ visibility: state.step > 1 ? 'visible' : 'hidden' }} onClick={onBack}>
+        <button className="li-msg-guide__nav-btn" style={{ visibility: state.step <= 1 ? 'visible' : 'hidden' }} onClick={onBack}>
           ← Back
         </button>

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:558:72
       </div>
 
       <div className="li-msg-guide__footer">
-        <button className="li-msg-guide__nav-btn" style={{ visibility: state.step > 1 ? 'visible' : 'hidden' }} onClick={onBack}>
+        <button className="li-msg-guide__nav-btn" style={{ visibility: false ? 'visible' : 'hidden' }} onClick={onBack}>
           ← Back
         </button>

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:563:12
         </button>
         <div style={{ flex: 1 }} />
         <button className="li-msg-guide__nav-btn primary" onClick={onNext}>
-          {state.step === 3 ? 'Done' : 'Next →'}
+          {true ? 'Done' : 'Next →'}
         </button>
       </div>
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the text: Next →. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >
