[Killed] EqualityOperator
js/components/pages/MessagingPage.js:563:12
         </button>
         <div style={{ flex: 1 }} />
         <button className="li-msg-guide__nav-btn primary" onClick={onNext}>
-          {state.step === 3 ? 'Done' : 'Next →'}
+          {state.step !== 3 ? 'Done' : 'Next →'}
         </button>
       </div>
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the text: Next →. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] BlockStatement
js/components/pages/MessagingPage.js:570:44
   );
 }
 
-function Field({ label, value, onChange }) {
-  const id = React.useMemo(() => 'field-' + Math.random().toString(36).substr(2, 9), []);
-  return (
-    <div className="li-msg-guide__field-row">
-      <label htmlFor={id}>{label}</label>
-      <input id={id} className="li-msg-guide__input" value={value || ''} onChange={(e) => onChange(e.target.value)} />
-    </div>
-  );
-}
+function Field({ label, value, onChange }) {}
 
 /* ─────────────────────────────────────────────────────────────
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the text: Their first name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:571:28
 }
 
 function Field({ label, value, onChange }) {
-  const id = React.useMemo(() => 'field-' + Math.random().toString(36).substr(2, 9), []);
+  const id = React.useMemo(() => undefined, []);
   return (
     <div className="li-msg-guide__field-row">
killedBy: computeGuidePreview() pure function Branch Coverage Booster Exercises all Step 2 field inputs
statusReason: TestingLibraryElementError: Found a label with the text of: Their first name, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] MethodExpression
js/components/pages/MessagingPage.js:571:45
 }
 
 function Field({ label, value, onChange }) {
-  const id = React.useMemo(() => 'field-' + Math.random().toString(36).substr(2, 9), []);
+  const id = React.useMemo(() => 'field-' + Math.random().toString(36), []);
   return (
     <div className="li-msg-guide__field-row">

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:575:61
   return (
     <div className="li-msg-guide__field-row">
       <label htmlFor={id}>{label}</label>
-      <input id={id} className="li-msg-guide__input" value={value || ''} onChange={(e) => onChange(e.target.value)} />
+      <input id={id} className="li-msg-guide__input" value={true} onChange={(e) => onChange(e.target.value)} />
     </div>
   );
killedBy: MessagingPage Component Tests setGuideDetailsPatch deep-merges into details only, preserves other detail fields
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Frank"
Received: "true"

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:575:84
   return (
     <div className="li-msg-guide__field-row">
       <label htmlFor={id}>{label}</label>
-      <input id={id} className="li-msg-guide__input" value={value || ''} onChange={(e) => onChange(e.target.value)} />
+      <input id={id} className="li-msg-guide__input" value={value || ''} onChange={() => undefined} />
     </div>
   );
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    "Hi [Name],·
I saw the [role] opening at [Company] and I’m really interested. I’m [your name/major] with experience in [skill/area].·
Would you be open to a quick chat about the team and what you look for in candidates?"

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:586:17
 function ProfileReadinessPanel({ readiness, loading, error, onClose, onRefresh }) {
   const s = readiness;
 
-  const score = s?.score ?? 0;
+  const score = s?.score && 0;
   const status = score >= 80 ? 'good' : score >= 70 ? 'warn' : 'bad';
   const statusLabel = score >= 80 ? 'Ready' : score >= 70 ? 'Almost there' : 'Needs improvement';
killedBy: MessagingPage Component Tests Sets readiness from API on success
statusReason: TestingLibraryElementError: Unable to find an element with the text: 85. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] OptionalChaining
js/components/pages/MessagingPage.js:586:17
 function ProfileReadinessPanel({ readiness, loading, error, onClose, onRefresh }) {
   const s = readiness;
 
-  const score = s?.score ?? 0;
+  const score = s.score ?? 0;
   const status = score >= 80 ? 'good' : score >= 70 ? 'warn' : 'bad';
   const statusLabel = score >= 80 ? 'Ready' : score >= 70 ? 'Almost there' : 'Needs improvement';
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TypeError: Cannot read properties of null (reading 'score')

[Survived] EqualityOperator
js/components/pages/MessagingPage.js:587:18
   const s = readiness;
 
   const score = s?.score ?? 0;
-  const status = score >= 80 ? 'good' : score >= 70 ? 'warn' : 'bad';
+  const status = score > 80 ? 'good' : score >= 70 ? 'warn' : 'bad';
   const statusLabel = score >= 80 ? 'Ready' : score >= 70 ? 'Almost there' : 'Needs improvement';
 

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:587:18
   const s = readiness;
 
   const score = s?.score ?? 0;
-  const status = score >= 80 ? 'good' : score >= 70 ? 'warn' : 'bad';
+  const status = true ? 'good' : score >= 70 ? 'warn' : 'bad';
   const statusLabel = score >= 80 ? 'Ready' : score >= 70 ? 'Almost there' : 'Needs improvement';
 

[Survived] EqualityOperator
js/components/pages/MessagingPage.js:588:23
 
   const score = s?.score ?? 0;
   const status = score >= 80 ? 'good' : score >= 70 ? 'warn' : 'bad';
-  const statusLabel = score >= 80 ? 'Ready' : score >= 70 ? 'Almost there' : 'Needs improvement';
+  const statusLabel = score > 80 ? 'Ready' : score >= 70 ? 'Almost there' : 'Needs improvement';
 
   // Ring math

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:588:23
 
   const score = s?.score ?? 0;
   const status = score >= 80 ? 'good' : score >= 70 ? 'warn' : 'bad';
-  const statusLabel = score >= 80 ? 'Ready' : score >= 70 ? 'Almost there' : 'Needs improvement';
+  const statusLabel = true ? 'Ready' : score >= 70 ? 'Almost there' : 'Needs improvement';
 
   // Ring math

[Survived] ArithmeticOperator
js/components/pages/MessagingPage.js:592:16
 
   // Ring math
   const r = 44;
-  const circ = 2 * Math.PI * r;
+  const circ = 2 / Math.PI * r;
   const offset = circ * (1 - (score / 100));
 

[Survived] ArithmeticOperator
js/components/pages/MessagingPage.js:592:16
 
   // Ring math
   const r = 44;
-  const circ = 2 * Math.PI * r;
+  const circ = 2 * Math.PI / r;
   const offset = circ * (1 - (score / 100));
 

[Survived] ArithmeticOperator
js/components/pages/MessagingPage.js:593:18
   // Ring math
   const r = 44;
   const circ = 2 * Math.PI * r;
-  const offset = circ * (1 - (score / 100));
+  const offset = circ / (1 - score / 100);
 
   return (

[Survived] ArithmeticOperator
js/components/pages/MessagingPage.js:593:26
   // Ring math
   const r = 44;
   const circ = 2 * Math.PI * r;
-  const offset = circ * (1 - (score / 100));
+  const offset = circ * (1 + score / 100);
 
   return (

[Survived] StringLiteral
js/components/pages/MessagingPage.js:598:32
   return (
     <div className="li-msg-score" role="complementary" aria-label="Profile readiness score">
       <div className="li-msg-score__header">
-        <div style={{ display: 'flex', alignItems: 'center', gap: 8 }}>
+        <div style={{ display: "", alignItems: 'center', gap: 8 }}>
           <span style={{ fontSize: 15 }}>Score</span>
           <span className="li-msg-score__title">Profile Readiness</span>

[Survived] ObjectLiteral
js/components/pages/MessagingPage.js:599:24
     <div className="li-msg-score" role="complementary" aria-label="Profile readiness score">
       <div className="li-msg-score__header">
         <div style={{ display: 'flex', alignItems: 'center', gap: 8 }}>
-          <span style={{ fontSize: 15 }}>Score</span>
+          <span style={{}}>Score</span>
           <span className="li-msg-score__title">Profile Readiness</span>
           <span className="li-msg-score__subtitle">Improve your profile before outreach</span>

[Survived] StringLiteral
js/components/pages/MessagingPage.js:608:45
 
       <div className="li-msg-score__body">
         {loading ? (
-          <div style={{ padding: 14, color: 'var(--text-3)' }}>Calculating score…</div>
+          <div style={{ padding: 14, color: "" }}>Calculating score…</div>
         ) : !s ? (
           <div style={{ padding: 14, color: 'var(--text-3)' }}>No score available.</div>

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:609:13
       <div className="li-msg-score__body">
         {loading ? (
           <div style={{ padding: 14, color: 'var(--text-3)' }}>Calculating score…</div>
-        ) : !s ? (
+        ) : s ? (
           <div style={{ padding: 14, color: 'var(--text-3)' }}>No score available.</div>
         ) : (
killedBy: MessagingPage Component Tests Sets readiness from API on success
statusReason: TestingLibraryElementError: Unable to find an element with the text: 85. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[NoCoverage] StringLiteral
js/components/pages/MessagingPage.js:610:45
         {loading ? (
           <div style={{ padding: 14, color: 'var(--text-3)' }}>Calculating score…</div>
         ) : !s ? (
-          <div style={{ padding: 14, color: 'var(--text-3)' }}>No score available.</div>
+          <div style={{ padding: 14, color: "" }}>No score available.</div>
         ) : (
           <div className="li-msg-score__grid">

[Survived] StringLiteral
js/components/pages/MessagingPage.js:614:31
         ) : (
           <div className="li-msg-score__grid">
             <div className="li-msg-score__left">
-              <div className={'li-msg-score__summary ' + status}>
+              <div className={"" + status}>
                 <div className="li-msg-score__ring">
                   <svg width="108" height="108" viewBox="0 0 108 108" aria-hidden="true">

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:622:31
                       cx="54"
                       cy="54"
                       r={r}
-                      stroke={status === 'good' ? 'var(--green)' : status === 'warn' ? 'var(--gold-dark)' : 'var(--red)'}
+                      stroke={true ? 'var(--green)' : status === 'warn' ? 'var(--gold-dark)' : 'var(--red)'}
                       strokeWidth="8"
                       fill="none"

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:622:68
                       cx="54"
                       cy="54"
                       r={r}
-                      stroke={status === 'good' ? 'var(--green)' : status === 'warn' ? 'var(--gold-dark)' : 'var(--red)'}
+                      stroke={status === 'good' ? 'var(--green)' : false ? 'var(--gold-dark)' : 'var(--red)'}
                       strokeWidth="8"
                       fill="none"

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:642:18
                 </div>
 
                 <div className="li-msg-score__sub">Tightening your profile usually increases reply rates.</div>
-                {!!error && <div className="li-msg-score__api-note">{error}</div>}
+                {!error && <div className="li-msg-score__api-note">{error}</div>}
               </div>
 
killedBy: MessagingPage Component Tests Uses mock fallback and sets readinessError on failure
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backend not running — using mocked score. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:646:19
               </div>
 
               <div className="li-msg-score__breakdown">
-                {(s.sections || []).map(sec => {
+                {(false).map(sec => {
                   const c = sec.score >= 80 ? 'good' : sec.score >= 70 ? 'warn' : 'bad';
                   return (
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:646:19
               </div>
 
               <div className="li-msg-score__breakdown">
-                {(s.sections || []).map(sec => {
+                {(true).map(sec => {
                   const c = sec.score >= 80 ? 'good' : sec.score >= 70 ? 'warn' : 'bad';
                   return (
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Survived] EqualityOperator
js/components/pages/MessagingPage.js:647:29
 
               <div className="li-msg-score__breakdown">
                 {(s.sections || []).map(sec => {
-                  const c = sec.score >= 80 ? 'good' : sec.score >= 70 ? 'warn' : 'bad';
+                  const c = sec.score > 80 ? 'good' : sec.score >= 70 ? 'warn' : 'bad';
                   return (
                     <div key={sec.key} className="li-msg-score__bar">

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:647:29
 
               <div className="li-msg-score__breakdown">
                 {(s.sections || []).map(sec => {
-                  const c = sec.score >= 80 ? 'good' : sec.score >= 70 ? 'warn' : 'bad';
+                  const c = true ? 'good' : sec.score >= 70 ? 'warn' : 'bad';
                   return (
                     <div key={sec.key} className="li-msg-score__bar">

[Survived] ObjectLiteral
js/components/pages/MessagingPage.js:652:79
                     <div key={sec.key} className="li-msg-score__bar">
                       <div className="li-msg-score__bar-label">{sec.label}</div>
                       <div className="li-msg-score__bar-track">
-                        <div className={'li-msg-score__bar-fill ' + c} style={{ width: `${sec.score}%` }} />
+                        <div className={'li-msg-score__bar-fill ' + c} style={{}} />
                       </div>
                       <div className={'li-msg-score__bar-pct ' + c}>{sec.score}%</div>

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:665:21
               <div className="li-msg-score__card">
                 <div className="li-msg-score__card-title">Quick fixes</div>
                 <div className="li-msg-score__fixes">
-                  {(s.fixes || []).map(f => (
+                  {(true).map(f => (
                     <div key={f.key} className="li-msg-score__fix">
                       <div className="li-msg-score__fix-left">
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:665:21
               <div className="li-msg-score__card">
                 <div className="li-msg-score__card-title">Quick fixes</div>
                 <div className="li-msg-score__fixes">
-                  {(s.fixes || []).map(f => (
+                  {(s.fixes && []).map(f => (
                     <div key={f.key} className="li-msg-score__fix">
                       <div className="li-msg-score__fix-left">
killedBy: MessagingPage Component Tests Sets activePanel to 'score' when null
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:671:24
                         <span className={'li-msg-score__dot ' + f.status}></span>
                         <span className="li-msg-score__fix-label">{f.label}</span>
                       </div>
-                      {f.status === 'done' ? (
+                      {false ? (
                         <span className="li-msg-score__done">Done</span>
                       ) : (

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:671:24
                         <span className={'li-msg-score__dot ' + f.status}></span>
                         <span className="li-msg-score__fix-label">{f.label}</span>
                       </div>
-                      {f.status === 'done' ? (
+                      {true ? (
                         <span className="li-msg-score__done">Done</span>
                       ) : (

[Killed] BlockStatement
js/components/pages/MessagingPage.js:682:80
 
                 <div className="li-msg-score__actions">
                   <button className="li-msg-score__btn" onClick={onRefresh}>Refresh score</button>
-                  <button className="li-msg-score__btn primary" onClick={() => { window.location.hash = 'profile'; }}>
+                  <button className="li-msg-score__btn primary" onClick={() => {}}>
                     Go to profile
                   </button>
killedBy: computeGuidePreview() pure function Branch Coverage Booster Exercises window.location.hash branches
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#profile"
Received: ""

[Killed] BlockStatement
js/components/pages/MessagingPage.js:697:69
       </div>
 
       <div className="li-msg-score__footer">
-        <button className="li-msg-score__footer-btn" onClick={() => { window.location.hash = 'profile'; }}>
+        <button className="li-msg-score__footer-btn" onClick={() => {}}>
           Go to profile
         </button>
killedBy: computeGuidePreview() pure function Branch Coverage Booster Exercises window.location.hash branches
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#profile"
Received: ""

[Survived] ArithmeticOperator
js/components/pages/MessagingPage.js:713:33
    Old “mock backend” scoring logic (kept as fallback)
    ───────────────────────────────────────────────────────────── */
 function mockBackendGetProfileReadiness(user, opts = {}) {
-  const jitter = opts.jitter ? (Math.random() * 4 - 2) : 0;
+  const jitter = opts.jitter ? (Math.random() / 4 - 2) : 0;
   const clamp = (n) => Math.max(0, Math.min(100, Math.round(n)));
 

[Survived] ArithmeticOperator
js/components/pages/MessagingPage.js:713:33
    Old “mock backend” scoring logic (kept as fallback)
    ───────────────────────────────────────────────────────────── */
 function mockBackendGetProfileReadiness(user, opts = {}) {
-  const jitter = opts.jitter ? (Math.random() * 4 - 2) : 0;
+  const jitter = opts.jitter ? (Math.random() * 4 + 2) : 0;
   const clamp = (n) => Math.max(0, Math.min(100, Math.round(n)));
 

[Killed] MethodExpression
js/components/pages/MessagingPage.js:714:24
    ───────────────────────────────────────────────────────────── */
 function mockBackendGetProfileReadiness(user, opts = {}) {
   const jitter = opts.jitter ? (Math.random() * 4 - 2) : 0;
-  const clamp = (n) => Math.max(0, Math.min(100, Math.round(n)));
+  const clamp = (n) => Math.min(0, Math.min(100, Math.round(n)));
 
   const sections = [
killedBy: mockBackendGetProfileReadiness() pure function Base scores exact without jitter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
-   67,
-   42,

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:714:17
    ───────────────────────────────────────────────────────────── */
 function mockBackendGetProfileReadiness(user, opts = {}) {
   const jitter = opts.jitter ? (Math.random() * 4 - 2) : 0;
-  const clamp = (n) => Math.max(0, Math.min(100, Math.round(n)));
+  const clamp = () => undefined;
 
   const sections = [
killedBy: mockBackendGetProfileReadiness() pure function Score is clamped 0–100
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:717:5
   const clamp = (n) => Math.max(0, Math.min(100, Math.round(n)));
 
   const sections = [
-    { key: 'photo', label: 'Photo', score: 67 },
+    {},
     { key: 'headline', label: 'Headline', score: 42 },
     { key: 'about', label: 'About', score: 30 },
killedBy: mockBackendGetProfileReadiness() pure function Score is clamped 0–100
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 0
Received:    NaN

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:719:5
   const sections = [
     { key: 'photo', label: 'Photo', score: 67 },
     { key: 'headline', label: 'Headline', score: 42 },
-    { key: 'about', label: 'About', score: 30 },
+    {},
     { key: 'exp', label: 'Experience', score: 60 },
     { key: 'edu', label: 'Education', score: 90 },
killedBy: mockBackendGetProfileReadiness() pure function Score is clamped 0–100
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 0
Received:    NaN

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:721:5
     { key: 'headline', label: 'Headline', score: 42 },
     { key: 'about', label: 'About', score: 30 },
     { key: 'exp', label: 'Experience', score: 60 },
-    { key: 'edu', label: 'Education', score: 90 },
+    {},
     { key: 'skills', label: 'Skills', score: 55 },
   ].map(s => ({ ...s, score: clamp(s.score + jitter) }));
killedBy: mockBackendGetProfileReadiness() pure function Score is clamped 0–100
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 0
Received:    NaN

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:723:9
     { key: 'exp', label: 'Experience', score: 60 },
     { key: 'edu', label: 'Education', score: 90 },
     { key: 'skills', label: 'Skills', score: 55 },
-  ].map(s => ({ ...s, score: clamp(s.score + jitter) }));
+  ].map(() => undefined);
 
   const score = clamp(sections.reduce((a, b) => a + b.score, 0) / sections.length);
killedBy: MessagingPage Component Tests Uses mock fallback and sets readinessError on failure
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backend not running — using mocked score. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0

[Survived] ArithmeticOperator
js/components/pages/MessagingPage.js:723:36
     { key: 'exp', label: 'Experience', score: 60 },
     { key: 'edu', label: 'Education', score: 90 },
     { key: 'skills', label: 'Skills', score: 55 },
-  ].map(s => ({ ...s, score: clamp(s.score + jitter) }));
+  ].map(s => ({ ...s, score: clamp(s.score - jitter) }));
 
   const score = clamp(sections.reduce((a, b) => a + b.score, 0) / sections.length);

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:725:39
     { key: 'skills', label: 'Skills', score: 55 },
   ].map(s => ({ ...s, score: clamp(s.score + jitter) }));
 
-  const score = clamp(sections.reduce((a, b) => a + b.score, 0) / sections.length);
+  const score = clamp(sections.reduce(() => undefined, 0) / sections.length);
 
   const fixes = [
killedBy: mockBackendGetProfileReadiness() pure function Score is clamped 0–100
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 0
Received:    NaN

[Survived] ArithmeticOperator
js/components/pages/MessagingPage.js:725:49
     { key: 'skills', label: 'Skills', score: 55 },
   ].map(s => ({ ...s, score: clamp(s.score + jitter) }));
 
-  const score = clamp(sections.reduce((a, b) => a + b.score, 0) / sections.length);
+  const score = clamp(sections.reduce((a, b) => a - b.score, 0) / sections.length);
 
   const fixes = [

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:728:53
   const score = clamp(sections.reduce((a, b) => a + b.score, 0) / sections.length);
 
   const fixes = [
-    { key: 'photo', label: 'Profile photo', status: score >= 60 ? 'done' : 'warn' },
+    { key: 'photo', label: 'Profile photo', status: true ? 'done' : 'warn' },
     { key: 'headline', label: 'Improve headline', status: 'bad' },
     { key: 'about', label: 'Expand About section', status: 'bad' },

[Survived] EqualityOperator
js/components/pages/MessagingPage.js:728:53
   const score = clamp(sections.reduce((a, b) => a + b.score, 0) / sections.length);
 
   const fixes = [
-    { key: 'photo', label: 'Profile photo', status: score >= 60 ? 'done' : 'warn' },
+    { key: 'photo', label: 'Profile photo', status: score < 60 ? 'done' : 'warn' },
     { key: 'headline', label: 'Improve headline', status: 'bad' },
     { key: 'about', label: 'Expand About section', status: 'bad' },

[Survived] StringLiteral
js/components/pages/MessagingPage.js:730:28
   const fixes = [
     { key: 'photo', label: 'Profile photo', status: score >= 60 ? 'done' : 'warn' },
     { key: 'headline', label: 'Improve headline', status: 'bad' },
-    { key: 'about', label: 'Expand About section', status: 'bad' },
+    { key: 'about', label: "", status: 'bad' },
     { key: 'skills', label: 'Add 5+ skills', status: 'warn' },
     { key: 'exp', label: 'Add metrics in experience', status: 'warn' },

[Killed] StringLiteral
js/components/pages/MessagingPage.js:731:12
     { key: 'photo', label: 'Profile photo', status: score >= 60 ? 'done' : 'warn' },
     { key: 'headline', label: 'Improve headline', status: 'bad' },
     { key: 'about', label: 'Expand About section', status: 'bad' },
-    { key: 'skills', label: 'Add 5+ skills', status: 'warn' },
+    { key: "", label: 'Add 5+ skills', status: 'warn' },
     { key: 'exp', label: 'Add metrics in experience', status: 'warn' },
     { key: 'edu', label: 'Education complete', status: 'done' },
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: skillCount 7 — stays 'warn'
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Survived] StringLiteral
js/components/pages/MessagingPage.js:733:56
     { key: 'about', label: 'Expand About section', status: 'bad' },
     { key: 'skills', label: 'Add 5+ skills', status: 'warn' },
     { key: 'exp', label: 'Add metrics in experience', status: 'warn' },
-    { key: 'edu', label: 'Education complete', status: 'done' },
+    { key: 'edu', label: 'Education complete', status: "" },
   ];
 

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:736:13
     { key: 'edu', label: 'Education complete', status: 'done' },
   ];
 
-  const u = user || {};
+  const u = user && {};
   const headlineLen = (u.headline || '').trim().length;
   const aboutLen = (u.about || '').trim().length;
killedBy: mockBackendGetProfileReadiness() pure function Handles null user without throwing
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of null (reading 'headline')"

      1151 |     })]);
      1152 |     const u = stryMutAct_9fa48("1685") ? user && {} : stryMutAct_9fa48("1684") ? false : stryMutAct_9fa48("1683") ? true : (stryCov_9fa48("1683", "1684", "1685"), user || {});

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:736:13
     { key: 'edu', label: 'Education complete', status: 'done' },
   ];
 
-  const u = user || {};
+  const u = false;
   const headlineLen = (u.headline || '').trim().length;
   const aboutLen = (u.about || '').trim().length;
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: headline length 35 — upgrades to 'warn'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warn"
Received: "bad"
