[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:737:24
   ];
 
   const u = user || {};
-  const headlineLen = (u.headline || '').trim().length;
+  const headlineLen = (true).trim().length;
   const aboutLen = (u.about || '').trim().length;
   const skillCount = Array.isArray(u.skills) ? u.skills.length : (u.skills ? 1 : 0);
killedBy: MessagingPage Component Tests Uses mock fallback and sets readinessError on failure
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backend not running — using mocked score. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:737:24
   ];
 
   const u = user || {};
-  const headlineLen = (u.headline || '').trim().length;
+  const headlineLen = (u.headline && '').trim().length;
   const aboutLen = (u.about || '').trim().length;
   const skillCount = Array.isArray(u.skills) ? u.skills.length : (u.skills ? 1 : 0);
killedBy: MessagingPage Component Tests Uses mock fallback and sets readinessError on failure
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backend not running — using mocked score. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:738:21
 
   const u = user || {};
   const headlineLen = (u.headline || '').trim().length;
-  const aboutLen = (u.about || '').trim().length;
+  const aboutLen = (false).trim().length;
   const skillCount = Array.isArray(u.skills) ? u.skills.length : (u.skills ? 1 : 0);
 
killedBy: MessagingPage Component Tests Uses mock fallback and sets readinessError on failure
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backend not running — using mocked score. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:738:21
 
   const u = user || {};
   const headlineLen = (u.headline || '').trim().length;
-  const aboutLen = (u.about || '').trim().length;
+  const aboutLen = (true).trim().length;
   const skillCount = Array.isArray(u.skills) ? u.skills.length : (u.skills ? 1 : 0);
 
killedBy: MessagingPage Component Tests Uses mock fallback and sets readinessError on failure
statusReason: TestingLibraryElementError: Unable to find an element with the text: Backend not running — using mocked score. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:741:7
   const aboutLen = (u.about || '').trim().length;
   const skillCount = Array.isArray(u.skills) ? u.skills.length : (u.skills ? 1 : 0);
 
-  if (headlineLen >= 35) fixes.find(f => f.key === 'headline').status = 'warn';
+  if (headlineLen > 35) fixes.find(f => f.key === 'headline').status = 'warn';
   if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
   if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: headline length 35 — upgrades to 'warn'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warn"
Received: "bad"

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:741:42
   const aboutLen = (u.about || '').trim().length;
   const skillCount = Array.isArray(u.skills) ? u.skills.length : (u.skills ? 1 : 0);
 
-  if (headlineLen >= 35) fixes.find(f => f.key === 'headline').status = 'warn';
+  if (headlineLen >= 35) fixes.find(f => f.key !== 'headline').status = 'warn';
   if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
   if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: headline length 35 — upgrades to 'warn'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warn"
Received: "bad"

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:742:42
   const skillCount = Array.isArray(u.skills) ? u.skills.length : (u.skills ? 1 : 0);
 
   if (headlineLen >= 35) fixes.find(f => f.key === 'headline').status = 'warn';
-  if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
+  if (headlineLen >= 55) fixes.find(f => f.key !== 'headline').status = 'done';
   if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
   if (aboutLen >= 170) fixes.find(f => f.key === 'about').status = 'done';
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: headline length 55 — upgrades to 'done'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "done"
Received: "warn"

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:742:7
   const skillCount = Array.isArray(u.skills) ? u.skills.length : (u.skills ? 1 : 0);
 
   if (headlineLen >= 35) fixes.find(f => f.key === 'headline').status = 'warn';
-  if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
+  if (headlineLen > 55) fixes.find(f => f.key === 'headline').status = 'done';
   if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
   if (aboutLen >= 170) fixes.find(f => f.key === 'about').status = 'done';
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: headline length 55 — upgrades to 'done'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "done"
Received: "warn"

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:743:7
 
   if (headlineLen >= 35) fixes.find(f => f.key === 'headline').status = 'warn';
   if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
-  if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
+  if (aboutLen < 120) fixes.find(f => f.key === 'about').status = 'warn';
   if (aboutLen >= 170) fixes.find(f => f.key === 'about').status = 'done';
   if (skillCount >= 8) fixes.find(f => f.key === 'skills').status = 'done';
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: about length 119 — stays 'bad'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bad"
Received: "warn"

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:743:40
 
   if (headlineLen >= 35) fixes.find(f => f.key === 'headline').status = 'warn';
   if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
-  if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
+  if (aboutLen >= 120) fixes.find(f => true).status = 'warn';
   if (aboutLen >= 170) fixes.find(f => f.key === 'about').status = 'done';
   if (skillCount >= 8) fixes.find(f => f.key === 'skills').status = 'done';
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: about length 120 — upgrades to 'warn'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "warn"
Received: "bad"

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:744:7
   if (headlineLen >= 35) fixes.find(f => f.key === 'headline').status = 'warn';
   if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
   if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
-  if (aboutLen >= 170) fixes.find(f => f.key === 'about').status = 'done';
+  if (aboutLen < 170) fixes.find(f => f.key === 'about').status = 'done';
   if (skillCount >= 8) fixes.find(f => f.key === 'skills').status = 'done';
 
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: about length 119 — stays 'bad'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bad"
Received: "done"

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:744:7
   if (headlineLen >= 35) fixes.find(f => f.key === 'headline').status = 'warn';
   if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
   if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
-  if (aboutLen >= 170) fixes.find(f => f.key === 'about').status = 'done';
+  if (aboutLen > 170) fixes.find(f => f.key === 'about').status = 'done';
   if (skillCount >= 8) fixes.find(f => f.key === 'skills').status = 'done';
 
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: about length 170 — upgrades to 'done'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "done"
Received: "warn"

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:745:35
   if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
   if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
   if (aboutLen >= 170) fixes.find(f => f.key === 'about').status = 'done';
-  if (skillCount >= 8) fixes.find(f => f.key === 'skills').status = 'done';
+  if (skillCount >= 8) fixes.find(() => undefined).status = 'done';
 
   return { score, sections, fixes };
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: skillCount 8 — upgrades to 'done'
statusReason: TypeError: Cannot set properties of undefined (setting 'status')

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:745:40
   if (headlineLen >= 55) fixes.find(f => f.key === 'headline').status = 'done';
   if (aboutLen >= 120) fixes.find(f => f.key === 'about').status = 'warn';
   if (aboutLen >= 170) fixes.find(f => f.key === 'about').status = 'done';
-  if (skillCount >= 8) fixes.find(f => f.key === 'skills').status = 'done';
+  if (skillCount >= 8) fixes.find(f => f.key !== 'skills').status = 'done';
 
   return { score, sections, fixes };
killedBy: mockBackendGetProfileReadiness() pure function GB boundary: skillCount 8 — upgrades to 'done'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "done"
Received: "warn"

[Killed] BlockStatement
js/components/pages/MessagingPage.js:750:37
   return { score, sections, fixes };
 }
 
-function computeGuidePreview(state) {
-  if (!state || !state.goal) return '';
-  const variants = _OUTREACH_TEMPLATES[state.goal] || [];
-  if (!variants.length) return '';
-  const variant = variants[state.variantIdx % variants.length];
-  return variant.template(state.details || {});
-}
+function computeGuidePreview(state) {}
 
 /* ─────────────────────────────────────────────────────────────
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    ""

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:751:7
 }
 
 function computeGuidePreview(state) {
-  if (!state || !state.goal) return '';
+  if (true) return '';
   const variants = _OUTREACH_TEMPLATES[state.goal] || [];
   if (!variants.length) return '';
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    ""

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:751:7
 }
 
 function computeGuidePreview(state) {
-  if (!state || !state.goal) return '';
+  if (state || !state.goal) return '';
   const variants = _OUTREACH_TEMPLATES[state.goal] || [];
   if (!variants.length) return '';
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    ""

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:752:20
 
 function computeGuidePreview(state) {
   if (!state || !state.goal) return '';
-  const variants = _OUTREACH_TEMPLATES[state.goal] || [];
+  const variants = _OUTREACH_TEMPLATES[state.goal] && [];
   if (!variants.length) return '';
   const variant = variants[state.variantIdx % variants.length];
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    ""

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:752:20
 
 function computeGuidePreview(state) {
   if (!state || !state.goal) return '';
-  const variants = _OUTREACH_TEMPLATES[state.goal] || [];
+  const variants = false;
   if (!variants.length) return '';
   const variant = variants[state.variantIdx % variants.length];
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    ""

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:753:7
 function computeGuidePreview(state) {
   if (!state || !state.goal) return '';
   const variants = _OUTREACH_TEMPLATES[state.goal] || [];
-  if (!variants.length) return '';
+  if (true) return '';
   const variant = variants[state.variantIdx % variants.length];
   return variant.template(state.details || {});
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    ""

[Killed] BooleanLiteral
js/components/pages/MessagingPage.js:753:7
 function computeGuidePreview(state) {
   if (!state || !state.goal) return '';
   const variants = _OUTREACH_TEMPLATES[state.goal] || [];
-  if (!variants.length) return '';
+  if (variants.length) return '';
   const variant = variants[state.variantIdx % variants.length];
   return variant.template(state.details || {});
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    ""

[Killed] ArithmeticOperator
js/components/pages/MessagingPage.js:754:28
   if (!state || !state.goal) return '';
   const variants = _OUTREACH_TEMPLATES[state.goal] || [];
   if (!variants.length) return '';
-  const variant = variants[state.variantIdx % variants.length];
+  const variant = variants[state.variantIdx * variants.length];
   return variant.template(state.details || {});
 }
killedBy: MessagingPage Component Tests Uses variantIdx modulo to wrap around variants seamlessly
statusReason: TypeError: Cannot read properties of undefined (reading 'template')

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:755:27
   const variants = _OUTREACH_TEMPLATES[state.goal] || [];
   if (!variants.length) return '';
   const variant = variants[state.variantIdx % variants.length];
-  return variant.template(state.details || {});
+  return variant.template(false);
 }
 
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    "Hi [Name],·
I saw the [role] opening at [Company] and I’m really interested. I’m [your name/major] with experience in [skill/area].·
Would you be open to a quick chat about the team and what you look for in candidates?"

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:755:27
   const variants = _OUTREACH_TEMPLATES[state.goal] || [];
   if (!variants.length) return '';
   const variant = variants[state.variantIdx % variants.length];
-  return variant.template(state.details || {});
+  return variant.template(true);
 }
 
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Frank"
Received string:    "Hi [Name],·
I saw the [role] opening at [Company] and I’m really interested. I’m [your name/major] with experience in [skill/area].·
Would you be open to a quick chat about the team and what you look for in candidates?"

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:762:3
    Outreach guide templates (from your old app.js)
    ───────────────────────────────────────────────────────────── */
 const _OUTREACH_GOALS = [
-  { key: 'advice', icon: '', label: 'Ask for Advice', desc: 'Career guidance from a pro' },
+  {},
   { key: 'job', icon: '', label: 'Job / Internship', desc: 'Express interest in a role' },
   { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Ask for Advice. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] StringLiteral
js/components/pages/MessagingPage.js:762:37
    Outreach guide templates (from your old app.js)
    ───────────────────────────────────────────────────────────── */
 const _OUTREACH_GOALS = [
-  { key: 'advice', icon: '', label: 'Ask for Advice', desc: 'Career guidance from a pro' },
+  { key: 'advice', icon: '', label: "", desc: 'Career guidance from a pro' },
   { key: 'job', icon: '', label: 'Job / Internship', desc: 'Express interest in a role' },
   { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
killedBy: MessagingPage Component Tests Does not overwrite existing guide state when reopening
statusReason: TestingLibraryElementError: Unable to find an element with the text: Ask for Advice. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:763:3
    ───────────────────────────────────────────────────────────── */
 const _OUTREACH_GOALS = [
   { key: 'advice', icon: '', label: 'Ask for Advice', desc: 'Career guidance from a pro' },
-  { key: 'job', icon: '', label: 'Job / Internship', desc: 'Express interest in a role' },
+  {},
   { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
   { key: 'mentor', icon: '', label: 'Find a Mentor', desc: 'Request ongoing guidance' },
killedBy: MessagingPage Component Tests setGuideState shallow-merges patch, preserves other keys
statusReason: TestingLibraryElementError: Unable to find an element with the text: Job / Internship. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] StringLiteral
js/components/pages/MessagingPage.js:763:23
    ───────────────────────────────────────────────────────────── */
 const _OUTREACH_GOALS = [
   { key: 'advice', icon: '', label: 'Ask for Advice', desc: 'Career guidance from a pro' },
-  { key: 'job', icon: '', label: 'Job / Internship', desc: 'Express interest in a role' },
+  { key: 'job', icon: "Stryker was here!", label: 'Job / Internship', desc: 'Express interest in a role' },
   { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
   { key: 'mentor', icon: '', label: 'Find a Mentor', desc: 'Request ongoing guidance' },

[Survived] StringLiteral
js/components/pages/MessagingPage.js:764:61
 const _OUTREACH_GOALS = [
   { key: 'advice', icon: '', label: 'Ask for Advice', desc: 'Career guidance from a pro' },
   { key: 'job', icon: '', label: 'Job / Internship', desc: 'Express interest in a role' },
-  { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
+  { key: 'network', icon: '', label: 'Build Network', desc: "" },
   { key: 'mentor', icon: '', label: 'Find a Mentor', desc: 'Request ongoing guidance' },
   { key: 'followup', icon: '', label: 'Follow Up', desc: 'After meeting or applying' },

[Survived] StringLiteral
js/components/pages/MessagingPage.js:764:27
 const _OUTREACH_GOALS = [
   { key: 'advice', icon: '', label: 'Ask for Advice', desc: 'Career guidance from a pro' },
   { key: 'job', icon: '', label: 'Job / Internship', desc: 'Express interest in a role' },
-  { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
+  { key: 'network', icon: "Stryker was here!", label: 'Build Network', desc: 'Connect in your field' },
   { key: 'mentor', icon: '', label: 'Find a Mentor', desc: 'Request ongoing guidance' },
   { key: 'followup', icon: '', label: 'Follow Up', desc: 'After meeting or applying' },

[Killed] ObjectLiteral
js/components/pages/MessagingPage.js:766:3
   { key: 'job', icon: '', label: 'Job / Internship', desc: 'Express interest in a role' },
   { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
   { key: 'mentor', icon: '', label: 'Find a Mentor', desc: 'Request ongoing guidance' },
-  { key: 'followup', icon: '', label: 'Follow Up', desc: 'After meeting or applying' },
+  {},
   { key: 'referral', icon: '', label: 'Ask for Referral', desc: 'Request a job referral' },
 ];
killedBy: MessagingPage Component Tests selectGoal computes and stores non-empty preview natively
statusReason: TestingLibraryElementError: Unable to find an element with the text: Follow Up. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Survived] StringLiteral
js/components/pages/MessagingPage.js:766:28
   { key: 'job', icon: '', label: 'Job / Internship', desc: 'Express interest in a role' },
   { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
   { key: 'mentor', icon: '', label: 'Find a Mentor', desc: 'Request ongoing guidance' },
-  { key: 'followup', icon: '', label: 'Follow Up', desc: 'After meeting or applying' },
+  { key: 'followup', icon: "Stryker was here!", label: 'Follow Up', desc: 'After meeting or applying' },
   { key: 'referral', icon: '', label: 'Ask for Referral', desc: 'Request a job referral' },
 ];

[Survived] StringLiteral
js/components/pages/MessagingPage.js:767:65
   { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
   { key: 'mentor', icon: '', label: 'Find a Mentor', desc: 'Request ongoing guidance' },
   { key: 'followup', icon: '', label: 'Follow Up', desc: 'After meeting or applying' },
-  { key: 'referral', icon: '', label: 'Ask for Referral', desc: 'Request a job referral' },
+  { key: 'referral', icon: '', label: 'Ask for Referral', desc: "" },
 ];
 

[Survived] StringLiteral
js/components/pages/MessagingPage.js:767:39
   { key: 'network', icon: '', label: 'Build Network', desc: 'Connect in your field' },
   { key: 'mentor', icon: '', label: 'Find a Mentor', desc: 'Request ongoing guidance' },
   { key: 'followup', icon: '', label: 'Follow Up', desc: 'After meeting or applying' },
-  { key: 'referral', icon: '', label: 'Ask for Referral', desc: 'Request a job referral' },
+  { key: 'referral', icon: '', label: "", desc: 'Request a job referral' },
 ];
 

[Survived] StringLiteral
js/components/pages/MessagingPage.js:773:5
 const _OUTREACH_TIPS = {
   advice: [
     'Keep it short (3–5 sentences).',
-    'Ask for 15–20 minutes, not “a call sometime”.',
+    "",
     'End with an easy yes/no question.',
   ],

[Survived] StringLiteral
js/components/pages/MessagingPage.js:774:5
   advice: [
     'Keep it short (3–5 sentences).',
     'Ask for 15–20 minutes, not “a call sometime”.',
-    'End with an easy yes/no question.',
+    "",
   ],
   job: [

[Survived] ArrayDeclaration
js/components/pages/MessagingPage.js:776:8
     'Ask for 15–20 minutes, not “a call sometime”.',
     'End with an easy yes/no question.',
   ],
-  job: [
-    'Mention the role + why you’re excited (1 line).',
-    'Add a quick signal (project/skill) to show fit.',
-    'Ask for next step: “open to a quick chat?”',
-  ],
+  job: [],
   network: [
     'Be specific about why you reached out.',

[Survived] StringLiteral
js/components/pages/MessagingPage.js:779:5
   job: [
     'Mention the role + why you’re excited (1 line).',
     'Add a quick signal (project/skill) to show fit.',
-    'Ask for next step: “open to a quick chat?”',
+    "",
   ],
   network: [

[Survived] ArrayDeclaration
js/components/pages/MessagingPage.js:781:12
     'Add a quick signal (project/skill) to show fit.',
     'Ask for next step: “open to a quick chat?”',
   ],
-  network: [
-    'Be specific about why you reached out.',
-    'Reference something from their profile if possible.',
-    'Don’t ask for too much — ask to connect first.',
-  ],
+  network: [],
   mentor: [
     'Be respectful with time (20 minutes).',

[Survived] StringLiteral
js/components/pages/MessagingPage.js:797:5
     'Keep it upbeat, not pushy.',
   ],
   referral: [
-    'Ask only after showing fit (skill/project).',
+    "",
     'Make it easy: “If you’re open to referring…”',
     'Respect a “no” and thank them anyway.',

[Survived] StringLiteral
js/components/pages/MessagingPage.js:810:13
     },
     {
-      tone: 'Professional',
+      tone: "",
     },

[Survived] StringLiteral
js/components/pages/MessagingPage.js:820:13
     },
     {
-      tone: 'Warm',
+      tone: "",
     },

[Survived] StringLiteral
js/components/pages/MessagingPage.js:826:13
   ],
   network: [
     {
-      tone: 'Friendly',
+      tone: "",
     },

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:857:5
 // =============================================================
 // TEST EXPORTS (Only active in Node.js/Jest environment)
 // =============================================================
-if (typeof module !== 'undefined' && module.exports) {
+if (true) {
   module.exports = {
     MessagingPage,

[Survived] ConditionalExpression
js/components/pages/MessagingPage.js:857:5
 // =============================================================
 // TEST EXPORTS (Only active in Node.js/Jest environment)
 // =============================================================
-if (typeof module !== 'undefined' && module.exports) {
+if (true && module.exports) {
   module.exports = {
     MessagingPage,
