[Killed] MethodExpression
js/components/pages/MessagingPage.js:262:85
 
   const allConversations = conversations || [];
   const filteredConvs = search
-    ? allConversations.filter(c => (c.participantName || '').toLowerCase().includes(search.toLowerCase()))
+    ? allConversations.filter(c => (c.participantName || '').toLowerCase().includes(search.toUpperCase()))
     : allConversations;
   const selectedConv = allConversations.find(c => c.id === selectedId);
killedBy: MessagingPage Component Tests Search 'BOB' matches 'bob' — search query lowercased
statusReason: TestingLibraryElementError: Unable to find an element with the text: bob. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] LogicalOperator
js/components/pages/MessagingPage.js:457:30
 }) {
   if (!state) return null;
 
-  const tips = state.goal ? (_OUTREACH_TIPS[state.goal] || []) : [];
+  const tips = state.goal ? (_OUTREACH_TIPS[state.goal] && []) : [];
 
   const variants = state.goal ? (_OUTREACH_TEMPLATES[state.goal] || []) : [];
killedBy: MessagingPage Component Tests OutreachGuidePanel shows tips after goal selected
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Keep it short/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:504:12
             </div>
           )}
 
-          {state.step === 2 && (
+          {true && (
             <div className="li-msg-guide__step">
               <div className="li-msg-guide__step-label">Personalize your message</div>
killedBy: MessagingPage Component Tests Initializes fresh state for new conversation in openOutreachGuide
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="li-msg-guide__step-label">Personalize your message</div> instead

[Killed] EqualityOperator
js/components/pages/MessagingPage.js:558:72
       </div>
 
       <div className="li-msg-guide__footer">
-        <button className="li-msg-guide__nav-btn" style={{ visibility: state.step > 1 ? 'visible' : 'hidden' }} onClick={onBack}>
+        <button className="li-msg-guide__nav-btn" style={{ visibility: state.step >= 1 ? 'visible' : 'hidden' }} onClick={onBack}>
           ← Back
         </button>
killedBy: MessagingPage Component Tests backStep is no-op when step is already 1
statusReason: Error: expect(element).not.toBeVisible()

Received element is visible:
  <button class="li-msg-guide__nav-btn" style="visibility: visible;" />

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:563:12
         </button>
         <div style={{ flex: 1 }} />
         <button className="li-msg-guide__nav-btn primary" onClick={onNext}>
-          {state.step === 3 ? 'Done' : 'Next →'}
+          {false ? 'Done' : 'Next →'}
         </button>
       </div>
killedBy: MessagingPage Component Tests nextStep is no-op when already on step 3
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="li-msg-guide__nav-btn primary">Next →</button> instead

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:647:29
 
               <div className="li-msg-score__breakdown">
                 {(s.sections || []).map(sec => {
-                  const c = sec.score >= 80 ? 'good' : sec.score >= 70 ? 'warn' : 'bad';
+                  const c = false ? 'good' : sec.score >= 70 ? 'warn' : 'bad';
                   return (
                     <div key={sec.key} className="li-msg-score__bar">
killedBy: MessagingPage Component Tests ProfileReadinessPanel: section bars render correct percentage labels and CSS color classes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
js/components/pages/MessagingPage.js:665:40
               <div className="li-msg-score__card">
                 <div className="li-msg-score__card-title">Quick fixes</div>
                 <div className="li-msg-score__fixes">
-                  {(s.fixes || []).map(f => (
-                    <div key={f.key} className="li-msg-score__fix">
-                      <div className="li-msg-score__fix-left">
-                        <span className={'li-msg-score__dot ' + f.status}></span>
-                        <span className="li-msg-score__fix-label">{f.label}</span>
-                      </div>
-                      {f.status === 'done' ? (
-                        <span className="li-msg-score__done">Done</span>
-                      ) : (
-                        <span className="li-msg-score__todo">Fix</span>
-                      )}
-                    </div>
-                  ))}
+                  {(s.fixes || []).map(() => undefined)}
                 </div>
 
killedBy: MessagingPage Component Tests ProfileReadinessPanel: fix status 'done' renders 'Done', not 'Fix'
statusReason: TestingLibraryElementError: Unable to find an element with the text: Done. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="max-width: 900px; margin: 24px auto; padding: 0px 16px;"
    >

[Killed] ConditionalExpression
js/components/pages/MessagingPage.js:751:7
 }
 
 function computeGuidePreview(state) {
-  if (!state || !state.goal) return '';
+  if (false) return '';
   const variants = _OUTREACH_TEMPLATES[state.goal] || [];
   if (!variants.length) return '';
killedBy: computeGuidePreview() pure function Returns '' when state is null
statusReason: TypeError: Cannot read properties of null (reading 'goal')
